
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_БухгалтерскаяНоменклатура", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеКод);
	ПолеВвода_АЛФ.Заголовок = "Бухгалтерская номенклатура";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_БухгалтерскаяНоменклатура";
	
	Элементы.ТоварнаяКатегория.Заголовок = "Номенклатура снабжения";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Конфигурация", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Конфигурация";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Конфигурация";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Размер", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Размер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Размер";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Цвет", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Цвет";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Цвет";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрефиксИнвентарногоНомера", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Префикс инвентарного номера";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрефиксИнвентарногоНомера";

	//Перенос доработок, комментарий в оригинале	

	//Если РольДоступна("ИИТ_Кладовщик") Тогда
	//	Для Каждого Элемент Из Элементы Цикл
	//		Попытка
	//			Элемент.ТолькоПросмотр = Истина;
	//		Исключение
	//		КонецПопытки;
	//	КонецЦикла;
	//	Если Объект.Родитель.Наименование = "Снабжение" Тогда
	//		Элементы.ВидНоменклатуры.Доступность = Истина;
	//		Элементы.ГруппаВидНоменклатуры.Доступность = Истина;
	//		Элементы.ГруппаЛеваяКолонка.Доступность = Истина;
	//		Элементы.ГруппаКолонки.Доступность = Истина;
	//		
	//		Элементы.ВидНоменклатуры.ТолькоПросмотр = Ложь;
	//		Элементы.ГруппаВидНоменклатуры.ТолькоПросмотр = Ложь;
	//		Элементы.ГруппаЛеваяКолонка.ТолькоПросмотр = Ложь;
	//		Элементы.ГруппаКолонки.ТолькоПросмотр = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
