&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Элементы формы
	ПолеВвода_АЛФ = Элементы.Вставить("ТекущаяБригада", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая, Элементы.ДатаПриемаВидЗанятостиГруппа);
	ПолеВвода_АЛФ.Заголовок = "Текущая бригада";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ТекущаяБригада";

	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_Бригада", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая, Элементы.Подразделение);
	ПолеВвода_АЛФ.Заголовок = "Бригада";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Бригада";

	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая, Элементы.СведенияТрудовойКнижкиГруппа);
	ПолеВвода_АЛФ.Заголовок = "Объект строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектСтроительства";

	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ОфициальныйОклад", Тип("ПолеФормы"), Элементы.НачисленияГруппа, Элементы.Оклад);
	ПолеВвода_АЛФ.Заголовок = "Официальный оклад";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОфициальныйОклад"; 
	
	Элементы.Оклад.Заголовок = "Ставка в час";    
	
	Элементы.РазрешениеНаПроживание.Видимость = Ложь;
	Элементы.РазрешениеНаРаботу.Видимость = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_СотрудникПриИзмененииПосле(Элемент)
	//+ИИТ_Аксеньюшкин
	ПроставитьБригаду();
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

#Область Перенос_доработок

//ИИТ_Аксеньюшкин
Процедура ПроставитьБригаду()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_БригадыФизическихЛицСрезПоследних.Бригада КАК Бригада
	|ИЗ
	|	РегистрСведений.ИИТ_БригадыФизическихЛиц.СрезПоследних(, Физлицо = &ФЛ) КАК ИИТ_БригадыФизическихЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФЛ", Объект.ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущаяБригада = Выборка.Бригада;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти