
&После("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)

	Для Каждого СтрокаТЗ Из Материалы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ИнвентарныйНомер) Тогда

			Движение = Движения.ИИТ_ОстаткиТМЦ.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.МОЛ = МОЛСписания;
			Движение.Склад = Склад;
			Движение.Номенклатура = СтрокаТЗ.Номенклатура;
			Движение.Количество = СтрокаТЗ.Количество;
			Движение.Сумма = СтрокаТЗ.СуммаСписания;
			Движение.ОбъектСтроительства = ИИТ_ОбъектОтправитель;
		
		Иначе
				
			Движение = Движения.ИИТ_ОстаткиОсновныхСредствИИнструмента.ДобавитьРасход();
			Движение.Период 				= Дата;
			Движение.МОЛ 					= МОЛСписания;
			Движение.Склад 					= Склад;
			Движение.ОсновноеСредство 		= СтрокаТЗ.Номенклатура;
			Движение.ИнвентарныйНомер 		= СтрокаТЗ.ИнвентарныйНомер;
			Движение.СерийныйНомер 			= СтрокаТЗ.СерийныйНомер;  
			
			Структура = Новый Структура;
			Структура.Вставить("СерийныйНомер"		, СтрокаТЗ.СерийныйНомер);
			Структура.Вставить("ИнвентарныйНомер"	, СтрокаТЗ.ИнвентарныйНомер); 		
			Движение.СерийныйИнвентарныйНомер   = ИИТ_ВспомогательныеФункцииСервер.НайтиСерийныйИнвентарныйНомер(Структура); 

			Движение.Количество 			= СтрокаТЗ.Количество;
			Движение.Стоимость 				= СтрокаТЗ.СуммаСписания;
			Движение.ОбъектСтроительства 	= ИИТ_ОбъектОтправитель;

		КонецЕсли;

	КонецЦикла;
	
	Движения.ИИТ_ОстаткиОсновныхСредствИИнструмента.Записать();
	Движения.ИИТ_ОстаткиТМЦ.Записать();
	
КонецПроцедуры
