
&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)   
	//Перенос доработки. Механизм неочевиден, добавлено условие и попытка
	Если НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Попытка
			НомСсылка = ЭтаФорма.ВладелецФормы.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ВладелецФормы.Номенклатура;
			ПриОткрытииНаСервере(НомСсылка);
		Исключение
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(НомСсылка)
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Применение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Строка(НомСсылка);
КонецПроцедуры