
#Область Перенос_доработок

//ИИТ_Аксеньюшкин
Функция ПолучитьСостояниеЗаявки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
	|ИЗ
	|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект = &Объект) КАК РегистрСостоянийОбъектовСрезПоследних";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СостояниеОбъекта;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

#КонецОбласти

//Нет такого
//&ИзменениеИКонтроль("ЗаполнитьЦФОПроект")
//Процедура АЛФ_ЗаполнитьЦФОПроект()
//#Удаление
//	Если НЕ ОплатаПоДоговоруПоставки Тогда

//		Для каждого СтрокаДвижения Из ДвиженияОперации Цикл
//			СтрокаДвижения.ЦФО 		= ЦФО;			
//			СтрокаДвижения.Проект 	= Проект;
//		КонецЦикла;
//	КонецЕсли;
//#КонецУдаления
//КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура АЛФ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	//+ИИТ_Аксеньюшкин
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

		Если ДвиженияОперации.Количество() > 0 Тогда
			СтрокаДвижения = ДвиженияОперации[0];
			СтрокаДвижения.Сумма = ДанныеЗаполнения.Товары.Итог("СуммаСНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаСНДС");
			СтрокаДвижения.СтавкаНДС = ДанныеЗаполнения.Товары[0].СтавкаНДС;
			СтрокаДвижения.СуммаНДС = ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");
			СтрокаДвижения.Проект = ДанныеЗаполнения.Товары[0].ЭтапСтроительства;
			СтрокаДвижения.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Материалы");
		КонецЕсли;
		СуммаДокумента = ДанныеЗаполнения.Товары.Итог("СуммаСНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаСНДС");
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		ИИТ_ЗаказПоставщику = ДанныеЗаполнения.Ссылка;
		ЖелательнаяДатаПлатежа = Дата(1,1,1);

		ИИТ_ОписаниеЗаявки = ДанныеЗаполнения.ИИТ_НоменклатураСтрокой;
		ИИТ_НоменклатураСтрокой = ДанныеЗаполнения.ИИТ_НоменклатураСтрокой;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ИИТ_ОбъектСтроительства) Тогда
			ИИТ_СчетОрганизации = ИИТ_ВспомогательныеФункцииСервер.ПолучитьСчетПоУмолчаниюОбъектаСтроительства(ДанныеЗаполнения.ИИТ_ОбъектСтроительства, ДанныеЗаполнения.Организация);
		Иначе
			ИИТ_СчетОрганизации = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;

	КонецЕсли;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура АЛФ_ОбработкаУдаленияПроведения(Отказ)  
	
	ЗаявкиНаОперации.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ); 
	
	ОтменитьПроведениеДокументовВходящихВЦепочкуПлатежей(Отказ);
#Вставка     
	//+ИИТ_Аксеньюшкин
	Для Н = 1 По 16 Цикл
		
		Согласующий = ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)];
		Если Строка(Согласующий) = "Бухгалтер" Тогда
			Согласующий = ИИТ_СчетОрганизации.Ответственный;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Согласующий) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
		НоваяЗапись.Ответственный = Согласующий;
		НоваяЗапись.Заявка = Ссылка;
		НоваяЗапись.ДатаСоздания = ТекущаяДата();
		НоваяЗапись.Пояснение = "Заявка " + Номер + ", контрагент: " + Строка(Контрагент) + 
								" на сумму: " + Строка(СуммаДокумента) + " отклонена при согласовании";
		НоваяЗапись.Записать(Истина);

	КонецЦикла;

	НаборЗаписей = РегистрыСведений.ИИТ_ДосрочноеСогласование.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаОплату.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
	НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
	НоваяЗапись.Ответственный = Ответственный;
	НоваяЗапись.Заявка = Ссылка;
	НоваяЗапись.ДатаСоздания = ТекущаяДата();
	НоваяЗапись.Пояснение = "Заявка " + Номер + ", контрагент: " + Строка(Контрагент) + 
							" на сумму: " + Строка(СуммаДокумента) + " отклонена при согласовании";
	НоваяЗапись.Записать(Истина);
	//-ИИТ_Аксеньюшкин
#КонецВставки
КонецПроцедуры

&После("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	//+ИИТ_Аксеньюшкин
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ИИТ_МОРС_Пройден = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЦФО) И ДвиженияОперации.Количество() > 0 Тогда
		ЦФО = ДвиженияОперации[0].ЦФО;
	КонецЕсли;
	
	Если ДвиженияОперации.Количество() > 0 И ЗначениеЗаполнено(ДвиженияОперации[0].Проект) Тогда
		Проект = ДвиженияОперации[0].Проект;
	КонецЕсли;
	
	Если Проект.Проект Тогда
		ИИТ_ПроектСогласования = Проект;
	ИначеЕсли Проект.Родитель.Проект Тогда
		ИИТ_ПроектСогласования = Проект.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Проект Тогда
		ИИТ_ПроектСогласования = Проект.Родитель.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Родитель.Проект Тогда
		ИИТ_ПроектСогласования = Проект.Родитель.Родитель.Родитель;
	КонецЕсли;
	
	Если Проект.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект;
	ИначеЕсли Проект.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель.Родитель.Родитель;
	КонецЕсли;
	
	Если ДвиженияОперации.Количество() > 0 И Не ЗначениеЗаполнено(ДвиженияОперации[0].ЭлементСтруктурыЗадолженности) Тогда
		ДвиженияОперации[0].ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИИТ_ПроектСогласования) Тогда
		ИИТ_ПроектСогласования = ИИТ_ПроектМОРС;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИИТ_Финслужба") И Не РольДоступна("ИИТ_Акционер") Тогда
		//Проверяем доступность по операциям
		МассивОпераций = ИИТ_ВспомогательныеФункцииСервер.ПолучитьДоступныеВидыОперацийЗаявкаНаРасходДСЗапись();
		Если МассивОпераций.Найти(ВидОперацииУХ) = Неопределено Тогда
			Сообщить("Недостаточно прав для создания документа с видом операции: " + Строка(ВидОперацииУХ));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ДвиженияОперации.Количество() > 0 Тогда
		ИИТ_СтатьяДДСОсновная = ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;
	КонецЕсли;
	
	ИИТ_ВнутреннийРасход = Ложь;
	Для Каждого СтрокаДвижений Из ДвиженияОперации Цикл
		Если СтрокаДвижений.СтатьяДвиженияДенежныхСредств.ИИТ_ИспользованиеДляВнутреннихОборотов Тогда
			ИИТ_ВнутреннийРасход = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаДвижений.СтавкаНДС) = Ложь И СтрокаДвижений.СуммаНДС = 0 Тогда 
			СтрокаДвижений.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИИТ_ЗаказПоставщику) И ЗаказыПоставщику.Количество() = 0 Тогда
		НоваяСтрока = ЗаказыПоставщику.Добавить();
		НоваяСтрока.ЗаказПоставщику = ИИТ_ЗаказПоставщику;
	КонецЕсли;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура АЛФ_ПриКопировании(ОбъектКопирования)
	
	//+ИИТ_Аксеньюшкин
	ИИТ_МОРС_Пройден = Ложь;
	ИИТ_МОРСЗаднимЧислом = Ложь;
	ИИТ_ЗаменыСчетов.Очистить();
	ИИТ_ЗаменыСумм.Очистить();
	ДвиженияОперацииДоЗамены.Очистить();
	ИИТ_ПредыдущийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	ИИТ_ОтразитьБДДС = Ложь;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры        

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)
   	
    ТекСостояние = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Ссылка);
	СостоянияПроведения = Новый Массив;
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.Утверждена);
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.НаУтверждении);
	
	Если СостоянияПроведения.Найти(ТекСостояние) = Неопределено Тогда
		ТекСостояние = Перечисления.СостоянияСогласования.Утверждена;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТекущееСостояниеСогласования", ТекСостояние);
	#Удаление	
	ЗаявкиНаОперации.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения); 
	#КонецУдаления
#Вставка
//+ИИТ_Аксеньюшкин
	Для Каждого СтрокаДвижения Из ДвиженияОперации Цикл
		Если ЗначениеЗаполнено(СтрокаДвижения.Проект) И СтрокаДвижения.Проект.ПометкаУдаления Тогда
			Сообщить("Нельзя проводить заявку с этапом, помеченным на удаление.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Строка(ЭтотОбъект.ВидОперацииУХ) = "Перевод внутри счета" Тогда
		Если СчетКассаОрганизации <> ИИТ_СчетОрганизации Тогда
			Сообщить("Счет организации / касса отличается от счета / кассы списания. Действие отменено.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин

	//+ИИТ_Аксеньюшкин
	Для Каждого СтрокаРасшифровки ИЗ ДвиженияОперации Цикл
		Если Не ЗначениеЗаполнено(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств) Тогда
			Сообщить("Проведение отменено, не заполнена статья ДДС в строке №" + Строка(СтрокаРасшифровки.НомерСтроки));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Строка(ВидОперацииУХ) = "Перевод на счет другой организации" ИЛИ Строка(ВидОперацииУХ) = "Перевод внутри счета"
	ИЛИ Строка(ВидОперацииУХ) = "Перевод на другой счет" Тогда
		Если Не ЗначениеЗаполнено(ИИТ_ОбъектСписания) Тогда
			Сообщить("Проведение отменено, не заполнен объект списания");
			Отказ = Истина;			
		КонецЕсли;
	Иначе
		Для Каждого СтрокаРасшифровки Из ДвиженияОперации Цикл
			Если Не ЗначениеЗаполнено(СтрокаРасшифровки.Проект) Тогда
				Сообщить("Проведение отменено, не заполнен объект / этап строительства");
				Отказ = Истина;			
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	ЖелДата = ?(ЗначениеЗаполнено(ЖелательнаяДатаПлатежа), ЖелательнаяДатаПлатежа, НачалоДня(ТекущаяДата()));
	ДатаПроведения = Мин(ЖелДата, ТекущаяДата());
	
	Если ЖелДата < НачалоДня(ТекущаяДата()) И Не ИИТ_МОРСЗаднимЧислом И Не РольДоступна("ПолныеПрава") Тогда
		//Сообщить("Желаемая дата проведения платежа не может быть меньше текущей даты!");
		//Отказ = Истина;
	КонецЕсли;
	
	//ПРОВЕДЕНИЕ БДДС И ДЕПОЗИТ
	Если ИИТ_МОРС_Пройден Тогда
		
		Если ЗначениеЗаполнено(СчетКассаОрганизации) И ЗначениеЗаполнено(СчетКассаЗачисления) И СчетКассаОрганизации = СчетКассаЗачисления Тогда
		
			Движение = Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.ДобавитьРасход();
			Движение.Период = ДатаПроведения;
			Движение.БанковскийСчет = СчетКассаОрганизации;
			Движение.ОбъектСтроительства = ИИТ_ОбъектСписания;
			Движение.Сумма = ДвиженияОперации[0].Сумма;
			Движение.СтатьяДДС = ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;					
			Если Движение.СтатьяДДС.Депозит Тогда
				Движение.Депозит = -Движение.Сумма;
			КонецЕсли;
			Движение.СуммаБДДС = Движение.Сумма;
			
			Движение = Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.ДобавитьПриход();
			Движение.Период = ДатаПроведения;
			Движение.БанковскийСчет = СчетКассаЗачисления;
			Движение.ОбъектСтроительства = ИИТ_ОбъектЗачисления;
			Движение.Сумма = ДвиженияОперации[0].Сумма;
			Движение.СтатьяДДС = ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;					
			Если Движение.СтатьяДДС.Депозит Тогда
				Движение.Депозит = -Движение.Сумма;
			КонецЕсли;
			Движение.СуммаБДДС = Движение.Сумма;
			
		ИначеЕсли Строка(ВидОперацииУХ) <> "Перевод на счет другой организации" Тогда
			
			Для Каждого СтрокаДанных Из ДвиженияОперации Цикл

				Если Прав(СокрЛП(Номер), 1) = "П" Тогда
					Движение = Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.ДобавитьПриход();
				Иначе
					Движение = Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.ДобавитьРасход();
				КонецЕсли;
				Движение.Период = ДатаПроведения;
				Движение.БанковскийСчет = ИИТ_СчетОрганизации;
				Движение.ЭтапСтроительства = СтрокаДанных.Проект;
				
				ПроектДвижения = СтрокаДанных.Проект;
				Если СтрокаДанных.Проект.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель.Родитель;
				КонецЕсли;
				
				Движение.ОбъектСтроительства = ПроектДвижения;
				Движение.Сумма = СтрокаДанных.Сумма;
				Движение.СтатьяДДС = СтрокаДанных.СтатьяДвиженияДенежныхСредств;	
				
				Если Движение.СтатьяДДС.Депозит И ИИТ_ОтразитьБДДС Тогда
					Движение.Депозит = -СтрокаДанных.Сумма;
				КонецЕсли;
				
				Если ИИТ_ОтразитьБДДС Тогда
					Движение.СуммаБДДС = Движение.Сумма;
				КонецЕсли;
				
			КонецЦикла;			
			
		КонецЕсли;
			
		Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.Записать();
		
	КонецЕсли;
	
	//ПРОВЕДЕНИЕ ПО РЕЗЕРВАМ ДС
	Если ИИТ_МОРС_Пройден И (Строка(ВидОперацииУХ) = "Перевод на счет другой организации"
	ИЛИ Строка(ВидОперацииУХ) = "Перевод на другой счет") Тогда
		
		Движение = Движения.ИИТ_РезервыДенежныхСредств.ДобавитьПриход();
		Движение.Период = ДатаПроведения;
		Движение.БанковскийСчет = СчетКассаОрганизации;
		Движение.ОбъектСтроительства = ИИТ_ОбъектСписания;
		Движение.СтатьяДДС = ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;
		Движение.Заявка = Ссылка;
		Движение.Сумма = ДвиженияОперации[0].Сумма;		
		
	КонецЕсли;
	
	Если ИИТ_МОРС_Пройден И Не ИИТ_ОтразитьБДДС И Прав(СокрЛП(Номер), 1) <> "П" Тогда
		
		Если (ЗначениеЗаполнено(СчетКассаОрганизации) И ЗначениеЗаполнено(СчетКассаЗачисления) И СчетКассаОрганизации = СчетКассаЗачисления)
		ИЛИ Строка(ВидОперацииУХ) = "Перевод на счет другой организации" Тогда
					
		ИначеЕсли Строка(ВидОперацииУХ) <> "Перевод на другой счет" Тогда
			
			Для Каждого СтрокаДанных Из ДвиженияОперации Цикл

				Движение = Движения.ИИТ_РезервыДенежныхСредств.ДобавитьПриход();
				Движение.Период = ДатаПроведения;
				Движение.БанковскийСчет = ИИТ_СчетОрганизации;
				
				ПроектДвижения = СтрокаДанных.Проект;
				Если СтрокаДанных.Проект.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель.Родитель;
				КонецЕсли;				
				Движение.ОбъектСтроительства = ПроектДвижения;
				Движение.СтатьяДДС = СтрокаДанных.СтатьяДвиженияДенежныхСредств;
				Движение.Заявка = Ссылка;
				Движение.Сумма = СтрокаДанных.Сумма;
				
			КонецЦикла;			
			
		КонецЕсли;		

	КонецЕсли;
	Движения.ИИТ_РезервыДенежныхСредств.Записать();
	
	НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
	Состояние = ПолучитьСостояниеЗаявки();

	Если ЗначениеЗаполнено(ИИТ_ОбъектСписания) И ЗначениеЗаполнено(ИИТ_ОбъектЗачисления) И 
	ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаЗайма
	И Состояние <> Перечисления.СостоянияСогласования.Возвращена И Состояние <> Перечисления.СостоянияСогласования.Черновик
	И Состояние <> Перечисления.СостоянияСогласования.Отклонена Тогда

		Движение = Движения.ИИТ_ЗаймыМеждуОбъектами.ДобавитьРасход();
		Движение.Период 					= ДатаЗачисления;
		Движение.ОбъектСтроительства 		= ИИТ_ОбъектСписания;
		Движение.ОбъектСтроительстваКорр 	= ИИТ_ОбъектЗачисления;
		Движение.Организация 				= Организация;
		Движение.СтатьяДДС              	= ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;
		Движение.Сумма 						= ?(ЗначениеЗаполнено(СуммаДокумента), СуммаДокумента, СуммаДокумента);
		
		Движение = Движения.ИИТ_ЗаймыМеждуОбъектами.ДобавитьПриход();
		Движение.Период 					= ДатаЗачисления;
		Движение.ОбъектСтроительства 		= ИИТ_ОбъектЗачисления;
		Движение.ОбъектСтроительстваКорр 	= ИИТ_ОбъектСписания;
		Движение.Организация 				= Организация; 
		Движение.СтатьяДДС              	= ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;
		Движение.Сумма 						= ?(ЗначениеЗаполнено(СуммаДокумента), СуммаДокумента, СуммаДокумента);
		
		Движения.ИИТ_ЗаймыМеждуОбъектами.Записать();
	
	КонецЕсли;
	
	Если Дата > Дата(2023,12,1) И Не ЗначениеЗаполнено(ИИТ_КодСметыБанка) И ЗначениеЗаполнено(ИИТ_СчетОрганизации) И ИИТ_СчетОрганизации.ИИТ_ИспользоватьКодСметыБанка Тогда
		//Сообщить("Необходимо заполнить код сметы банка");
		//Отказ = Истина;
	КонецЕсли;
	
	Если Движения.ИИТ_РезервыДенежныхСредств.Количество() > 0 И ИИТ_ЗаменыСчетов.Количество() > 0 Тогда

		ТЗДвижения = Движения.ИИТ_РезервыДенежныхСредств.Выгрузить();		
		Для Каждого СтрокаТЗ Из ТЗДвижения Цикл
			
			Движение = Движения.ИИТ_РезервыДенежныхСредств.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЗ);
			Движение.БанковскийСчет = ИИТ_ПредыдущийСчет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
			Движение = Движения.ИИТ_РезервыДенежныхСредств.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЗ);
			Движение.БанковскийСчет = ИИТ_ПредыдущийСчет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЦикла;

	КонецЕсли;
	
	Если Движения.ИИТ_РезервыДенежныхСредств.Количество() > 0 И ДвиженияОперацииДоЗамены.Количество() > 0 Тогда
		
		Для Каждого СтрокаДанных Из ДвиженияОперацииДоЗамены Цикл
			
			//Движение приход			
			Движение = Движения.ИИТ_РезервыДенежныхСредств.ДобавитьПриход();
			Движение.Период = СтрокаДанных.Дата;
			Движение.БанковскийСчет = ИИТ_СчетОрганизации;
			
			Если Строка(ВидОперацииУХ) <> "Перевод на счет другой организации" Тогда
				ПроектДвижения = СтрокаДанных.Проект;
				Если СтрокаДанных.Проект.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель.Родитель;
				КонецЕсли;				
			Иначе
				ПроектДвижения = ИИТ_ОбъектСписания;
			КонецЕсли;
			Движение.ОбъектСтроительства = ПроектДвижения;
			Движение.СтатьяДДС = СтрокаДанных.СтатьяДвиженияДенежныхСредств;
			Движение.Заявка = Ссылка;
			Движение.Сумма = СтрокаДанных.Сумма;
			
			//Движение расход
			Движение = Движения.ИИТ_РезервыДенежныхСредств.ДобавитьРасход();
			Движение.Период = ДатаПроведения;
			Движение.БанковскийСчет = ИИТ_СчетОрганизации;
			
			Если Строка(ВидОперацииУХ) <> "Перевод на счет другой организации" Тогда
				ПроектДвижения = СтрокаДанных.Проект;
				Если СтрокаДанных.Проект.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель;
				ИначеЕсли СтрокаДанных.Проект.Родитель.Родитель.Родитель.Проект Тогда
					ПроектДвижения = СтрокаДанных.Проект.Родитель.Родитель.Родитель;
				КонецЕсли;				
			Иначе
				ПроектДвижения = ИИТ_ОбъектСписания;
			КонецЕсли;
			Движение.ОбъектСтроительства = ПроектДвижения;
			Движение.СтатьяДДС = СтрокаДанных.СтатьяДвиженияДенежныхСредств;
			Движение.Заявка = Ссылка;
			Движение.Сумма = СтрокаДанных.Сумма;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.ИИТ_РезервыДенежныхСредств.Записать();
	//-ИИТ_Аксеньюшкин  
	 
	Движения.АС_БюджетРасходов.Записывать = Истина;
		Для Каждого СтрокаДанных Из ДвиженияОперации Цикл				
			ТекДоговор	= Ссылка.ДоговорКонтрагента;
			Если НЕ ЗначениеЗаполнено(ТекДоговор) Тогда   
				Если ЗначениеЗаполнено(Ссылка.ДокументПланирования) Тогда 
					Если ЗначениеЗаполнено(Ссылка.ДокументПланирования.ДоговорКонтрагента) Тогда  
						ТекДоговор = Ссылка.ДокументПланирования.ДоговорКонтрагента;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекДоговор) Тогда 
				//Продолжить;
			КонецЕсли;
			
			ТекЭтап 				= СтрокаДанных.Проект; 
			ТекОбъектСтроительства 	= ИИТ_ВспомогательныеФункцииСервер.МаксимальныйУровеньСправочника(ТекЭтап);

			Если НЕ ЗначениеЗаполнено(ТекОбъектСтроительства) Тогда  
				Если ЗначениеЗаполнено(Ссылка.Проект) Тогда
					ТекЭтап 				= Ссылка.Проект;
					ТекОбъектСтроительства 	= ИИТ_ВспомогательныеФункцииСервер.МаксимальныйУровеньСправочника(ТекЭтап); 	
				КонецЕсли; 
				Если НЕ ЗначениеЗаполнено(ТекОбъектСтроительства) Тогда 
					//Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Движение = Движения.АС_БюджетРасходов.ДобавитьРасход(); 
			Движение.ОбъектСтроительства 	= ТекОбъектСтроительства;
			Движение.Период                 = Дата;
			Движение.Регистратор            = Ссылка;
			Движение.Этап                   = ТекЭтап;
			Движение.СуммаЗаказов           = СтрокаДанных.Сумма;
			Движение.Договор                = ТекДоговор;

		КонецЦикла;
#КонецВставки	
	ПлатежСКонвертациейПроверитьКорректностьБанковскихСчетов(Отказ);
	
	// Создание заявки платежного агента
	ПараметрыПлатежноАгента = ЗаполнитьПараметрыПлатежноАгента();
	ЗаявкиНаОперации.СоздатьОбновитьЗаявкуПлатежноАгента(ПараметрыПлатежноАгента);
		
КонецПроцедуры

Функция ПолучитьМассивУПДВладельцев(ЗаказПоставщику)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СопоставленныеТовары КАК ПоступлениеТоваровУслугСопоставленныеТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугСопоставленныеТовары.ЗаказПоставщику = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&ИзменениеИКонтроль("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	ВыполнениеЗадачБухгалтера.ПриЗаписиПлатежа(ЭтотОбъект);	
	ЗаявкиНаОперации.ПриЗаписи(ЭтотОбъект, Отказ);	

	Если ЭтоВнутригрупповоеПеремещение Тогда
		Если ПолучитьФункциональнуюОпцию("АвтоматическиФормироватьПланируемыеПоступленияДСВГО")
			ИЛИ ДополнительныеСвойства.Свойство("ПринудительноСоздаватьОжидаемоеПоступлениеДенежныхСредств") Тогда
#Удаление
			Документы.ОжидаемоеПоступлениеДенежныхСредств.СоздатьОбновитьОжидаемоеПоступлениеДенежныхСредств(Ссылка, ЗаполнитьПараметрыДействия());
#КонецУдаления			
		КонецЕсли;
	КонецЕсли;   
	
#Вставка
	//+ИИТ_Аксеньюшкин
	Если ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ДокументПланирования = &Заявка";
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		СписаниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СписаниеОбъект.РасшифровкаПлатежа[0].ДоговорКонтрагента = ДоговорКонтрагента;
		СписаниеОбъект.РасшифровкаПлатежа[0].СуммаПлатежа = СуммаДокумента;
		СписаниеОбъект.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаДокумента;
		СписаниеОбъект.РасшифровкаПлатежа[0].Проект = ДвиженияОперации[0].Проект;
		СписаниеОбъект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;
		СписаниеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	
	ИИТ_ВспомогательныеФункцииСервер.ЗаписатьВсеФайлы(Ссылка, Истина); 

#КонецВставки

	// Создание заявки платежного агента
	Если Не Проведен Тогда 
		ЗаявкиНаОперации.СоздатьОбновитьЗаявкуПлатежноАгента(ЗаполнитьПараметрыПлатежноАгента());
	КонецЕсли;	

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура АЛФ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ЗаявкиНаОперации.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если СпособОпределенияКурсаПлатежа <> Перечисления.СпособыОпределенияКурсаПлатежа.ОпределяетсяВЗаявке Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КурсПлатежа");
		МассивНепроверяемыхРеквизитов.Добавить("КратностьПлатежа");
	КонецЕсли;  
	
	Если Не ВидыОперацийУХКлиентСерверПовтИсп.ИспользуетсяИсточникКурсовВалют(ВидОперацииУХ, ВалютаВзаиморасчетов, ВалютаОплаты) Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникКурса");
	КонецЕсли;
	
	Если ВидыОперацийУХКлиентСерверПовтИсп.ЭтоУплатаНалога(ВидОперацииУХ) Тогда	
		Если Не Справочники.ВидыНалоговИПлатежейВБюджет.ОрганизацияМожетУплачиватьНалог(Налог, Организация) Тогда
			
			ДопустимыйВидОрганизации = ?(ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация),
				НСтр("ru = 'физическими лицами'"),
				НСтр("ru = 'организациями'"));
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выбранный налог (взнос) уплачивается %1'"), ДопустимыйВидОрганизации);
			
			ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Корректность", НСтр("ru = 'Налог'"), , , ТекстСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "Налог", "Объект", Отказ);
			
		КонецЕсли;
		
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Налог");
		МассивНепроверяемыхРеквизитов.Добавить("ВидНалоговогоОбязательства");
	КонецЕсли;

	Если ФормаОплаты = Перечисления.ФормыОплаты.Наличная
		ИЛИ ВидыОперацийУХКлиентСерверПовтИсп.ЭтоПеремещениеВнутриОрганизации(ВидОперацииУХ) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СчетКонтрагента");
		МассивНепроверяемыхРеквизитов.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
		
	КонецЕсли;
	
	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОперацииУХ, "ВидОперацииДДСБезналичныйРасчет");
	РасчетыСФизическимиЛицами = УчетДенежныхСредствКлиентСервер.РасчетыСФизическимиЛицами(ВидОперации)
		И ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ЛичныеСредстваПредпринимателя;
	
	// если перечисление на личный счет сотрудника, то банк не не нужен	
	Если НЕ РасчетыСФизическимиЛицами ИЛИ НЕ ЗначениеЗаполнено(СчетКонтрагента) ИЛИ СчетКонтрагента.Владелец = Контрагент Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Банк");
	КонецЕсли;
	
	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеречислениеЗаработнойПлатыРаботнику(ВидОперацииУХ) Тогда
		
		Если ЛицевыеСчетаСотрудников.Количество() > 1 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Контрагент");  
		КонецЕсли;
		
		Если ФормаОплаты 	= Перечисления.ФормыОплаты.Наличная Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
			МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		КонецЕсли;    
		
	КонецЕсли;  
	
	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеречислениеЗаработнойПлатыРаботнику(ВидОперацииУХ)
		ИЛИ ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеречислениеПодотчетномуЛицу(ВидОперацииУХ) Тогда 

		Если ЛицевыеСчетаСотрудников.Количество() И ЗначениеЗаполнено(Банк)  Тогда
			ПроверитьЛицевыеСчетаСотрудниковПоБанку(Отказ)
		КонецЕсли;  
		
	КонецЕсли;	
	
	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеречислениеЗаработнойПлатыПоВедомостям(ВидОперацииУХ)
		И ФормаОплаты 	= Перечисления.ФормыОплаты.Наличная Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
	КонецЕсли; 
	
	УплатаНалогаЗаТретьеЛицо = ВидыОперацийУХКлиентСерверПовтИсп.ЭтоУплатаНалогаЗаТретьихЛиц(ВидОперацииУХ);
	
	// Для этих операций: конвертация валют, перемещение между счетами, между кассами
	// Проверяем корректность выбора кассы/расчетного счета
	Если ВидыОперацийУХКлиентСерверПовтИсп.ЭтоПеремещениеВнутриОрганизации(ВидОперацииУХ) Тогда
		Если СчетКассаОрганизации = СчетКассаЗачисления Тогда
		 #Удаление	
			ТекстСообщения = НСтр("ru = 'Счет/касса зачисления не должен совпадать со счетом/кассой списания'");
			
			ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Корректность", НСтр("ru = 'Счет списания или счет зачисления'"), , , ТекстСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "СчетКассаОрганизации", "Объект", Отказ); 
			#КонецУдаления
		КонецЕсли;
		Если ЖелательнаяДатаПлатежа > ДатаЗачисления Тогда
			
			ТекстСообщения = НСтр("ru = 'Дата зачисления не должна быть ранее даты списания'");
		
			ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Корректность", НСтр("ru = 'Дата зачисления'"), , , ТекстСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "ДатаЗачисления", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ЭтоКонвертацияВалюты = ВидыОперацийУХКлиентСерверПовтИсп.ЭтоКонвертацияВалюты(ВидОперацииУХ);
	Если ЭтоКонвертацияВалюты Тогда		
		Если ВалютаВзаиморасчетов = ВалютаКонвертации Тогда			
			ТекстСообщения = НСтр("ru = 'Валюта зачисления не должна совпадать с валютой списания'");
			
			ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Корректность", НСтр("ru = 'Валюта списания или валюта зачисления'"), , , ТекстСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "ВалютаСписания", "Объект", Отказ);			
		КонецЕсли;
		
		ВалютаРегламентированногоУчета = ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуРегламентированногоУчета();
		Если ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПродажаВалютыЗаРубли Тогда
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента) 
				И ДоговорКонтрагента.ОсновнаяВалютаПлатежей = ВалютаРегламентированногоУчета Тогда
				
				ТекстСообщения = НСтр("ru = 'Валюта платежей совпадает с валютой регламентированного учета'");
				
				ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Корректность", НСтр("ru = 'Валюта платежей'"), , , ТекстСообщения);
			
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "ДоговорКонтрагента", "Объект", Отказ);	
			КонецЕсли;
			
		ИначеЕсли ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПриобретениеВалютыЗаРубли Тогда
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента) 
				И Не ДоговорКонтрагента.ОсновнаяВалютаПлатежей = ВалютаРегламентированногоУчета Тогда
				
				ТекстСообщения = НСтр("ru = 'Валюта платежей отличается от валюты регламентированного учета'");
				
				ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Корректность", НСтр("ru = 'Валюта платежей'"), , , ТекстСообщения);
			
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "ДоговорКонтрагента", "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("СпособУказанияКурсаКонвертации");	
		МассивНепроверяемыхРеквизитов.Добавить("КурсКонвертации");
		МассивНепроверяемыхРеквизитов.Добавить("КратностьКонвертации");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ОрганизацияЮрЛицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);	
			
		Если УплатаНалогаЗаТретьеЛицо Тогда
			Если ПустаяСтрока(ИННПлательщика) Тогда
				ТекстСообщения = НСтр("ru = 'Не указан ИНН плательщика.
				|Заполните ИНН налогоплательщика ""%1""'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Налогоплательщик);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Налогоплательщик", "Объект", Отказ);
			Иначе
				РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИННПлательщика, ОрганизацияЮрЛицо);
				Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
					РезультатПроверкиФизЛицо = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИННПлательщика, НЕ ОрганизацияЮрЛицо);
					Если НЕ((ИННПлательщика = ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение() ИЛИ РезультатПроверкиФизЛицо.СоответствуетТребованиям)
						И ПлатежиВБюджетКлиентСервер.ЭтоПлатежПоИсполнительномуЛисту(СтатусСоставителя) ИЛИ УплатаНалогаЗаТретьеЛицо) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.ОписаниеОшибки, ЭтотОбъект, "Организация", "Объект", Отказ);
					КонецЕсли;
				КонецЕсли;		
			КонецЕсли;	
		КонецЕсли;			
		
		Если ПеречислениеВБюджет И НЕ ОбщегоНазначенияПовтИспУХ.ЭтоИностранныйНалоговыйРезидент(Организация) Тогда
			Если ПустаяСтрока(КПППлательщика) Тогда
				Если УплатаНалогаЗаТретьеЛицо Тогда
					ТекстСообщения = НСтр("ru = 'Не указан КПП плательщика.
					|Заполните КПП налогоплательщика ""%1""'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Налогоплательщик);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Налогоплательщик", "Объект", Отказ);
				Иначе
					ТекстСообщения = НСтр("ru = 'Не указан КПП плательщика.
					|Заполните КПП организации ""%1""'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Организация);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Организация", "Объект", Отказ);
				КонецЕсли;
			ИначеЕсли КПППлательщика = ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение() Тогда
				// Если Плательщик - ИП, то код всегда будет попадать в эту ветку, т.к. в КПП у него принудительно установлено значение "0",
				// но ошибка выдаваться не будет, из-за проверки на юр.лицо.
				// Проверяем для всех платежей, кроме платежей по ЕНП, исполнительному листу и при уплате налога за третье лицо.
				Если ОрганизацияЮрЛицо
					И НЕ ПлатежиВБюджетКлиентСервер.ЭтоПлатежПоИсполнительномуЛисту(СтатусСоставителя)
					И НЕ ПлатежиВБюджетКлиентСервер.ЭтоЕдиныйНалоговыйПлатеж(КодБК)
					И НЕ УплатаНалогаЗаТретьеЛицо Тогда
					ТекстСообщения = НСтр("ru = 'Не указан КПП плательщика.
					|Заполните КПП организации ""%1""'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Организация);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Организация", "Объект", Отказ);
				КонецЕсли;    
			Иначе
				РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямКПП(
					КПППлательщика, ОрганизацияЮрЛицо, Ложь, Ложь);
				Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
					Если НЕ (УплатаНалогаЗаТретьеЛицо И НЕ ОрганизацияЮрЛицо) Тогда
						Если ПустаяСтрока(РезультатПроверки.ОписаниеОшибки) Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								НСтр("ru = 'При уплате в бюджет для индивидуального предпринимателя в КПП должен указываться ""0""'"),
								ЭтотОбъект, "Организация", "Объект", Отказ);
						Иначе
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.ОписаниеОшибки, ЭтотОбъект, "Организация", "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
		
	Если НЕ УплатаНалогаЗаТретьеЛицо Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Налогоплательщик");
	КонецЕсли;
	
	ПеречислениеЗарплаты					= ЗаявкиНаОперацииКлиентСервер.ВозможноПеречислениеЗаплаты(
												ВидОперацииУХ,
												ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме"),
												ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеСводно"));
#Удаление												
Если НЕ (ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыСНаемнымиРаботниками(ВидОперацииУХ) И ПеречислениеЗарплаты) Тогда
	#КонецУдаления	
		МассивНепроверяемыхРеквизитов.Добавить("ПлатежнаяВедомость"); 
		#Удаление
	КонецЕсли;
#КонецУдаления	
	Если НЕ ЗаявкиНаОперации.УказываетсяЭлементСтруктурыЗадолженности(ЭтотОбъект.ДоговорКонтрагента, ЭтотОбъект.Ссылка) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДвиженияОперации.ЭлементСтруктурыЗадолженности");
	КонецЕсли;	
	
	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоВыплатыСамозанятым(ВидОперацииУХ)
		И Контрагент.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		СуммаРеестра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеестрВыплатСамозанятым, "СуммаДокумента");
		Если СуммаРеестра <> СуммаДокумента Тогда
			ШаблонСообщения = НСтр("ru = 'Не совпадают сумма документа (%1 руб.) и сумма по реестру выплаты самозанятым (%2 руб.)'");
			ШаблонСообщения =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СуммаДокумента, СуммаРеестра);
						
			ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("РеестрВыплатСамозанятым");
	КонецЕсли;
	
	ЭтоНерезидент = РаботаСКонтрагентамиУХ.ЭтоНерезидент(Контрагент);
	ВалютаРегламентированногоУчета = ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуРегламентированногоУчета();
	
	Если ПеречислениеПоИсполнительномуЛисту Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");  
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");  
		МассивНепроверяемыхРеквизитов.Добавить("ИсполнительныйЛист");  
	КонецЕсли; 
	
	Если НЕ СпособОплаты = Перечисления.СпособыОплатыПлатежей.ТретьемуЛицу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КонтрагентТретьеЛицо");
	КонецЕсли;

	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоОплатаПоставщику(ВидОперацииУХ) Тогда
		Если Не СпособОплаты = Перечисления.СпособыОплатыПлатежей.ПоЦепочкеПлатежей Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ЦепочкаПлатежей");	
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ЦепочкаПлатежей");	
	КонецЕсли;	

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПеречислениеЗаработнойПлатыРаботнику Тогда

		Если ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровСредствамиБухгалтерии")
			ИЛИ (ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме")
			И НЕ ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеСводно")) Тогда
			
			Если ЗначениеЗаполнено(ПлатежнаяВедомость) И ЗначениеЗаполнено(Контрагент) И ТипЗнч(Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				
				Ведомости = Новый Массив;
				Ведомости.Добавить(ПлатежнаяВедомость);
				
				ТаблицаНеоплаченныхВедомостей = УчетЗарплаты.ПолучитьДанныеВедомостейДляОплатыТаблично(Ссылка, Ведомости, Контрагент, Ложь);
				ТаблицаОплаченныхВедомостей   = УчетЗарплаты.ПолучитьДанныеВедомостейДляОплатыТаблично(Ссылка, Ведомости, Контрагент, Истина);
				
				Если ТаблицаНеоплаченныхВедомостей.Количество() = 0 И ТаблицаОплаченныхВедомостей.Количество() = 0 Тогда
					
					ШаблонСообщения = НСтр("ru = 'В выбранной ведомости отсутствуют сведения о заработной плате сотрудника %2.'");
					ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Контрагент);
					ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Поле", "Корректность", НСтр("ru = 'Ведомость'"),,, ШаблонСообщения);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПлатежнаяВедомость", "Объект", Отказ);
					
				Иначе
					
					Если ТаблицаОплаченныхВедомостей.Количество() <> 0 Тогда
						СтрокаВедомости = ТаблицаОплаченныхВедомостей[0];
					Иначе
						СтрокаВедомости = ТаблицаНеоплаченныхВедомостей[0];
					КонецЕсли;
					
					СуммаПоВедомости = СтрокаВедомости.СуммаКВыплате + СтрокаВедомости.КомпенсацияЗаЗадержкуЗарплаты;
					
					Если СуммаПоВедомости <> СуммаДокумента Тогда
						ШаблонСообщения = НСтр("ru = 'Не совпадают сумма документа (%1 руб.) и сумма по платежной ведомости (%2 руб.)'");
						ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СуммаДокумента, СуммаПоВедомости);
						
						ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
							"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	   #Вставка	
	Если НЕ ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеречислениеЗаработнойПлатыРаботнику(ВидОперацииУХ) И
		НЕ ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеречислениеЗаработнойПлатыПоВедомостям(ВидОперацииУХ) И
		НЕ ВидыОперацийУХВызовСервераПовтИсп.ЭтоПереводНаДругойСчетОрганизации(ВидОперацииУХ) И
		НЕ ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеремещениеВнутриОрганизации(ВидОперацииУХ) И
		ВидОперацииУХ <> Справочники.ВидыОперацийУХ.УплатаНалога Тогда
		ПроверяемыеРеквизиты.Добавить("ДоговорКонтрагента");
	КонецЕсли;
#КонецВставки
	ПодтверждающиеДокументыУХ.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

