
&Перед("ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения")
Процедура АЛФ_ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных)

	//+ИИТ_Аксеньюшкин                                                                                     
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ЗаявкаНаЗакуп", 									"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВводОстатковПоМОРСу", 							"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ОтражениеРКО", 									"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ТабельУчетаРабочегоВремениСКУД", 				"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВводСерийныхНомеров", 							"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_УстановкаСтатусовОсновныхСредств", 				"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_АктСписанияМатериалов", 							"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВводОстатковПоЗаймамМеждуОбъектами", 			"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ПеремещениеДенежныхСредствПодотчетныхЛиц", 		"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВводНачальногоОстаткаПоПодотчетникам", 			"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ТабельУчетаРабочегоВремени2", 					"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ЕжедневныйТабельУчета", 							"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВводНачальногоОстаткаПоКассе",					"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВедомостьНаПеречислениеОфициальногоЗаработка", 	"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ПланПоБДР", 										"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ТТН", 											"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ОприходованиеОсновныхСредствИИнструмента",		"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИИТ_ВводНачальныхОстатковПоИнструменту",				"Дата" , "БухгалтерскийУчет", "");
	//-ИИТ_Аксеньюшкин

КонецПроцедуры
