
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	//Элементы
	ПолеВвода_АЛФ = Элементы.Вставить("МОЛ", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.ПодразделениеОрганизации);
	ПолеВвода_АЛФ.Заголовок = "Принимающий МОЛ";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.МОЛ";

	ПолеВвода_АЛФ = Элементы.Вставить("ОбъектСтроительства", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.ПорядокУчетаРасчетов);
	ПолеВвода_АЛФ.Заголовок = "Объект строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ОбъектСтроительства";

	ПолеВвода_АЛФ = Элементы.Вставить("ЭтапСтроительства", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.ПорядокУчетаРасчетов);
	ПолеВвода_АЛФ.Заголовок = "Этап строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ЭтапСтроительства";    
	
	//ТЧ Товары
	Элементы.ТоварыНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	Элементы.ТоварыНоменклатураКод.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	Элементы.ТоварыНоменклатураАртикул.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	
	Элементы.ТоварыГруппаНоменклатура.Группировка = ГруппировкаКолонок.Вертикальная;
	Элементы.ТоварыНоменклатура.ФиксацияВТаблице = ФиксацияВТаблице.Нет;  
	Элементы.ТоварыНоменклатура.Заголовок = "Плоская номенклатура";
	Элементы.ТоварыПрослеживаемыйТовар.Видимость = Ложь;

	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыНоменклатураБухгалтерская", Тип("ПолеФормы"), Элементы.ТоварыГруппаНоменклатура);
	ЭлементТаблицыФормы.Заголовок = "Номенклатура бух."; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.НоменклатураПлоская";

	ГруппаКолонок_ЕИ = Элементы.Вставить("ТоварыГруппа1", Тип("ГруппаФормы"), Элементы.Товары, Элементы.ТоварыУХ_Характеристика); 
	ГруппаКолонок_ЕИ.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_ЕИ.Группировка = ГруппировкаКолонок.Вертикальная;
	ГруппаКолонок_ЕИ.ОтображатьВШапке = Ложь; 
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыНоменклатураЕдиницаИзмерения1", Тип("ПолеФормы"), ГруппаКолонок_ЕИ);
	ЭлементТаблицыФормы.Заголовок = "Ед. изм."; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Номенклатура.ЕдиницаИзмерения";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыНоменклатураЕдиницаИзмерения", Тип("ПолеФормы"), ГруппаКолонок_ЕИ);
	ЭлементТаблицыФормы.Заголовок = "Ед. изм."; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Номенклатура.ЕдиницаИзмерения";
	ЭлементТаблицыФормы.Видимость = Ложь;
	
	
КонецПроцедуры
