

&ИзменениеИКонтроль("ПодготовитьНаборыЗаписейКПроведению")
Процедура АЛФ_ПодготовитьНаборыЗаписейКПроведению(Объект, ВыборочноОчищатьРегистры)

	Для Каждого НаборЗаписей Из Объект.Движения Цикл
		
		#Вставка
		Если ТипЗнч(НаборЗаписей) = Тип("РегистрНакопленияНаборЗаписей.ИИТ_ЗаказыПоставщику") ИЛИ 
			ТипЗнч(НаборЗаписей) = Тип("РегистрНакопленияНаборЗаписей.ИИТ_ЗаявкиНаЗакуп") Тогда
			Продолжить;
		КонецЕсли;
		#КонецВставки
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();			
		КонецЕсли;
		НаборЗаписей.Записывать = Истина;
		
	КонецЦикла;

КонецПроцедуры

