
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Если НЕ РольДоступна("ИИТ_ДоступКоВсемОрганизациям") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ИИТ_ДоступныеОрганизации.Пользователь КАК Пользователь,
		                      |	ИИТ_ДоступныеОрганизации.Организация КАК Организация
		                      |ИЗ
		                      |	РегистрСведений.ИИТ_ДоступныеОрганизации КАК ИИТ_ДоступныеОрганизации
		                      |ГДЕ
		                      |	ИИТ_ДоступныеОрганизации.Пользователь = &Пользователь");
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = МассивОрганизаций;		
	КонецЕсли;

КонецПроцедуры
