
&ИзменениеИКонтроль("СотрудникиОбработкаПроверкиЗаполненияНаСервере")
Процедура АЛФ_СотрудникиОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты)

	ФОИспользоватьНачислениеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты");

	Если НЕ Форма.ИспользоватьКадровыйУчет И ФОИспользоватьНачислениеЗарплаты Тогда

		Если ЗначениеЗаполнено(Форма.ТекущаяОрганизация) Тогда

			Если ЗначениеЗаполнено(Форма.ДатаУвольнения) Тогда

				Если Форма.ДатаУвольнения <= Форма.ДатаПриема Тогда

					ТекстСообщения = НСтр("ru='Дата увольнения не может быть меньше или равна дате приема на работу'");
					ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					,
					"ДатаУвольнения",
					,
					Отказ);

				ИначеЕсли НЕ ЗначениеЗаполнено(Форма.ДатаПриема) Тогда

					ТекстСообщения = НСтр("ru='Необходимо заполнить дату приема на работу'");
					ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					,
					"ДатаПриема",
					,
					Отказ);

				КонецЕсли;

			КонецЕсли;

			Если ЗначениеЗаполнено(Форма.ДатаПриема) Тогда
				ЗарплатаКадры.ПроверитьКорректностьДаты(Форма.СотрудникСсылка, Форма.ДатаПриема, "ДатаПриема", Отказ, НСтр("ru='Дата приема'"), '19800101');
			КонецЕсли;

			Если ЗначениеЗаполнено(Форма.ДатаПриема)
				И НЕ ЗначениеЗаполнено(Форма.ТекущийВидЗанятости) Тогда

				ТекстСообщения = НСтр("ru='Не заполнен Вид занятости'");
				ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				,
				"ТекущийВидЗанятости",
				,
				Отказ);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если Форма.ФизическоеЛицоЗаблокировано И ПравоДоступа("Изменение", Метаданные.Справочники.ФизическиеЛица) Тогда

		СотрудникиФормы.ЛичныеДанныеФизическихЛицОбработкаПроверкиЗаполненияВФорме(Форма, Форма.ФизическоеЛицоСсылка, Отказ);

#Вставка
		Попытка
#КонецВставки
		ФизическоеЛицоОбъект = Форма.РеквизитФормыВЗначение("ФизическоеЛицо");
		Если Не ФизическоеЛицоОбъект.ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
#Вставка
		Исключение
		КонецПопытки;
#КонецВставки

		ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияСвойств = Истина;

	КонецЕсли;

	Если ФОИспользоватьНачислениеЗарплаты 
		И НЕ Форма.ИспользоватьКадровыйУчет Тогда

		СообщениеПроверкиВидЗанятости = СотрудникиФормы.СообщениеОКонфликтеВидаЗанятостиНовогоСотрудникаССуществующими(Форма.СотрудникСсылка, Форма.ФизическоеЛицоСсылка, Форма.ТекущаяОрганизация, Форма.ТекущийВидЗанятости, Форма.ДатаПриема);
		Если Не ПустаяСтрока(СообщениеПроверкиВидЗанятости) Тогда
			ОбщегоНазначения.СообщитьПользователю(СообщениеПроверкиВидЗанятости,,"ТекущийВидЗанятости", , Отказ);
		КонецЕсли;

	КонецЕсли;

	Если ФОИспользоватьНачислениеЗарплаты Тогда

		Если Не ЗначениеЗаполнено(Форма.ФизическоеЛицо.Пол) Тогда

			ТекстСообщения = НСтр("ru='Не заполнен Пол'");
			ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			,
			"Пол",
			"ФизическоеЛицо",
			Отказ);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
