
&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ПриИзмененииДополнительногоРеквизита")
Процедура АЛФ_Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
#Вставка
	//+ИИТ_Аксеньюшкин
	Попытка
		Объект.Наименование = "";
		Для Каждого СтрокаТЗ Из Свойства_ОписаниеДополнительныхРеквизитов Цикл
			Объект.Наименование = Объект.Наименование + ?(ЗначениеЗаполнено(Объект.Наименование), "; ", "") + ЭтаФорма[СтрокаТЗ.ИмяРеквизитаЗначение];
		КонецЦикла;
	Исключение
	КонецПопытки;
	//-ИИТ_Аксеньюшкин
#КонецВставки
КонецПроцедуры
