
&ИзменениеИКонтроль("ДобавитьИзФайловойСистемыСРасширениемСинхронно")
Функция АЛФ_ДобавитьИзФайловойСистемыСРасширениемСинхронно(ПараметрыВыполнения)

	Результат = Новый Структура;
	Результат.Вставить("ФайлДобавлен", Ложь);
	Результат.Вставить("ФайлСсылка",   Неопределено);
	Результат.Вставить("ТекстОшибки",  "");

	ФильтрДиалога = ?(ПараметрыВыполнения.Свойство("ФильтрДиалогаВыбора"),
	ПараметрыВыполнения.ФильтрДиалогаВыбора, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Все файлы (%1)|%1'"), ПолучитьМаскуВсеФайлы()));

	Если Не ПараметрыВыполнения.Свойство("ПолноеИмяФайла") Тогда
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
#Удаление
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
#КонецУдаления
#Вставка
		ДиалогВыбораФайла.МножественныйВыбор = Истина;
#КонецВставки
		ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выбор файла'");
		ДиалогВыбораФайла.Фильтр = ФильтрДиалога;
		ДиалогВыбораФайла.Каталог = РаботаСФайламиСлужебныйВызовСервера.РабочийКаталогПапки(ПараметрыВыполнения.ВладелецФайла);
		Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
			Возврат Результат;
		КонецЕсли;
		ПараметрыВыполнения.Вставить("ПолноеИмяФайла", ДиалогВыбораФайла.ПолноеИмяФайла);
	КонецЕсли;

	Если Не ПараметрыВыполнения.Свойство("ИмяСоздаваемогоФайла") Тогда
		ПараметрыВыполнения.Вставить("ИмяСоздаваемогоФайла", Неопределено);
	КонецЕсли;

#Вставка 
	//+ИИТ_Аксеньюшкин
	Для Каждого ВыбранныйФайл Из ДиалогВыбораФайла.ВыбранныеФайлы Цикл
	//-ИИТ_Аксеньюшкин
#КонецВставки 
#Удаление
	ДобавляемыйФайл = Новый Файл(ПараметрыВыполнения.ПолноеИмяФайла);
#КонецУдаления	
#Вставка  
	ДобавляемыйФайл = Новый Файл(ВыбранныйФайл);
#КонецВставки 
	Если Не ДобавляемыйФайл.Существует() Тогда
		ТекстОшибки = НСтр("ru = 'Указанный файл не существует:
		|%1'");
		Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, 
		ПараметрыВыполнения.ПолноеИмяФайла);
		Возврат Результат;
	КонецЕсли;

	Если ПараметрыВыполнения.Свойство("МаксимальныйРазмер")
		И ПараметрыВыполнения.МаксимальныйРазмер > 0
		И ДобавляемыйФайл.Размер() > ПараметрыВыполнения.МаксимальныйРазмер*1024*1024 Тогда

		ТекстОшибки = НСтр("ru = 'Размер файла превышает %1 Мб.'");
		Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, 
		ПараметрыВыполнения.МаксимальныйРазмер);

		Возврат Результат;

	КонецЕсли;

	ПроверитьВозможностьЗагрузкиФайла(ДобавляемыйФайл);

	ОбщиеНастройки = ОбщиеНастройкиРаботыСФайлами();
	ИзвлекатьТекстыФайловНаКлиенте = НЕ ОбщиеНастройки.ИзвлекатьТекстыФайловНаСервере;
	Если ИзвлекатьТекстыФайловНаКлиенте Тогда
		АдресВременногоХранилищаТекста = ИзвлечьТекстВоВременноеХранилище(ДобавляемыйФайл.ПолноеИмя,
		ПараметрыВыполнения.ФормаВладелец.УникальныйИдентификатор);
	Иначе
		АдресВременногоХранилищаТекста = "";
	КонецЕсли;

	// Помещение файла во временное хранилище.
	АдресВременногоХранилищаФайла = "";

	ПомещаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(ДобавляемыйФайл.ПолноеИмя, "");
	ПомещаемыеФайлы.Добавить(Описание);

	ПомещенныеФайлы = Новый Массив;
	ФайлыПомещены = ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь, ПараметрыВыполнения.ФормаВладелец.УникальныйИдентификатор);
	Если НЕ ФайлыПомещены Тогда
		Возврат Результат;
	КонецЕсли;

	Если ПомещенныеФайлы.Количество() = 1 Тогда
		АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;
	КонецЕсли;

	ИмяИРасширениеФайла = ИмяИРасширениеФайла(ДобавляемыйФайл);
	РасширениеФайла = ИмяИРасширениеФайла.РасширениеФайла;
	ИмяФайлаБезРасширения = ИмяИРасширениеФайла.ИмяФайлаБезРасширения;

	ФайлЗашифрован = НРег(РасширениеФайла) = НРег(РасширениеДляЗашифрованныхФайлов());

	Если ФайлЗашифрован Тогда
		ДляНезашифрованногоФайла = Новый Файл(ИмяФайлаБезРасширения);
		ИмяИРасширениеФайла = ИмяИРасширениеФайла(ДляНезашифрованногоФайла);
		РасширениеФайла = ИмяИРасширениеФайла.РасширениеФайла;
		ИмяФайлаБезРасширения = ИмяИРасширениеФайла.ИмяФайлаБезРасширения;
	КонецЕсли;

	Если ПараметрыВыполнения.ИмяСоздаваемогоФайла <> Неопределено Тогда
		ИмяСоздания = ПараметрыВыполнения.ИмяСоздаваемогоФайла;
	Иначе
		ИмяСоздания = ИмяФайлаБезРасширения;
	КонецЕсли;

	// Создание карточки Файла в БД.
	Попытка

		Если РаботаСФайламиСлужебныйКлиентПовтИсп.ЭтоСправочникФайлы(ПараметрыВыполнения.ВладелецФайла) Тогда

			СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией", ДобавляемыйФайл);
			СведенияОФайле.АдресВременногоХранилищаФайла = АдресВременногоХранилищаФайла;
			СведенияОФайле.АдресВременногоХранилищаТекста = АдресВременногоХранилищаТекста;
			СведенияОФайле.ЗаписатьВИсторию = Истина;
			СведенияОФайле.ИмяБезРасширения = ИмяСоздания;
			СведенияОФайле.РасширениеБезТочки = РасширениеФайла;
			СведенияОФайле.Зашифрован = ФайлЗашифрован;
			Результат.ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(ПараметрыВыполнения.ВладелецФайла, СведенияОФайле);

		Иначе

			ПараметрыФайла = РаботаСФайламиСлужебныйКлиентСервер.ПараметрыДобавленияФайла();
			ПараметрыФайла.ВладелецФайлов = ПараметрыВыполнения.ВладелецФайла;
			ПараметрыФайла.ИмяБезРасширения = ИмяФайлаБезРасширения;
			ПараметрыФайла.РасширениеБезТочки = РасширениеФайла;

			Результат.ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.ДобавитьФайл(ПараметрыФайла,
			АдресВременногоХранилищаФайла, АдресВременногоХранилищаТекста);

		КонецЕсли;

		Если ЭтоАдресВременногоХранилища(АдресВременногоХранилищаТекста) Тогда
			УдалитьИзВременногоХранилища(АдресВременногоХранилищаТекста);
		КонецЕсли;
		Если ЭтоАдресВременногоХранилища(АдресВременногоХранилищаФайла) Тогда
			УдалитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
		КонецЕсли;
		Результат.ФайлДобавлен = Истина;

	Исключение
		Результат.ТекстОшибки = ОшибкаСозданияНовогоФайла(ИнформацияОбОшибке());
	КонецПопытки;

	Если Результат.ТекстОшибки <> "" Тогда
		Возврат Результат;
	КонецЕсли;

	ПараметрыОповещения = ПараметрыОповещенияЗаписиФайла();
	ПараметрыОповещения.Владелец = ПараметрыВыполнения.ВладелецФайла;
	ПараметрыОповещения.ВладелецФайла = ПараметрыОповещения.Владелец;
	ПараметрыОповещения.Файл = Результат.ФайлСсылка;
	ПараметрыОповещения.ЭтоНовый = Истина;
	Оповестить("Запись_Файл", ПараметрыОповещения, Результат.ФайлСсылка);

#Вставка     
	//+ИИТ_Аксеньюшкин
	КонецЦикла;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	ПоказатьОповещениеПользователя(
	НСтр("ru = 'Создание:'"),
	ПолучитьНавигационнуюСсылку(Результат.ФайлСсылка),
	Результат.ФайлСсылка,
	БиблиотекаКартинок.ДиалогИнформация);

	Возврат Результат;

КонецФункции
