
&ИзменениеИКонтроль("ОшибкаНедостаточноПравДляВходаВПрограмму")
Функция АЛФ_ОшибкаНедостаточноПравДляВходаВПрограмму(РегистрироватьВЖурнале)

	// АПК:336-выкл Не заменять на РолиДоступны. Это специальная проверка ролей при входе.
	//@skip-check using-isinrole
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		Возврат "";
	КонецЕсли;
	// АПК:336-вкл

	Если Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		ИмяРолиБазовыеПрава = Метаданные.Роли.БазовыеПраваВнешнихПользователейБСП.Имя;
	Иначе
		ИмяРолиБазовыеПрава = Метаданные.Роли.БазовыеПраваБСП.Имя;
	КонецЕсли;

	// АПК:336-выкл Не заменять на РолиДоступны. Это специальная проверка ролей при входе.
	//@skip-check using-isinrole
#Удаление	
	Если РольДоступна(ИмяРолиБазовыеПрава) Тогда
#КонецУдаления	
		Возврат "";
#Удаление	
	КонецЕсли;
#КонецУдаления	
	// АПК:336-вкл

	Возврат КраткоеПредставлениеОшибкиАвторизацииПослеРегистрацииВЖурнале(
	НСтр("ru = 'Недостаточно прав для входа в приложение.
	|
	|Обратитесь к администратору.'"),
	, РегистрироватьВЖурнале);

КонецФункции
