
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	
	//Команды
	КомандаФормы = Команды.Добавить("Заполнить");  
	КомандаФормы.Заголовок = "Заполнить";
	КомандаФормы.Действие  = "Заполнить";  
	
	//Элементы формы
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ОбъектОтправитель", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.Склад);
	ПолеВвода_АЛФ.Заголовок = "Объект";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектОтправитель"; 
	
 	ПолеВвода_АЛФ = Элементы.Вставить("МОЛСписания", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.АналитикаУчетаЗатрат);
	ПолеВвода_АЛФ.Заголовок = "МОЛ";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.МОЛСписания"; 

 	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ВидНоменклатуры", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.АналитикаУчетаЗатрат);
	ПолеВвода_АЛФ.Заголовок = "Вид номенклатуры";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ВидНоменклатуры";
	
	КнопкаКоманднойПанели = Элементы.Добавить("МатериалыЗаполнить", Тип("КнопкаФормы"), Элементы.МатериалыКоманднаяПанель);
	КнопкаКоманднойПанели.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаКоманднойПанели.Заголовок = "Заполнить";
	КнопкаКоманднойПанели.ИмяКоманды  = "Заполнить";
	
	Элементы.МатериалыНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	Элементы.МатериалыГруппаНоменклатура.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	
	МатериалыГруппа1 = Элементы.Вставить("МатериалыГруппа1", Тип("ГруппаФормы"), Элементы.МатериалыГруппаНоменклатураСКартинкой, Элементы.МатериалыПрослеживаемыйТовар); 
	МатериалыГруппа1.Вид = ВидГруппыФормы.ГруппаКолонок;
	МатериалыГруппа1.Группировка = ГруппировкаКолонок.Вертикальная;
	МатериалыГруппа1.ОтображатьВШапке = Ложь; 
	
	Элементы.Переместить(Элементы.МатериалыНоменклатура, МатериалыГруппа1);
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыНоменклатураВидНоменклатуры", Тип("ПолеФормы"), МатериалыГруппа1);
	ЭлементТаблицыФормы.Заголовок = "Бухгалтерская номенклатура"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.НоменклатураБухгалтерская";

	МатериалыГруппа3 = Элементы.Вставить("МатериалыГруппа3", Тип("ГруппаФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест); 
	МатериалыГруппа3.Вид = ВидГруппыФормы.ГруппаКолонок;
	МатериалыГруппа3.Группировка = ГруппировкаКолонок.Вертикальная;
	МатериалыГруппа3.ОтображатьВШапке = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("МатериалыИнвентарныйНомер", Тип("ПолеФормы"), МатериалыГруппа3);
	ПолеВвода_АЛФ.Заголовок = "Инвентарный номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.Материалы.ИнвентарныйНомер"; 

	ПолеВвода_АЛФ = Элементы.Вставить("МатериалыСерийныйНомер", Тип("ПолеФормы"), МатериалыГруппа3);
	ПолеВвода_АЛФ.Заголовок = "Серийный номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.Материалы.СерийныйНомер"; 
	
 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыПризнакСписания", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест);
	ЭлементТаблицыФормы.Заголовок = "Признак списания"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.ПризнакСписания";

 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыУХ_Характеристика", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест);
	ЭлементТаблицыФормы.Заголовок = "Характеристика"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.УХ_Характеристика";
	ЭлементТаблицыФормы.Видимость = Ложь;
	
	МатериалыГруппа2 = Элементы.Вставить("МатериалыГруппа2", Тип("ГруппаФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест); 
	МатериалыГруппа2.Вид = ВидГруппыФормы.ГруппаКолонок;
	МатериалыГруппа2.Группировка = ГруппировкаКолонок.Вертикальная;
	МатериалыГруппа2.ОтображатьВШапке = Ложь;  
	
	//Для элемента путь установлен на форме, иначе элемент не существует
	Элементы.МатериалыНоменклатураЕдиницаИзмерения.Заголовок = "Ед. изм.";
	Элементы.МатериалыНоменклатураЕдиницаИзмерения.ОтображатьВШапке = Истина;
	Элементы.Переместить(Элементы.МатериалыНоменклатураЕдиницаИзмерения, МатериалыГруппа2);

 	ЭлементТаблицыФормы = Элементы.Добавить("МатериалыЕдиницаИзмеренияБухаглтерская", Тип("ПолеФормы"), Элементы.МатериалыГруппа2);
	ЭлементТаблицыФормы.Заголовок = "Ед. изм. бух."; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.ЕдиницаИзмеренияБухаглтерская";
	ЭлементТаблицыФормы.Видимость = Ложь;

 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыСуммаСписания", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыСчет);
	ЭлементТаблицыФормы.Заголовок = "Сумма списания"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.СуммаСписания";
	
 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыПолностью", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыСчет);
	ЭлементТаблицыФормы.Заголовок = "Забрать все"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.Полностью";
    ЭлементТаблицыФормы.ШрифтЗаголовка = Новый Шрифт(ЭлементТаблицыФормы.ШрифтЗаголовка,,,Истина);

 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыКоличествоВсего", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыСчет);
	ЭлементТаблицыФормы.Заголовок = "Количество всего"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.КоличествоВсего";
    ЭлементТаблицыФормы.ШрифтЗаголовка = Новый Шрифт(ЭлементТаблицыФормы.ШрифтЗаголовка,,,Истина);

КонецПроцедуры

#Область Перенос_доработок

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ИИТ_ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоВсего,
	|	ИИТ_ОстаткиТМЦОстатки.СуммаОстаток КАК СуммаСписания,
	|	ИИТ_ОстаткиТМЦОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	&Счет КАК Счет,
	|	&Счет КАК СчетУчета,
	|	&Счет КАК НовыйСчетУчета,
	|	"""" КАК ИнвентарныйНомер,
	|	"""" КАК СерийныйНомер,
	|	ИИТ_ОстаткиТМЦОстатки.БухгалтерскаяНоменклатура КАК БухгалтерскаяНоменклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ИИТ_ОстаткиТМЦ.Остатки(
	|			&Дата,
	|			МОЛ = &МОЛ
	|				И Склад = &Склад
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ИИТ_ОстаткиТМЦОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.ОсновноеСредство,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.КоличествоОстаток,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.СтоимостьОстаток,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.ОсновноеСредство.ЕдиницаИзмерения,
	|	1,
	|	&Счет,
	|	&Счет,
	|	&Счет,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.ИнвентарныйНомер,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.СерийныйНомер,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.БухгалтерскаяНоменклатура
	|ИЗ
	|	РегистрНакопления.ИИТ_ОстаткиОсновныхСредствИИнструмента.Остатки(
	|			&Дата,
	|			МОЛ = &МОЛ
	|				И Склад = &Склад
	|				И ОсновноеСредство.ВидНоменклатуры = &ВидНоменклатуры) КАК ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.КоличествоВсего КАК КоличествоВсего,
	|	ВТ.СуммаСписания КАК СуммаСписания,
	|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Коэффициент КАК Коэффициент,
	|	ВТ.СчетУчета КАК СчетУчета,
	|	ВТ.НовыйСчетУчета КАК НовыйСчетУчета,
	|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ.БухгалтерскаяНоменклатура КАК БухгалтерскаяНоменклатура,
	|	ВТ.Счет КАК Счет
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.КоличествоВсего <> 0";
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("МОЛ", Объект.МОЛСписания);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("41.01"));
	Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ИИТ_ВидНоменклатуры);
	
	Объект.Материалы.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура МатериалыПолностьюПриИзменении(Элемент)
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекСтрока.Количество = ТекСтрока.КоличествоВсего;
КонецПроцедуры

#КонецОбласти