
&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)
	
	//+ИИТ_Аксеньюшкин
	УстановитьНеобходимостьВводаСуммаДокумента();
	
	Элементы.ГруппаНомерДатаНаименование.Доступность = Истина;
	Элементы.ГруппаНомерДата.Доступность = Истина;
	Элементы.Номер.Доступность = Истина;
	Элементы.Дата.Доступность = Истина;
	Элементы.Наименование.Доступность = Истина;
	
	Элементы.ГруппаНомерДатаНаименование.ТолькоПросмотр = Ложь;
	Элементы.ГруппаНомерДата.ТолькоПросмотр = Ложь;
	Элементы.Номер.ТолькоПросмотр = Ложь;
	Элементы.Дата.ТолькоПросмотр = Ложь;
	Элементы.Наименование.ТолькоПросмотр = Ложь;	
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ФиксированнаяСуммаДоговораПриИзмененииПосле(Элемент)

	//+ИИТ_Аксеньюшкин
	УстановитьНеобходимостьВводаСуммаДокумента();
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

#Область Перенос_Доработок

//ИИТ_Аксеньюшкин

Процедура УстановитьНеобходимостьВводаСуммаДокумента()
	
	Элементы.СуммаДоговора.АвтоОтметкаНезаполненного = ФиксированнаяСуммаДоговора;
	Элементы.СуммаДоговора.ОтметкаНезаполненного = ФиксированнаяСуммаДоговора;

КонецПроцедуры   

#КонецОбласти