
#Область Перенос_доработок

&НаСервере
Функция ПолучитьМассивФЛ(ТипСправочника)

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СоставыГруппПользователей.Пользователь КАК Пользователь,
						  |	СоставыГруппПользователей.Пользователь.ФизическоеЛицо КАК ФизическоеЛицо,
	                      |	Роли.Роль КАК Роль
	                      |ИЗ
	                      |	Справочник.ПрофилиГруппДоступа.Роли КАК Роли
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	                      |			ПО (СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
	                      |			И (НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления)
	                      |		ПО Роли.Ссылка = ГруппыДоступаПользователи.Ссылка.Профиль
	                      |			И (НЕ Роли.Ссылка.ПометкаУдаления)
	                      |ГДЕ
	                      |	Роли.Роль.Наименование = ""Подотчетное лицо (Роль)""");
	Если ТипСправочника = 1 Тогда
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");	
	Иначе
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьПланСчетовДляТаблицы()
	
    Запрос = Новый Запрос("ВЫБРАТЬ
                          |	Хозрасчетный.Ссылка КАК Ссылка
                          |ИЗ
                          |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
                          |ГДЕ
                          |	Хозрасчетный.Код = &Код"); 
	Запрос.УстановитьПараметр("Код", "26");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСтавкуНДСДляТаблицы()
	Возврат Перечисления.СтавкиНДС.НДС20;	
КонецФункции

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт

	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтотОбъект, Объект.Ссылка);
	ОбновитьГруппуСогласования();

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаполнитьДвиженияДокумента()

	НаборЗаписей = РегистрыНакопления.ИИТ_ОстаткиДенежныхСредствУПодотчетников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Движение = НаборЗаписей.ДобавитьРасход();
	Движение.Период = Объект.Дата;
	Движение.ФизическоеЛицо = Объект.ИИТ_ОтветственноеЛицо.ФизическоеЛицо;
	Движение.ОбъектСтроительства = Объект.ИИТ_ОбъектСтроительства;
	Движение.Сумма = Объект.СуммаДокумента;
	Движение.Организация = Объект.Организация;
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ИИТ_ОбъектСтроительстваПриИзменении(Элемент)  
	ОчиститьЭтап();
	УстановитьСписокВыбораЭтапов();
КонецПроцедуры

&НаКлиенте
Процедура ИИТ_ОтветственноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	МассивФЛ = ПолучитьМассивФЛ(1);  
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	 
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СЗФЛ = Новый СписокЗначений;
	СЗФЛ.ЗагрузитьЗначения(МассивФЛ);
	эОтбор.ПравоеЗначение = СЗФЛ;
	эОтбор.Использование = Истина;
	 
	эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина); 
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);

	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеВыбораПользователя", ЭтотОбъект));   
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтветственноеЛицоПриИзменении(Элемент)
	ИИТ_ОтветственноеЛицоПриИзмененииНаСервере();
КонецПроцедуры

Процедура ИИТ_ОтветственноеЛицоПриИзмененииНаСервере()
	Объект.ФизЛицо = Объект.ИИТ_ОтветственноеЛицо.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ИИТ_ПереключательОтображенияВШапкеПриИзменении(Элемент)
	Если Объект.ИИТ_ПереключательОтображенияВШапке Тогда
		Элементы.ГруппаШапкаНижняя.Видимость = Истина; 
		Элементы.ГруппаСтраницы.Видимость = Ложь;
	Иначе
		Элементы.ГруппаШапкаНижняя.Видимость = Ложь; 
		Элементы.ГруппаСтраницы.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИИТ_СуммаЗаявкиПриИзменении(Элемент)
	Объект.ИИТ_СуммаАктуальная = Объект.ИИТ_СуммаЗаявки;
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ЭтапыСтроительстваАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		СтандартнаяОбработка = Истина;
	Иначе
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ИИТ_ВспомогательныеФункцииСервер.ПолучитьСЗЭтапов(Текст, Объект.ИИТ_ОбъектСтроительства);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИИТ_ЭтапыСтроительстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ИИТ_ОбъектСтроительства) Тогда
		
		СтандартнаяОбработка = Ложь;

		фиксНастройки = Новый НастройкиКомпоновкиДанных;
		 
		эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		эОтбор.ПравоеЗначение = Объект.ИИТ_ОбъектСтроительства;
		эОтбор.Использование = Истина;
		
		эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
		эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		эОтбор.ПравоеЗначение = Ложь;
		эОтбор.Использование = Истина;
		 
		эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
		ПараметрыФормы.Вставить("ОтображениеСписка", ОтображениеТаблицы.Список);
		 
		ОткрытьФорму("Справочник.Проекты.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ИИТ_ЭтапыСтроительства);

	КонецЕсли;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ЭтапыСтроительстваОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ДанныеВыбора = ПолучитьСЗЭтапов(Текст, Объект.ИИТ_ОбъектСтроительства);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтотОбъект, Объект.Ссылка);
	ОбновитьГруппуСогласования();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт

	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтотОбъект, Объект.Ссылка);
	ОбновитьГруппуСогласования();

КонецПроцедуры

//ИИТ_Акеньюшкин
Процедура ОбновитьГруппуСогласования()
	МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтаФорма);
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма);
	Если ЭтаФорма.СтатусОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
		ЗаполнитьДвиженияДокумента();
	КонецЕсли;
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ОтборазитьДанныеТабеля()
	
	Элементы.ИИТ_ТабельОснование.Видимость = ЗначениеЗаполнено(Объект.ИИТ_ТабельОснование);
	Если ТипЗнч(Объект.ИИТ_ДокументОснование) = Тип("ДокументСсылка.ИИТ_ТабельУчетаЗаполнениеИзОтчета") Тогда
		
		ТЗСотрудники = Объект.ИИТ_ДокументОснование.Часы.Выгрузить();
		УдалитьСтрокиИзТЗ(ТЗСотрудники, Объект.ИИТ_ОбъектСтроительства);
		ТЗСотрудники.Свернуть("ФизЛицо,ЭтапСтроительства,Ставка", "ЧасыТабель,СуммаТабель,ЧасыСКУД,СуммаСКУД,СуммаВыплат");
		ТЗСотрудники.Сортировать("ФизЛицо,ЭтапСтроительства");
		ДанныеТабеляСотрудники.Загрузить(ТЗСотрудники);
		
		ТЗЭтапы = Объект.ИИТ_ДокументОснование.СводноЭтапы.Выгрузить();
		ТЗЭтапы.Свернуть("ЭтапСтроительства", "ЧасыТабель,СуммаТабель,ЧасыСКУД,СуммаСКУД,СуммаВыплат");
		УдалитьСтрокиИзТЗЭтапы(ТЗЭтапы, Объект.ИИТ_ОбъектСтроительства);
		ДанныеТабеляЭтапы.Загрузить(ТЗЭтапы);
		Объект.ДанныеТабеляЭтапы.Загрузить(ТЗЭтапы);
		
		Для Каждого СтрокаТЗ Из Объект.ДанныеТабеляЭтапы Цикл
			СтрокаТЗ.СуммаАО = СтрокаТЗ.СуммаТабель - СтрокаТЗ.СуммаВыплат;
		КонецЦикла;

		ИИТ_ИтогоСотрудникиСуммаВыплат 	= ТЗСотрудники.Итог("СуммаВыплат");
		ИИТ_ИтогоСотрудникиСуммаСКУД	= ТЗСотрудники.Итог("СуммаСКУД");
		ИИТ_ИтогоСотрудникиСуммаТабель	= ТЗСотрудники.Итог("СуммаТабель");
		ИИТ_ИтогоСотрудникиЧасыСКУД		= ТЗСотрудники.Итог("ЧасыСКУД");
		ИИТ_ИтогоСотрудникиЧасыТабель	= ТЗСотрудники.Итог("ЧасыТабель");

		ИИТ_ИтогоЭтапыСуммаВыплат 	= ТЗЭтапы.Итог("СуммаВыплат");
		ИИТ_ИтогоЭтапыСуммаСКУД		= ТЗЭтапы.Итог("СуммаСКУД");
		ИИТ_ИтогоЭтапыСуммаТабель	= ТЗЭтапы.Итог("СуммаТабель");
		ИИТ_ИтогоЭтапыЧасыСКУД		= ТЗЭтапы.Итог("ЧасыСКУД");
		ИИТ_ИтогоЭтапыЧасыТабель	= ТЗЭтапы.Итог("ЧасыТабель");
		
		Элементы.ГруппаСтраницы.Видимость = Истина;
		Элементы.ГруппаВыданныеАвансы.Видимость = Ложь;
		Элементы.ГруппаТовары.Видимость = Ложь;
		Элементы.ГруппаВозвратнаяТара.Видимость = Ложь;
		Элементы.ГруппаБилеты.Видимость = Ложь;
		Элементы.ГруппаОплатаПоставщикам.Видимость = Ложь;
		Элементы.ГруппаПрочее.Видимость = Ложь;
		Элементы.ГруппаДанныеТабеля.Видимость = Истина;
		
		Элементы.ИИТ_ЭтапыСтроительства.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ОтменитьДвиженияДокумента()

	НаборЗаписей = РегистрыНакопления.ИИТ_ОстаткиДенежныхСредствУПодотчетников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();	
	НаборЗаписей.Записать();

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтотОбъект);
	ОбновитьГруппуСогласования();
	ОтменитьДвиженияДокумента();
	ОтправитьУведомлениеИнициатору();

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ОтправитьУведомлениеИнициатору()

	НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
	НоваяЗапись.ДатаСоздания = ТекущаяДата();
	НоваяЗапись.Заявка = Объект.Ссылка;
	НоваяЗапись.Ответственный = Объект.ИИТ_Инициатор;
	НоваяЗапись.Пояснение = "Отменено согласование авансового отчета";
	НоваяЗапись.Записать(Истина);
	
	ДокПроцесса = Документы.ЭкземплярПроцесса.ПустаяСсылка();
	
	Для Н = 1 По 8 Цикл
		
		СогласующийПоПлану = Объект.ИИТ_ОбъектСтроительства["ИИТ_ПрочееСогласующий" + Строка(Н)];
		Если СогласующийПоПлану = ПараметрыСеанса.ТекущийПользователь Тогда
			Прервать;
		КонецЕсли;
	
		НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
		НоваяЗапись.ДатаСоздания = ТекущаяДата();
		НоваяЗапись.Заявка = Объект.Ссылка;
		НоваяЗапись.Ответственный = СогласующийПоПлану;
		НоваяЗапись.Пояснение = "Отменено согласование авансового отчета";
		НоваяЗапись.Записать(Истина);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЭтап()
	Объект.ИИТ_ЭтапыСтроительства = Справочники.Проекты.ПустаяСсылка();
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПользователя(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Объект.ИИТ_ОтветственноеЛицо = РезультатЗакрытия;
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораФизЛица(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Объект.ФизЛицо = РезультатЗакрытия;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт

	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтотОбъект, Объект.Ссылка);
	ОбновитьГруппуСогласования();
	УдалитьУведомлениеИнициатору();
	ПроверитьОтправитьУведомлениеОтЧужогоИмени();

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ПроверитьОтправитьУведомлениеОтЧужогоИмени()
	
	Если Объект.ИИТ_Инициатор <> Объект.ИИТ_ОтветственноеЛицо И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
		НоваяЗапись.ДатаСоздания = ТекущаяДата();
		НоваяЗапись.Заявка = Объект.Ссылка;
		НоваяЗапись.Ответственный = Объект.ИИТ_ОтветственноеЛицо;
		НоваяЗапись.Пояснение = "От вашего имени создан Авансовый отчет";
		НоваяЗапись.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ПроверитьУдалитьУведомлениеОСозданииОтЧужогоИмени()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_УведомленияОВозвратеСогласования.Заявка КАК Заявка
	|ИЗ
	|	РегистрСведений.ИИТ_УведомленияОВозвратеСогласования КАК ИИТ_УведомленияОВозвратеСогласования
	|ГДЕ
	|	ИИТ_УведомленияОВозвратеСогласования.Заявка = &Заявка
	|	И ИИТ_УведомленияОВозвратеСогласования.Ответственный = &ТекПользователь
	|	И ИИТ_УведомленияОВозвратеСогласования.Пояснение = ""От вашего имени создан Авансовый отчет""";
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		УдалитьУведомлениеИнициатору();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОтображенияДополнительныхПолей()

	Если Объект.ИИТ_ПереключательОтображенияВШапке Тогда
		Элементы.ГруппаШапкаНижняя.Видимость = Истина;
		Элементы.ГруппаСтраницы.Видимость = Ложь;
	Иначе
		Элементы.ГруппаШапкаНижняя.Видимость = Ложь; 
		Элементы.ГруппаСтраницы.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт

	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтотОбъект);
	ОбновитьГруппуСогласования();

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УдалитьСтрокиИзТЗ(ТЗ, ОбъектСтроительства)
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.ОбъектСтроительства <> ОбъектСтроительства ИЛИ Не ЗначениеЗаполнено(СтрокаТЗ.ЭтапСтроительства)
		ИЛИ Не ЗначениеЗаполнено(СтрокаТЗ.СуммаТабель) Тогда
			СтрокиКУдалению.Добавить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению ИЗ СтрокиКУдалению Цикл
		ТЗ.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УдалитьСтрокиИзТЗЭтапы(ТЗ, ОбъектСтроительства)
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.ЭтапСтроительства.Родитель <> ОбъектСтроительства И СтрокаТЗ.ЭтапСтроительства.Родитель.Родитель <> ОбъектСтроительства Тогда
			СтрокиКУдалению.Добавить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению ИЗ СтрокиКУдалению Цикл
		ТЗ.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УдалитьУведомлениеИнициатору()

	НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьСписокВыбораЭтапов()
	
	Если ЗначениеЗаполнено(Объект.ИИТ_ОбъектСтроительства) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка В ИЕРАРХИИ(&ОбъектСтроительства)
		|	И НЕ Проекты.Проект";
		Запрос.УстановитьПараметр("ОбъектСтроительства", Объект.ИИТ_ОбъектСтроительства);
		
		Элементы.ИИТ_ЭтапыСтроительства.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	//МассивФЛ = ПолучитьМассивФЛ(2);  
	//
	//фиксНастройки = Новый НастройкиКомпоновкиДанных;
	// 
	//эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//СЗФЛ = Новый СписокЗначений;
	//СЗФЛ.ЗагрузитьЗначения(МассивФЛ);
	//эОтбор.ПравоеЗначение = СЗФЛ;
	//эОтбор.Использование = Истина;
	// 
	//эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	 
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина); 
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);

	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ИИТ_ФормаСписка", ПараметрыФормы, ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеВыбораФизЛица", ЭтотОбъект));
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Элементы формы  
	ГруппаСост = Элементы.Добавить("ГруппаРазмещенияСостояния", Тип("ГруппаФормы"), ЭтаФорма);
	ГруппаСост.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	Элементы.ФизЛицо.Видимость = Ложь;
	Элементы.Склад.Видимость = Ложь;    
	
	Элементы.ГруппаШапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Элементы.ФизЛицо.УстановитьДействие("НачалоВыбора", "ФизЛицоНачалоВыбора");
	
	Группа_ШВерх = Элементы.Добавить("ГруппаШапкаВерхняя", Тип("ГруппаФормы"), Элементы.ГруппаШапка);
	Группа_ШВерх.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_ШВерх.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_ШВерх.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_ШВерх.ОтображатьЗаголовок = Ложь;  
	
	//Перенос имеющихся групп
	Элементы.Переместить(Элементы.ГруппаШапкаЛевая, Группа_ШВерх);
	Элементы.Переместить(Элементы.ГруппаШапкаПравая, Группа_ШВерх);
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_КатегорияСогласования", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.ЦеныИВалюта);
	ПолеВвода_АЛФ.Заголовок = "Категория согласования";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_КатегорияСогласования";
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПереключательОтображенияВШапке", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	ПолеВвода_АЛФ.Заголовок = "Отображение основных полей в шапке";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПереключательОтображенияВШапке";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ПереключательОтображенияВШапкеПриИзменении"); 
	
	Группа_ШНиз = Элементы.Добавить("ГруппаШапкаНижняя", Тип("ГруппаФормы"), Элементы.ГруппаШапка);
	Группа_ШНиз.Заголовок =  "Подробная информация";
	Группа_ШНиз.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_ШНиз.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_ШНиз.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;

	Группа_ШНизЛ = Элементы.Добавить("ГруппашапкаНижняяЛеваяЧасть", Тип("ГруппаФормы"), Группа_ШНиз);
	Группа_ШНизЛ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_ШНизЛ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа_ШНизЛ.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Группа_ШНизЛ.ОтображатьЗаголовок = Ложь;  

	Группа_ШНизП = Элементы.Добавить("ГруппаШапкаНижняяЛевая", Тип("ГруппаФормы"), Группа_ШНиз);
	Группа_ШНизП.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_ШНизП.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа_ШНизП.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Группа_ШНизП.ОтображатьЗаголовок = Ложь;    
	
	//Левая часть группы шапка низ 6 полей
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Инициатор", Тип("ПолеФормы"), Группа_ШНизЛ);
	ПолеВвода_АЛФ.Заголовок = "Инициатор";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Инициатор";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИнициаторПриИзменении"); 

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Группа_ШНизЛ);
	ПолеВвода_АЛФ.Заголовок = "Объект строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектСтроительства";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОбъектСтроительстваПриИзменении"); 

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СтатьиБбрИлиБддс", Тип("ПолеФормы"), Группа_ШНизЛ);
	ПолеВвода_АЛФ.Заголовок = "Статьи ББР или БДДС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СтатьиБбрИлиБддс";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_СтатьиБбрИлиБддсПриИзменении"); 
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДатаЗавешивания", Тип("ПолеФормы"), Группа_ШНизЛ);
	ПолеВвода_АЛФ.Заголовок = "Дата завешивания";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДатаЗавешивания";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СуммаЗаявки", Тип("ПолеФормы"), Группа_ШНизЛ);
	ПолеВвода_АЛФ.Заголовок = "Сумма";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СуммаЗаявки";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_СуммаЗаявкиПриИзменении"); 

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДокументОснование", Тип("ПолеФормы"), Группа_ШНизЛ);
	ПолеВвода_АЛФ.Заголовок = "Документ основание";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДокументОснование";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ДокументОснованиеПриИзменении"); 
	
	//Правая часть группы шапка низ 6 полей 
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОписаниеДокументаОснования", Тип("ПолеФормы"), Группа_ШНизП);
	ПолеВвода_АЛФ.Заголовок = "Описание";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОписаниеДокументаОснования";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтветственноеЛицо", Тип("ПолеФормы"), Группа_ШНизП);
	ПолеВвода_АЛФ.Заголовок = "МОЛ";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОтветственноеЛицо";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтветственноеЛицоПриИзменении");
    ПолеВвода_АЛФ.УстановитьДействие("НачалоВыбора", "ИИТ_ОтветственноеЛицоНачалоВыбора");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЭтапыСтроительства", Тип("ПолеФормы"), Группа_ШНизП);
	ПолеВвода_АЛФ.Заголовок = "Этап строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ЭтапыСтроительства";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ЭтапыСтроительстваПриИзменении");
    ПолеВвода_АЛФ.УстановитьДействие("НачалоВыбора", "ИИТ_ЭтапыСтроительстваНачалоВыбора");
    ПолеВвода_АЛФ.УстановитьДействие("АвтоПодбор", "ИИТ_ЭтапыСтроительстваАвтоПодбор");
    ПолеВвода_АЛФ.УстановитьДействие("ОкончаниеВводаТекста", "ИИТ_ЭтапыСтроительстваОкончаниеВводаТекста");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Статус", Тип("ПолеФормы"), Группа_ШНизП);
	ПолеВвода_АЛФ.Заголовок = "Статус";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Статус";
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДатаСтатуса", Тип("ПолеФормы"), Группа_ШНизП);
	ПолеВвода_АЛФ.Заголовок = "Дата статуса";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДатаСтатуса";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СуммаАктуальная", Тип("ПолеФормы"), Группа_ШНизП);
	ПолеВвода_АЛФ.Заголовок = "Сумма актуальная";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СуммаАктуальная";
	ПолеВвода_АЛФ.Видимость = Ложь;
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_СуммаАктуальнаяПриИзменении");
	
	//ТЧ Товары +2 реквизита
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Товары);
	ЭлементТаблицыФормы.Заголовок = "Объект строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ИИТ_ОбъектСтроительства";

	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыИИТ_СтатьяДДС", Тип("ПолеФормы"), Элементы.Товары);
	ЭлементТаблицыФормы.Заголовок = "Объект строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ИИТ_СтатьяДДС";
	
	//ТЧ Прочее +Группа колонок для сумм, колонка сумма перенесена в нее, +1 колонка сумм
	ГруппаКолонок_С = Элементы.Вставить("ПрочееГруппаСуммы", Тип("ГруппаФормы"), Элементы.Прочее, Элементы.ГруппаПрочееСтавкаСуммаНДС); 
	ГруппаКолонок_С.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_С.ОтображатьВШапке = Ложь;
	
	Элементы.Переместить(Элементы.ПрочееСумма, ГруппаКолонок_С);
	Элементы.ПрочееСумма.Заголовок = "Сумма заявки и актуальная";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ПрочееИИТ_АктуальнаяСумма", Тип("ПолеФормы"), ГруппаКолонок_С);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Прочее.ИИТ_АктуальнаяСумма";
	ЭлементТаблицыФормы.ОтображатьВШапке = Ложь;
	
	//ТЧ Прочее +Группа колонок объекты строительства, +2 реквизита в колонку, +1 в таблицу
	ГруппаКолонок_О = Элементы.Вставить("ПрочееГруппаОбъектСтроительства", Тип("ГруппаФормы"), Элементы.Прочее, Элементы.ГруппаПрочееСтавкаСуммаНДС); 
	ГруппаКолонок_О.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_О.ОтображатьВШапке = Ложь;

	ЭлементТаблицыФормы = Элементы.Добавить("ПрочееИИТ_ОбъектСтроительства", Тип("ПолеФормы"), ГруппаКолонок_О);
	ЭлементТаблицыФормы.Заголовок = "Объект и этап строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Прочее.ИИТ_ОбъектСтроительства";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ПрочееИИТ_ЭтапОбъектаСтроительства", Тип("ПолеФормы"), ГруппаКолонок_О);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Прочее.ИИТ_ЭтапОбъектаСтроительства";
 	ЭлементТаблицыФормы.ОтображатьВШапке = Ложь;

	ЭлементТаблицыФормы = Элементы.Добавить("ПрочееИИТ_СтатьяДДС", Тип("ПолеФормы"), Элементы.Прочее);
	ЭлементТаблицыФормы.Заголовок = "Статья ДДС";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Прочее.ИИТ_СтатьяДДС";   
	
	//Страница Данные табеля
	Страница_ДТ = Элементы.Добавить("ГруппаДанныеТабеля", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	Страница_ДТ.Вид = ВидГруппыФормы.Страница;
	Страница_ДТ.Заголовок =  "Данные табеля";
	Страница_ДТ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	//ТЗ ДанныеТабеляСотрудники 
	ТаблицаТС = Элементы.Добавить("ДанныеТабеляСотрудники", Тип("ТаблицаФормы"), Страница_ДТ);
	ТаблицаТС.ПутьКДанным = "ДанныеТабеляСотрудники";
    ТаблицаТС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиЭтапСтроительства", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Этап строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.ЭтапСтроительства";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиФизЛицо", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Физлицо";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.ФизЛицо";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиСтавка", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Ставка";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.Ставка";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиЧасыТабель", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Часы табель";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.ЧасыТабель";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоСотрудникиЧасыТабель";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиСуммаТабель", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Сумма табель";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.СуммаТабель";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоСотрудникиСуммаТабель";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиЧасыСКУД", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Часы СКУД";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.ЧасыСКУД";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоСотрудникиЧасыСКУД";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиСуммаСКУД", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Сумма СКУД";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.СуммаСКУД";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоСотрудникиСуммаСКУД";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляСотрудникиСуммаВыплат", Тип("ПолеФормы"), ТаблицаТС);
	ЭлементТаблицыФормы.Заголовок = "Сумма выплат";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляСотрудники.СуммаВыплат";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоСотрудникиСуммаВыплат";

	//ТЗ ДанныеТабеляЭтапы 
	ТаблицаТЭ = Элементы.Добавить("ДанныеТабеляЭтапы", Тип("ТаблицаФормы"), Страница_ДТ);
	ТаблицаТЭ.ПутьКДанным = "ДанныеТабеляЭтапы";
    ТаблицаТЭ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
 	ТаблицаТЭ.Видимость = Ложь;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапыЭтапСтроительства", Тип("ПолеФормы"), ТаблицаТЭ);
	ЭлементТаблицыФормы.Заголовок = "Этап строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляЭтапы.ЭтапСтроительства";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапыЧасыТабель", Тип("ПолеФормы"), ТаблицаТЭ);
	ЭлементТаблицыФормы.Заголовок = "Часы табель";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляЭтапы.ЧасыТабель";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоЭтапыЧасыТабель";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапыСуммаТабель", Тип("ПолеФормы"), ТаблицаТЭ);
	ЭлементТаблицыФормы.Заголовок = "Сумма табель";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляЭтапы.СуммаТабель";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоЭтапыСуммаТабель";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапыЧасыСКУД", Тип("ПолеФормы"), ТаблицаТЭ);
	ЭлементТаблицыФормы.Заголовок = "Часы СКУД";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляЭтапы.ЧасыСКУД";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоЭтапыЧасыСКУД";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапыСуммаСКУД", Тип("ПолеФормы"), ТаблицаТЭ);
	ЭлементТаблицыФормы.Заголовок = "Сумма СКУД";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляЭтапы.СуммаСКУД";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоЭтапыСуммаСКУД";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапыСуммаВыплат", Тип("ПолеФормы"), ТаблицаТЭ);
	ЭлементТаблицыФормы.Заголовок = "Сумма выплат";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ДанныеТабеляЭтапы.СуммаВыплат";
	ЭлементТаблицыФормы.ПутьКДаннымПодвала = "ИИТ_ИтогоЭтапыСуммаВыплат";

	//ТЧ ДанныеТабеляЭтапы 
	ТаблицаТЭ1 = Элементы.Добавить("ДанныеТабеляЭтапы1", Тип("ТаблицаФормы"), Страница_ДТ);
	ТаблицаТЭ1.ПутьКДанным = "Объект.ДанныеТабеляЭтапы";
    ТаблицаТЭ1.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1НомерСтроки", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1ЭтапСтроительства", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Этап строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.ЭтапСтроительства";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1ЧасыТабель", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Часы табель";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.ЧасыТабель";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1СуммаТабель", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Сумма табель";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.СуммаТабель";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1ЧасыСКУД", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Часы СКУД";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.ЧасыСКУД";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1СуммаСКУД", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Сумма СКУД";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.СуммаСКУД";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1СуммаВыплат", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Сумма выплат";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.СуммаВыплат";

	ЭлементТаблицыФормы = Элементы.Добавить("ДанныеТабеляЭтапы1СуммаАО", Тип("ПолеФормы"), ТаблицаТЭ1);
	ЭлементТаблицыФормы.Заголовок = "Сумма выплат";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ДанныеТабеляЭтапы.СуммаАО";

	//Подвал
	Элементы.ГруппаПодвал.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ГруппаИтоги.Видимость = Ложь;
	
	//Форма
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ТабельОснование", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Табель основание";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ТабельОснование";
	ПолеВвода_АЛФ.Видимость = Истина;
	
	//+ИИТ_Аксеньюшкин
	Если НЕ ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		Объект.ФизЛицо = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	КонецЕсли;
	Объект.Организация = Справочники.Организации.НайтиПоНаименованию("Альфа");

	Если Параметры.Свойство("СокращенныйИнтерфейс") Тогда
		Элементы.ГруппаБилеты.Видимость = Ложь;
		Элементы.ГруппаОплатаПоставщикам.Видимость = Ложь;
		Элементы.ГруппаВозвратнаяТара.Видимость = Ложь;
		Элементы.ТоварыПоставщикГруппа.Видимость = Ложь;
		Элементы.ТоварыПредъявленСФ.Видимость = Ложь;
		Элементы.ГруппаТоварыСчетФактура.Видимость = Ложь;
		Элементы.ТоварыСчетУчета.Видимость = Ложь;
		Элементы.ТоварыСчетУчетаНДС.Видимость = Ложь;
		Элементы.ТоварыСпособУчетаНДС.Видимость = Ложь;
		Элементы.ТоварыОтражениеВУСН.Видимость = Ложь;
		Элементы.ГруппаТоварыГТД.Видимость = Ложь;
		
		Элементы.ПрочееПоставщикГруппа.Видимость = Ложь;
		Элементы.ПрочееПредъявленСФ.Видимость = Ложь;
		Элементы.ПрочееБланкСтрогойОтчетности.Видимость = Ложь;
		Элементы.ГруппаПрочееСчетФактура.Видимость = Ложь;
		Элементы.ГруппаПрочееСчетЗатратПодразделениеЗатрат.Видимость = Ложь;
		Элементы.ГруппаПрочееСубконтоБУ.Видимость = Ложь;
		Элементы.ПрочееСчетЗатратНУ.Видимость = Ложь;
		Элементы.ГруппаПрочееСубконтоНУ.Видимость = Ложь;
		Элементы.ПрочееСчетУчетаНДС.Видимость = Ложь;
		Элементы.ПрочееСпособУчетаНДС.Видимость = Ложь;
		Элементы.ПрочееОтражениеВУСН.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ИИТ_ПереключательОтображенияВШапке = Истина;
		Объект.ИИТ_Инициатор = ПараметрыСеанса.ТекущийПользователь;
		Элементы.ГруппаШапкаНижняя.Видимость = Истина; 
		Элементы.ГруппаСтраницы.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьСписокВыбораЭтапов();
	
	МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтаФорма);
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма);
	
	Элементы.ФормаСогласованиеУХ.Видимость = Ложь;
	Элементы.Переместить(Элементы.ГруппаСтатусыСогласования, Элементы.ГруппаРазмещенияСостояния);
	
	Элементы.ИИТ_Инициатор.ТолькоПросмотр = НЕ РольДоступна("АС_СтаршийФинансист"); 

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ИИТ_Инициатор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроверитьУдалитьУведомлениеОСозданииОтЧужогоИмени();
	КонецЕсли;
	
	Если (ЭтаФорма.СтатусОбъекта = Перечисления.СостоянияСогласования.НаУтверждении ИЛИ ЭтаФорма.СтатусОбъекта = Перечисления.СостоянияСогласования.Утверждена)
	И  Не ПравоДоступа("Редактирование", Метаданные.Документы.АвансовыйОтчет)  
	Тогда
		Для Каждого Элемент Из Элементы Цикл
			Попытка
				Элемент.ТолькоПросмотр = Истина;
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)
	
	// Проверка необходимости отображения дополнительных полей
	ПроверкаОтображенияДополнительныхПолей();
	// Конец проверки необходимости отображения дополнительных полей

	//+ИИТ_Аксеньюшкин
	ОтборазитьДанныеТабеля();
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаОповещения")
Процедура АЛФ_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Источник = "ПодключаемоеОборудование" Тогда

		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПрочее Тогда
			ИмяСписка = "Прочее";
		Иначе
			ИмяСписка = "Товары";
		КонецЕсли;

		УчетКассовыхЧековПодотчетныхЛицКлиент.ОбработатьОтветСканера(
		ЭтотОбъект,
		ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц(),
		ИмяСобытия,
		Параметр,
		ИмяСписка,
		Объект.СуммаВключаетНДС);

	ИначеЕсли ИмяСобытия = "ПолучениеДанныхЧековЗагруженныхАппаратнымСканером" И Источник = ЭтотОбъект Тогда

		ПолучениеДанныхЧековЗагруженныхАппаратнымСканером(Параметр);

 #Вставка
	//+ИИТ_Аксеньюшкин
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" ИЛИ ИмяСобытия = "ОбъектОтклонен" Тогда
		ОбновитьГруппуСогласования();
	//-ИИТ_Аксеньюшкин
 #КонецВставки
	ИначеЕсли ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда

		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

	ОбщегоНазначенияБПКлиент.ОбработкаОповещенияФормыДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);

	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.СостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры
