
&ИзменениеИКонтроль("ПриИзмененииСостояния")
Процедура АЛФ_ПриИзмененииСостояния(Контекст)

	Если Контекст.Состояние = "ВопросОДублях" Тогда

		ЗадатьВопросОСозданииДокумента(Контекст);

	ИначеЕсли Контекст.Состояние = "ВопросОЗакрытомПериоде" Тогда

#Удаление
		ЗадатьВопросОЗакрытомПериоде(Контекст);
#КонецУдаления
#Вставка
		СледующееСостояние(Контекст);
		ПриИзмененииСостояния(Контекст);
#КонецВставки

	ИначеЕсли Контекст.Состояние = "ВопросУстановкаФункциональныхОпцийПоСкидкам" Тогда

		ЗадатьВопросУстановкаФункциональныхОпцийПоСкидкам(Контекст);

	ИначеЕсли Контекст.Состояние = "ВопросОПересчетеСкидок" Тогда

		ЗадатьВопросОПересчетеСкидок(Контекст);

	ИначеЕсли Контекст.Состояние = "СозданиеТипового" Тогда

		Контекст.Форма.Подключаемый_СозданиеТипового(Контекст.ПараметрыОперации);
#Вставка
		Попытка
			Форма = ПолучитьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары", Новый Структура("Ключ", Контекст.Форма.СозданныеДокументы.Поступление.Ссылка));
			Форма.Открыть();
		Исключение
		КонецПопытки;
#КонецВставки

	Иначе
		ВызватьИсключение "";
	КонецЕсли;

КонецПроцедуры
