
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	//1 колонки в ТЧ
	ЭлементТаблицыФормы = Элементы.Добавить("НомерСчета", Тип("ПолеФормы"), Элементы.Список);
	ЭлементТаблицыФормы.Заголовок = "Номер счета"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.НомерСчета";
	
#Область Перенос_Доработок

	//+ИИТ_Аксеньюшкин
	Если Параметры.Свойство("Контрагент") И Параметры.Свойство("Номенклатура") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИИТ_ЗаказыПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику
		|ИЗ
		|	РегистрНакопления.ИИТ_ЗаказыПоставщику.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ЗаказПоставщику.Контрагент = &Контрагент) КАК ИИТ_ЗаказыПоставщикуОстатки";
		Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
		Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
		
		МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПоставщику");
		СЗЗаказы = Новый СписокЗначений;
		СЗЗаказы.ЗагрузитьЗначения(МассивЗаказов);
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СЗЗаказы;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоНезакрытые") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИИТ_ЗаказыПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику
		|ИЗ
		|	РегистрНакопления.ИИТ_ЗаказыПоставщику.Остатки(, ЗаказПоставщику.Контрагент = &Контрагент) КАК ИИТ_ЗаказыПоставщикуОстатки";
		Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
		МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПоставщику");
		СЗЗаказы = Новый СписокЗначений;
		СЗЗаказы.ЗагрузитьЗначения(МассивЗаказов);
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СЗЗаказы;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
		
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	
#КонецОбласти	

КонецПроцедуры
