
&НаСервере
&ИзменениеИКонтроль("ПолучитьПутьКФормеПоступленияТоваров")
Функция АЛФ_ПолучитьПутьКФормеПоступленияТоваров(ЗаказПоставщику)
	ВидОперации = 
		УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ОпределитьВидОперацииПоступленияТоваровИзЗаказаПоставщику(
			ЗаказПоставщику);
	ФормыПоступлениеТоваровУслуг = Документы.ПоступлениеТоваровУслуг.ПолучитьСоответствиеВидовОперацийФормам();
	ВыбраннаяФорма = ФормыПоступлениеТоваровУслуг[ВидОперации];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокументаОбщая";
	КонецЕсли;
#Вставка
	//+ИИТ_Аксеньюшкин
	Возврат "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары";
	//-ИИТ_Аксеньюшкин
#КонецВставки
	Возврат "Документ.ПоступлениеТоваровУслуг.Форма." + ВыбраннаяФорма;
КонецФункции
