
&После("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ, Замещение)

	//+ИИТ_Аксеньюшкин
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если ТипЗнч(СтрокаНабора.Объект) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") 
		И СтрокаНабора.СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена 
		И ЗначениеЗаполнено(СтрокаНабора.Объект.ИИТ_ПроектСогласования)
		И ЗначениеЗаполнено(СтрокаНабора.Объект.ИИТ_ПроектСогласования.ИИТ_ПользовательДляУведомления)
		И Прав(СокрЛП(СтрокаНабора.Объект.Номер), 1) <> "П" И НЕ СтрокаНабора.Объект.ИИТ_ОтразитьБДДС Тогда

			НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заявка = СтрокаНабора.Объект;
			НоваяЗапись.Ответственный = СтрокаНабора.Объект.ИИТ_ПроектСогласования.ИИТ_ПользовательДляУведомления;
			НоваяЗапись.ДатаСоздания = ТекущаяДата();
			НоваяЗапись.Пояснение = "Оплачена заявка";
			НоваяЗапись.Записать(Истина);

		КонецЕсли;
		
		Если ТипЗнч(СтрокаНабора.Объект) = Тип("ДокументСсылка.АвансовыйОтчет") 
		И СтрокаНабора.СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
			ДокОбъект = СтрокаНабора.Объект.ПолучитьОбъект();
			ДокОбъект.ИИТ_РасходСогласован = Истина;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

	КонецЦикла;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры
