
&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)

	//+ИИТ_Аксеньюшкин
	Элементы.ГруппаКонтрагент.Видимость = Истина;
	Элементы.Контрагент.Видимость = Истина;
	Элементы.ГруппаКонтрагент.Доступность = Истина;
	Элементы.Контрагент.Доступность = Истина;
	Элементы.ГруппаКонтрагент.ТолькоПросмотр = Ложь;
	Элементы.Контрагент.ТолькоПросмотр = Ложь;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВидОперацииПриИзмененииСервер")
Процедура АЛФ_ВидОперацииПриИзмененииСервер()
	
	#Вставка 
	//При изменении вида операции сбрасывается счет
	СчетКонтрагента 	= Объект.СчетКонтрагента;
	ТаблицаРасшифровки 	= Объект.РасшифровкаПлатежа.Выгрузить(); 
	#КонецВставки
	СписаниеСРасчетногоСчетаФормы.ВидОперацииПриИзмененииСервер(ЭтотОбъект);

	ОтобразитьГиперссылкуПерейтиВТаблицу();
	
	#Область УХ_Казначейство
	ОперативноеПланированиеФормыУХ.ПриИзмененииВидаОперацииНаСервереДокументДДС(ЭтотОбъект);
	#КонецОбласти
	
	#Вставка 
	//При изменении вида операции сбрасывается счет
	Объект.СчетКонтрагента = СчетКонтрагента;
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда 
		Объект.Проект 									= ТаблицаРасшифровки[0].Проект;
		Объект.СтатьяДвиженияДенежныхСредств 			= ТаблицаРасшифровки[0].СтатьяДвиженияДенежныхСредств;
		Объект.СтатьяДвиженияДенежныхСредствЗачисление 	= ТаблицаРасшифровки[0].СтатьяДвиженияДенежныхСредств;
		Если Не ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда 
			  Объект.ДокументПланирования = ТаблицаРасшифровки[0].ДокументПланирования;
		КонецЕсли;	
	Иначе
		
	КонецЕсли;	 
	#КонецВставки

КонецПроцедуры

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//СмирновРВ
	ПолеВвода_АЛФ = Элементы.Добавить("АС_ОИФ", Тип("ПолеФормы"), Элементы.ГруппаНомерДата);
	ПолеВвода_АЛФ.Заголовок 	= "ОИФ";
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_ОИФ";	
	ПолеВвода_АЛФ.Доступность = Ложь;   
	ПолеВвода_АЛФ.Видимость = РольДоступна("АС_Кассир");
	
	НоваяГруппа = Элементы.Добавить("ГруппаАС_МОЛ", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛевая);
	НоваяГруппа.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.Отображение 		= ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;  
	
	НоваяГруппа.Видимость = Объект.АС_ОИФ И РольДоступна("АС_Кассир");
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_МОЛ", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_МОЛ"; 
	ПолеВвода_АЛФ.Доступность 	= Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_КомиссияМОЛПроцент", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_КомиссияМОЛПроцент";
	ПолеВвода_АЛФ.Доступность 	= Ложь;
    //СмирновРВ

КонецПроцедуры
