
&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)

	//+ИИТ_Аксеньюшкин
	Элементы.ГруппаКонтрагент.Видимость = Истина;
	Элементы.Контрагент.Видимость = Истина;
	Элементы.ГруппаКонтрагент.Доступность = Истина;
	Элементы.Контрагент.Доступность = Истина;
	Элементы.ГруппаКонтрагент.ТолькоПросмотр = Ложь;
	Элементы.Контрагент.ТолькоПросмотр = Ложь;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ВидОперацииПриИзмененииСервер")
Процедура АЛФ_ВидОперацииПриИзмененииСервер()
	
	#Вставка 
	//При изменении вида операции сбрасывается счет
	СчетКонтрагента 	= Объект.СчетКонтрагента;
	ТаблицаРасшифровки 	= Объект.РасшифровкаПлатежа.Выгрузить(); 
	#КонецВставки
	СписаниеСРасчетногоСчетаФормы.ВидОперацииПриИзмененииСервер(ЭтотОбъект);

	ОтобразитьГиперссылкуПерейтиВТаблицу();
	
	#Область УХ_Казначейство
	ОперативноеПланированиеФормыУХ.ПриИзмененииВидаОперацииНаСервереДокументДДС(ЭтотОбъект);
	#КонецОбласти
	
	#Вставка 
	//При изменении вида операции сбрасывается счет
	Объект.СчетКонтрагента = СчетКонтрагента;
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда 
		Объект.Проект 									= ТаблицаРасшифровки[0].Проект;
		Объект.СтатьяДвиженияДенежныхСредств 			= ТаблицаРасшифровки[0].СтатьяДвиженияДенежныхСредств;
		Объект.СтатьяДвиженияДенежныхСредствЗачисление 	= ТаблицаРасшифровки[0].СтатьяДвиженияДенежныхСредств;
		Если Не ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда 
			  Объект.ДокументПланирования = ТаблицаРасшифровки[0].ДокументПланирования;
		КонецЕсли;	
	Иначе
		
	КонецЕсли;	 
	#КонецВставки

КонецПроцедуры
