
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОсновная.УстановитьДействие("ПриСменеСтраницы", "ГруппаОсновнаяПриСменеСтраницы");

	ЭтаФорма.Элементы.Переместить(Элементы.Наименование, Элементы.ГруппаНаименованиеТипПроекта, Элементы.Проект);  
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_МОРС", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеТипПроекта, Элементы.ПроектЭтапа);
	ПолеВвода_АЛФ.Заголовок = "МОРС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_МОРС";
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_НеКонтролироватьОстатокМОРС", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеТипПроекта, Элементы.ПроектЭтапа);
	ПолеВвода_АЛФ.Заголовок = "Не контролировать остаток МОРС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_НеКонтролироватьОстатокМОРС";
	
	ПолеВвода_АЛФ = Элементы.Вставить("АС_ПроектУчета", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеТипПроекта, Элементы.ПроектЭтапа);
	ПолеВвода_АЛФ.Заголовок 	= "Проект учета";
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_ПроектУчета";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "АС_ПроектУчетаПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Вставить("АС_КонтрольБР", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеТипПроекта, Элементы.ПроектЭтапа);
	ПолеВвода_АЛФ.Заголовок 	= "Контроль БР";
	ПолеВвода_АЛФ.Вид 			= ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным 	= "Объект.АС_КонтрольБР";

	//Группа Значения по умолчанию
	
	ЭтаФорма.Элементы.Переместить(Элементы.ОсновнаяОрганизация, Элементы.ГруппаЗначенияПоУмолчанию, Элементы.ОсновнойКонтрагент);  
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ОсновнойБанковскийСчет", Тип("ПолеФормы"), Элементы.ГруппаКонтрагенты, Элементы.ОсновнойКонтрагент);
	ПолеВвода_АЛФ.Заголовок = "Банковский счет";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	  
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	ПолеВвода_АЛФ.СвязиПараметровВыбора = НовыеСвязи;
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОсновнойБанковскийСчет";  
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_Склад", Тип("ПолеФормы"), Элементы.ГруппаКонтрагенты, Элементы.ОсновнойКонтрагент);
	ПолеВвода_АЛФ.Заголовок = "Склад";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Склад";  
	
	Элементы.ОсновнойКонтрагент.Видимость = Ложь;
	Элементы.ОсновнойДоговорКонтрагента.Видимость = Ложь;    
	
	Элементы.ОсновнаяСтатьяДоходовИРасходов.Заголовок = "Статья БДР";
	Элементы.ОсновнаяСтатьяДвиженияДенежныхСредств.Заголовок = "Статья БДДС";

	ТаблицаОбъекты = Элементы.Вставить("ИИТ_РасчетныеСчетаПоУмолчанию", Тип("ТаблицаФормы"), Элементы.ГруппаЗначенияПоУмолчанию);
	ТаблицаОбъекты.ПутьКДанным = "Объект.ИИТ_РасчетныеСчетаПоУмолчанию";
	ТаблицаОбъекты.Ширина = 53;
	ТаблицаОбъекты.АвтоМаксимальнаяШирина = Ложь;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_РасчетныеСчетаПоУмолчаниюНомерСтроки", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_РасчетныеСчетаПоУмолчанию.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_РасчетныеСчетаПоУмолчаниюОрганизация", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок = "Организация";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_РасчетныеСчетаПоУмолчанию.Организация";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_РасчетныеСчетаПоУмолчаниюБанковскийСчет", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок = "Банковский счет";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_РасчетныеСчетаПоУмолчанию.БанковскийСчет";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтветственныйОператор", Тип("ПолеФормы"), Элементы.ГруппаРеквизиты);
	ПолеВвода_АЛФ.Заголовок = "Ответственный оператор";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОтветственныйОператор";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_РасположениеОбъекта", Тип("ПолеФормы"), Элементы.ГруппаРеквизиты);
	ПолеВвода_АЛФ.Заголовок = "Расположение объекта";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_РасположениеОбъекта";
	
	//Страница согласующие казначейства
	Страница_АЛФ = Элементы.Добавить("ГруппаСогласующиеЛица", Тип("ГруппаФормы"), Элементы.ГруппаОсновная);
	Страница_АЛФ.Вид = ВидГруппыФормы.Страница;
	Страница_АЛФ.Заголовок = "Согласующие лица (казначейство)";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий1", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 1";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий1";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий2", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 2";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий2";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий3", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 3";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий3";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий4", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 4";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий4";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий5", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 5";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий5";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий6", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 6";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий6";  
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий7", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 7";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий7";
	
	//Собственная Группа
	ГруппаСогласующийМОРС = Элементы.Добавить("ИИТ_СогласующийМОРС", Тип("ГруппаФормы"), Страница_АЛФ);
	ГруппаСогласующийМОРС.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаСогласующийМОРС.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаСогласующийМОРС.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСогласующийМОРС.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий8", Тип("ПолеФормы"), ГруппаСогласующийМОРС);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 8";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий8";  
	
	Декорация_АЛФ = Элементы.Добавить("ДекорацияМОРС", Тип("ДекорацияФормы"), ГруппаСогласующийМОРС);
	Декорация_Алф.Вид = ВидДекорацииФормы.Надпись;
	Декорация_АЛФ.Заголовок = "МОРС";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий9", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 9";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий9"; 
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий10", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 10";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий10";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий11", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 11";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий11";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий12", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 12";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий12";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий13", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 13";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий13";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий14", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 14";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий14"; 
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий15", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 15";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий15";
	
	//Собственная Группа
	ГруппаСогласующийБух = Элементы.Добавить("ИИТ_СогласующийБухгалтер", Тип("ГруппаФормы"), Страница_АЛФ);
	ГруппаСогласующийБух.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаСогласующийБух.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаСогласующийБух.Отображение = ОтображениеОбычнойГруппы.Нет; 
	ГруппаСогласующийБух.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Согласующий16", Тип("ПолеФормы"), ГруппаСогласующийБух);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 16";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Согласующий16";  
	
	Декорация_АЛФ = Элементы.Добавить("ДекорацияБухгалтер", Тип("ДекорацияФормы"), ГруппаСогласующийБух);
	Декорация_Алф.Вид = ВидДекорацииФормы.Надпись;
	Декорация_АЛФ.Заголовок = "Бухгалтер";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПользовательДляУведомления", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Пользователь для уведомления";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПользовательДляУведомления";
	
	//Страница согласующие прочие
	Страница_АЛФ = Элементы.Добавить("ГруппаСогласующиеЛицаПрочее", Тип("ГруппаФормы"), Элементы.ГруппаОсновная);
	Страница_АЛФ.Вид = ВидГруппыФормы.Страница;
	Страница_АЛФ.Заголовок = "Согласующие лица (прочие документы)";  
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий1", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 1 (прочий)";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий1";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий2", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 2";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий2";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий3", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 3";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий3";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий4", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 4";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий4";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий5", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 5";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий5";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий6", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 6";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий6";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий7", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 7";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий7";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПрочееСогласующий8", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 8";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПрочееСогласующий8";  
	
	Декорация_АЛФ = Элементы.Добавить("ДекорацияЗаголовокТаблицы", Тип("ДекорацияФормы"), Страница_АЛФ);
	Декорация_Алф.Вид = ВидДекорацииФормы.Надпись;
	Декорация_АЛФ.Заголовок = "У следующих МОЛов будет доступ к данному объекту строительства в части остатков подотчетных лиц";
	Декорация_АЛФ.АвтоМаксимальнаяШирина = Ложь;
	НовыйШрифт = Новый Шрифт(Декорация_АЛФ.Шрифт,,, Истина);
	Декорация_АЛФ.Шрифт = НовыйШрифт;

	//Таблица МОЛ
	ТаблицаМол = Элементы.Добавить("ИИТ_МОЛыСДоступомКОбъекту", Тип("ТаблицаФормы"), Страница_АЛФ);
	ТаблицаМол.ПутьКДанным = "Объект.ИИТ_МОЛыСДоступомКОбъекту";
	ТаблицаМол.Ширина = 57;
	ТаблицаМол.АвтоМаксимальнаяШирина = Ложь;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_МОЛыСДоступомКОбъектуНомерСтроки", Тип("ПолеФормы"), ТаблицаМол);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_МОЛыСДоступомКОбъекту.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_МОЛыСДоступомКОбъектуОбъектСтроительства", Тип("ПолеФормы"), ТаблицаМол);
	ЭлементТаблицыФормы.Заголовок = "МОЛ";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_МОЛыСДоступомКОбъекту.МОЛ";

	//Страница доступ
	Страница_АЛФ = Элементы.Добавить("ГруппаДоступ", Тип("ГруппаФормы"), Элементы.ГруппаОсновная);
	Страница_АЛФ.Вид = ВидГруппыФормы.Страница;
	Страница_АЛФ.Заголовок = "Доступ"; 

	//Таблица МОЛ
	ТаблицаПользователи = Элементы.Добавить("Доступ", Тип("ТаблицаФормы"), Страница_АЛФ);
	ТаблицаПользователи.ПутьКДанным = "Объект.Доступ";

	ЭлементТаблицыФормы = Элементы.Добавить("ДоступНомерСтроки", Тип("ПолеФормы"), ТаблицаПользователи);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Доступ.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ДоступПользователь", Тип("ПолеФормы"), ТаблицаПользователи);
	ЭлементТаблицыФормы.Заголовок = "Пользователь";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Доступ.Пользователь";
	
	//Команда ТЧ	
	Команда = Команды.Добавить("Автозаполнение");
	Команда.Заголовок = "Автозаполнение";
	Команда.Действие  = "Автозаполнение";   
	
	КнопкаФормы = Элементы.Добавить("ДоступАвтозаполнение", Тип("КнопкаФормы"), ТаблицаПользователи.КоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "Автозаполнение";
	КнопкаФормы.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.Авто;
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  
    НовыйШрифт = Новый Шрифт(КнопкаФормы.Шрифт,,, Истина);
	КнопкаФормы.Шрифт = НовыйШрифт;

	//Страница кадровые данные
	Страница_АЛФ = Элементы.Добавить("ГруппаКадровыеДанные", Тип("ГруппаФормы"), Элементы.ГруппаОсновная);
	Страница_АЛФ.Вид = ВидГруппыФормы.Страница;
	Страница_АЛФ.Заголовок = "Кадровые данные";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_МестоПредоставленияУведомления", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Место предоставления уведомления";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_МестоПредоставленияУведомления";  
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.МногострочныйРежим = Истина;
	ПолеВвода_АЛФ.МаксимальнаяВысота = 2;   
	ПолеВвода_АЛФ.АвтоМаксимальнаяШирина = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_АдресОсуществленияТрудовойДеятельности", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Адрес осуществления трудовой деятельности";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_АдресОсуществленияТрудовойДеятельности";  
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.МногострочныйРежим = Истина;
	ПолеВвода_АЛФ.МаксимальнаяВысота = 2;   
	ПолеВвода_АЛФ.АвтоМаксимальнаяШирина = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДолжностноеЛицоМВД", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Должностное лицо МВД";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДолжностноеЛицоМВД";  
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.МногострочныйРежим = Истина;
	ПолеВвода_АЛФ.МаксимальнаяВысота = 2;   
	ПолеВвода_АЛФ.АвтоМаксимальнаяШирина = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОрганПредоставленияКопииДокумента", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Орган предоставления копии документа";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОрганПредоставленияКопииДокумента";  
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.МногострочныйРежим = Истина;
	ПолеВвода_АЛФ.МаксимальнаяВысота = 2;   
	ПолеВвода_АЛФ.АвтоМаксимальнаяШирина = Ложь;

	//Группа доверенность
	ГруппаДоверенность = Элементы.Добавить("ГруппаДоверенность", Тип("ГруппаФормы"), Страница_АЛФ);
	ГруппаДоверенность.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаДоверенность.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаДоверенность.Отображение = ОтображениеОбычнойГруппы.Нет; 
	ГруппаДоверенность.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ПредоставляющийУведомление", Тип("ПолеФормы"), ГруппаДоверенность);
	ПолеВвода_АЛФ.Заголовок = "Предоставляющий уведомление";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ПредоставляющийУведомление";  

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_НомерДоверенности", Тип("ПолеФормы"), ГруппаДоверенность);
	ПолеВвода_АЛФ.Заголовок = "Номер доверенности";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_НомерДоверенности";  

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДатаДоверенности", Тип("ПолеФормы"), ГруппаДоверенность);
	ПолеВвода_АЛФ.Заголовок = "Дата доверенности";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево; 
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДатаДоверенности";   
	
	//Страница согласующие закуп
	Страница_АЛФ = Элементы.Добавить("ГруппаСогласующиеЗакуп", Тип("ГруппаФормы"), Элементы.ГруппаОсновная);
	Страница_АЛФ.Вид = ВидГруппыФормы.Страница;
	Страница_АЛФ.Заголовок = "Согласующие закуп";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп1", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий закуп 1";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп1";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп2", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 2";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп2";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп3", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 3";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп3";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп4", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 4";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп4";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп5", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 5";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп5";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп6", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 6";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп6";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп7", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 7";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп7";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СогласующийЗакуп8", Тип("ПолеФормы"), Страница_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Согласующий 8";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СогласующийЗакуп8";  
	
	//ТВН++ Перенос доработок
	//УстановитьВидимостьЭлементов();
	//ТВН--
	
КонецПроцедуры

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Элементы.Проект.Видимость 	= Истина;
	//Элементы.Проект.Доступность = Истина; 
	
КонецПроцедуры

&НаСервере
&После("УстановитьВидимость")
Процедура АЛФ_УстановитьВидимость()
	
	Элементы.Проект.Видимость 	= Истина;
	Элементы.Проект.Доступность = Истина;

КонецПроцедуры

#Область ПереносДоработок

&НаКлиенте
Процедура ГруппаОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ТекущаяСтраница <> Элементы.ГруппаДоступ Тогда
		Возврат;
	КонецЕсли;
	
	//ЗаполнитьДоступы();

КонецПроцедуры

&НаКлиенте
Процедура Автозаполнение(Команда)
	АвтозаполнениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвтозаполнениеНаСервере()
	ЗаполнитьДоступы();
КонецПроцедуры     

Процедура УстановитьВидимостьЭлементов()
	Элементы.ГруппаЗначенияПоУмолчанию.Видимость = (Не ЗначениеЗаполнено(Объект.Родитель));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступы()
	
	ТЗДоступы = Новый ТаблицаЗначений;
	ТЗДоступы.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	Для Н = 1 По 16 Цикл
		Если ЗначениеЗаполнено(Объект["ИИТ_Согласующий" + Строка(Н)]) Тогда
			НоваяСтрока = ТЗДоступы.Добавить();
			НоваяСтрока.Пользователь = Объект["ИИТ_Согласующий" + Строка(Н)];
		КонецЕсли;
	КонецЦикла;

	Для Н = 1 По 8 Цикл
		Если ЗначениеЗаполнено(Объект["ИИТ_ПрочееСогласующий" + Строка(Н)]) Тогда
			НоваяСтрока = ТЗДоступы.Добавить();
			НоваяСтрока.Пользователь = Объект["ИИТ_ПрочееСогласующий" + Строка(Н)];
		КонецЕсли;
	КонецЦикла;
	
	ТЗДоступы.Свернуть("Пользователь");
	МассивПользователей = ТЗДоступы.ВыгрузитьКолонку("Пользователь");
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		СтруктураПоиска = Новый Структура("Пользователь", Пользователь);
		НайденныеСтроки = Объект.Доступ.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Доступ.Добавить();
			НоваяСтрока.Пользователь = Пользователь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры	 

&НаСервере
Функция МаксимальныйУровеньСправочника(Ссылка)
	
	Структура = Новый Структура;
	Структура.Вставить("ЕстьПроектУчета", Ложь);
	Структура.Вставить("ТекущийРодитель", Ссылка.Родитель);

	ЕстьПроектУчета = Ложь;
	ТекущийРодитель = Ссылка.Родитель;
	
	Если ТекущийРодитель.АС_ПроектУчета Тогда
		ЕстьПроектУчета = Истина;
	Иначе 	
		Пока ЗначениеЗаполнено(ТекущийРодитель.Родитель) Цикл
			ТекущийРодитель = ТекущийРодитель.Родитель;
			ЕстьПроектУчета = ТекущийРодитель.АС_ПроектУчета; 
			Если ЕстьПроектУчета Тогда 
				Прервать;                  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Структура.Вставить("ЕстьПроектУчета", ЕстьПроектУчета);
	Структура.Вставить("ТекущийРодитель", ТекущийРодитель);

	Возврат Структура

КонецФункции

&НаСервере
Функция ПолучитьРодителя(Ссылка)
     Возврат Ссылка.Родитель; 
КонецФункции

&НаКлиенте
Процедура АС_ПроектУчетаПриИзменении(Элемент) 
	Структура 	= МаксимальныйУровеньСправочника(Объект.Ссылка);
	
	Если Объект.АС_ПроектУчета Тогда //Установили флаг 	
		Если Структура.ЕстьПроектУчета Тогда 
			Объект.АС_ПроектУчета 	= Ложь;
			Сообщение 				= "Уже установлен флаг Проект учета"; 
			НавигационнаяСсылка 	= ПолучитьНавигационнуюСсылку(Структура.ТекущийРодитель);
			ОписаниеТекста 		= Новый ФорматированнаяСтрока(Строка(Структура.ТекущийРодитель),, , ,); 
			ВывестиСообщение(Сообщение, ОписаниеТекста, НавигационнаяСсылка);	 	
		КонецЕсли;	
	Иначе //Сняли флаг
		Если Структура.ЕстьПроектУчета = Ложь Тогда 
			Объект.АС_ПроектУчета 	= Истина;
			Сообщение 				= "Флаг Проект учета, нельзя снять, у";
			ОписаниеТекста 			= Новый ФорматированнаяСтрока(Строка(Объект.Ссылка),, , ,); 
			ВывестиСообщение(Сообщение, ОписаниеТекста, НавигационнаяСсылка);	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиСообщение(Текст, ОписаниеТекста, НавигационнаяСсылка)
      ПоказатьОповещениеПользователя(Текст, НавигационнаяСсылка, ОписаниеТекста,,СтатусОповещенияПользователя.Важное);  
КонецПроцедуры
  
#КонецОбласти