
&ИзменениеИКонтроль("ОтразитьФактическоеДвижениеПоБюджетамПоПредопределенномуПравилу")
Процедура АЛФ_ОтразитьФактическоеДвижениеПоБюджетамПоПредопределенномуПравилу(Источник, Отказ)

	ЗаполнениеОФДРазрешено = ЗаполнениеОФД.ТребуетсяЗаполнение(Источник.Ссылка);

	// Пытаемся найти ОФД
	ОФДПоИсточнику = Неопределено;
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ДокументОтраженияФакта", ОФДПоИсточнику) Тогда
		ОФДПоИсточнику = ОФДПоИсточнику(Источник.Ссылка);
	КонецЕсли;

	// ОФД нет и заполнять его не надо
	Если ОФДПоИсточнику = Неопределено И НЕ ЗаполнениеОФДРазрешено Тогда  	
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОФДПоИсточнику) Тогда
		ДокументОФД = ОФДПоИсточнику.ПолучитьОбъект();
	Иначе
		ДокументОФД = Документы.ОтражениеФактическихДанныхБюджетирования.СоздатьДокумент();
		ДокументОФД.Дата = Источник.Дата;		
	КонецЕсли;

#Вставка
	//+ИИТ_Аксеньюшкин
	ЗаполнениеОФДРазрешено = Ложь;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	Если ЗаполнениеОФДРазрешено Тогда 	
		ЗаполнениеОФД.ПодготовитьДопИнформациюДляОтраженияДокумента(Источник, ДокументОФД);

		// Записать
		ПодготовитьОбъектОтраженияФакта(ДокументОФД);
		ДокументОФД.Заполнить(Источник.Ссылка);
		Если ДокументОФД.ЭтоНовый() Тогда
			ДокументОФД.УстановитьНовыйНомер();
		КонецЕсли;
		ДокументОФД.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли ДокументОФД.Проведен Тогда
		ДокументОФД.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;

КонецПроцедуры
