
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ГруппаФормы_АЛФ = Элементы.Вставить("ГруппаОсновныеПризнаки_группа", Тип("ГруппаФормы"), , Элементы.ГруппаДопРеквизитыСвойстваХарактеристик);
	ГруппаФормы_АЛФ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы_АЛФ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОСИИнструмент", Тип("ПолеФормы"), ГруппаФормы_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "ОС и инструмент";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОСИИнструмент";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_УчетПоИнвентарнымНомерам", Тип("ПолеФормы"), ГруппаФормы_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Учет по инвентарным номерам";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_УчетПоИнвентарнымНомерам";
	
КонецПроцедуры
