
&ИзменениеИКонтроль("ПолучитьТекстЗапросаЗаявкиНаОперациюМоиОповещения")
Функция АЛФ_ПолучитьТекстЗапросаЗаявкиНаОперациюМоиОповещения()
	  	РезультатФункции = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаОперацию.Ссылка КАК Ссылка,
	|	ЗаявкаНаОперацию.Номер КАК Номер,
	|	ЗаявкаНаОперацию.Дата КАК Дата,
	|	ЗаявкаНаОперацию.ФормаОплаты КАК ФормаОплаты,
	|	ЗаявкаНаОперацию.ВалютаВзаиморасчетов КАК ВалютаДокумента,
	|	ЗаявкаНаОперацию.СуммаДокумента КАК СуммаДокумента,
	#Удаление
	|	ЗаявкаНаОперацию.Контрагент КАК Контрагент, 
	#КонецУдаления
#Вставка
	|	ВЫБОР
	|		КОГДА ЗаявкаНаОперацию.ИИТ_КонтрагентПередачаДругойОрганизации <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗаявкаНаОперацию.ИИТ_КонтрагентПередачаДругойОрганизации
	|		ИНАЧЕ ЗаявкаНаОперацию.Контрагент
	|	КОНЕЦ КАК Контрагент,
#КонецВставки
	|	ЗаявкаНаОперацию.Организация КАК Организация,
	|	ЗаявкаНаОперацию.ЦФО КАК ЦФО,
	|	ЗаявкаНаОперацию.Приоритет КАК Приоритет,
	|	ЗаявкаНаОперацию.СчетКонтрагента КАК СчетКонтрагента,
	|	ЗаявкаНаОперацию.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкаНаОперацию.Проект КАК Проект,
	|	ЗаявкаНаОперацию.ВидОперацииУХ КАК ВидОперацииУХ,
	|	ЗаявкаНаОперацию.КрайняяДата КАК КрайняяДата,  
	#Вставка
	|	ПОДСТРОКА(ЗаявкаНаОперацию.Комментарий, 1, 1000) КАК Комментарий,
	|	ДатыСтатусов.ДатаСтатуса КАК ДатаСтатуса,
#КонецВставки
	|	ЗаявкаНаОперацию.ЕстьПревышениеЛимитов КАК ЕстьПревышениеЛимитыБюджет,
	|	ЗадачиУниверсальныхПроцессов.ВидДействия КАК ВидДействия,
	|	ЗадачиУниверсальныхПроцессов.Задача КАК Задача,
	|	ЗадачиУниверсальныхПроцессов.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаОперацию
	|		ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ЗаявкаНаОперацию.Ссылка
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса КАК Ссылка_,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ОтложеннаяОбработкаЭтаповПроцессов.Период > ОтложеннаяОбработкаЭтаповПроцессов.ВремяЗавершенияЗадания
	|						ТОГДА ОтложеннаяОбработкаЭтаповПроцессов.Период
	|					ИНАЧЕ ОтложеннаяОбработкаЭтаповПроцессов.ВремяЗавершенияЗадания
	|				КОНЕЦ) КАК ДатаСтатуса
	|		ИЗ
	|			РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ОтложеннаяОбработкаЭтаповПроцессов
	|		ГДЕ
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса) КАК ДатыСтатусов
	|		ПО ЗадачиУниверсальныхПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса = ДатыСтатусов.Ссылка_
#КонецВставки
	|ГДЕ
	|	ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
	|	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
	|	И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ЕстьУточнениеЗамещения
	|				ТОГДА ВЫБОР
	|						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
	|							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Возврат РезультатФункции;	
КонецФункции
