
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//ТВН++ Перенос доработок
	МассивОС = ИИТ_ВспомогательныеФункцииСервер.ПолучитьМассивДоступныхПроектов();
	Список.Параметры.УстановитьЗначениеПараметра("МассивОС", МассивОС);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеОС", РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_ПолноеЧтение")
												ИЛИ РольДоступна("ИИТ_ФинСлужба") ИЛИ РольДоступна("ИИТ_РуководительСнабжения") ИЛИ РольДоступна("ИИТ_Снабжение"));

	Если Параметры.Свойство("ОтображениеСписка") Тогда											
		Элементы.Список.Отображение = Параметры.ОтображениеСписка;
	КонецЕсли;
	//ТВН--
	
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_СписокПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_АС_ПроектУчетаПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
