#Область Перенос_доработок

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ПроставитьЗаявки(Команда)
	
	МассивДокументов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		МассивДокументов.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	ОткрытьФорму("ЖурналДокументов.Деньги.Форма.ФормаПростановкиЗаявки", Новый Структура("ВыделенныеДокументы", МассивДокументов));

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ЖурналДокументовБанковскиеВыписки.Ссылка ССЫЛКА Документ.СписаниеСРасчетногоСчета
				|			ТОГДА ВЫРАЗИТЬ(ЖурналДокументовБанковскиеВыписки.Ссылка КАК Документ.СписаниеСРасчетногоСчета)
				|		ИНАЧЕ ВЫРАЗИТЬ(ЖурналДокументовБанковскиеВыписки.Ссылка КАК Документ.ПоступлениеНаРасчетныйСчет)
				|	КОНЕЦ КАК Ссылка,
				|	ЖурналДокументовБанковскиеВыписки.Дата КАК Дата,
				|	НАЧАЛОПЕРИОДА(ЖурналДокументовБанковскиеВыписки.Дата, ДЕНЬ) КАК ДатаОтбора,
				|	ЖурналДокументовБанковскиеВыписки.ПометкаУдаления КАК ПометкаУдаления,
				|	ЖурналДокументовБанковскиеВыписки.Номер КАК Номер,
				|	ЖурналДокументовБанковскиеВыписки.Проведен КАК Проведен,
				|	ЖурналДокументовБанковскиеВыписки.Организация КАК Организация,
				|	ЖурналДокументовБанковскиеВыписки.БанковскийСчет КАК БанковскийСчет,
				|	БанковскиеСчетаИнтеграцииСБанком.БанковскийСчет ЕСТЬ НЕ NULL  КАК СчетВРежимеИнтеграции,
				|	ЖурналДокументовБанковскиеВыписки.Контрагент КАК Контрагент,
				|	ЖурналДокументовБанковскиеВыписки.Доход КАК Поступление,
				|	ЖурналДокументовБанковскиеВыписки.Расход КАК Списание,
				|	ЖурналДокументовБанковскиеВыписки.Валюта КАК Валюта,
				|	ЖурналДокументовБанковскиеВыписки.ВидОперации КАК ВидОперации,
				|	ЖурналДокументовБанковскиеВыписки.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
				|	ЖурналДокументовБанковскиеВыписки.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
				|	ЖурналДокументовБанковскиеВыписки.РучнаяКорректировка КАК РучнаяКорректировка,
				|	ЖурналДокументовБанковскиеВыписки.НазначениеПлатежа КАК НазначениеПлатежа,
				|	ЖурналДокументовБанковскиеВыписки.Ответственный КАК Ответственный,
				|	ЖурналДокументовБанковскиеВыписки.Комментарий КАК Комментарий,
				|	ЖурналДокументовБанковскиеВыписки.Тип КАК Тип,
				|	ВЫБОР
				|		КОГДА ЖурналДокументовБанковскиеВыписки.РучнаяКорректировка = ИСТИНА
				|			ТОГДА ВЫБОР
				|					КОГДА ЖурналДокументовБанковскиеВыписки.ПометкаУдаления = ИСТИНА
				|						ТОГДА 10
				|					КОГДА ЖурналДокументовБанковскиеВыписки.Проведен = ЛОЖЬ
				|						ТОГДА 9
				|					ИНАЧЕ 8
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ЖурналДокументовБанковскиеВыписки.ПометкаУдаления = ИСТИНА
				|					ТОГДА 2
				|				КОГДА ЖурналДокументовБанковскиеВыписки.Проведен = ИСТИНА
				|					ТОГДА 1
				|				ИНАЧЕ 0
				|			КОНЕЦ
				|	КОНЕЦ КАК СостояниеДокумента,
				|	НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы,
				|	НЕ ПредупрежденияПриЗагрузкеВыписки.Документ ЕСТЬ NULL КАК ЕстьПредупреждения,
				|	ЧекиНПД.НомерЧека КАК НомерЧека,
				|	ЧекиНПД.Состояние КАК Состояние,
				|	ЧекиНПД.ПроизведенВозвратПоЧеку КАК ПроизведенВозвратПоЧеку,
				|	ЧекиНПД.ДатаАннулированияЧека КАК ДатаАннулированияЧека,
				|	ВЫБОР
				|		КОГДА ЧекиНПД.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЧековНПД.ОжидаетОтправкиВФНС)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЧекНПДОжидаетОтправкиВФНС,
				|	ЖурналДокументовБанковскиеВыписки.Ссылка.ИИТ_ЗаявкиПроставлены КАК ЗаявкиПроставлены
				|ИЗ
				|	ЖурналДокументов.Деньги КАК ЖурналДокументовБанковскиеВыписки
				|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
				|		ПО ЖурналДокументовБанковскиеВыписки.Ссылка = НаличиеФайлов.ОбъектСФайлами}
				|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредупрежденияПриЗагрузкеВыписки КАК ПредупрежденияПриЗагрузкеВыписки
				|		ПО ЖурналДокументовБанковскиеВыписки.Ссылка = ПредупрежденияПриЗагрузкеВыписки.Документ
				|			И ЖурналДокументовБанковскиеВыписки.Организация = ПредупрежденияПриЗагрузкеВыписки.Организация}
				|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧекиНПД КАК ЧекиНПД
				|		ПО ЖурналДокументовБанковскиеВыписки.Ссылка = ЧекиНПД.ДокументОснование
				|			И ЖурналДокументовБанковскиеВыписки.Организация = ЧекиНПД.Организация}
				|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БанковскиеСчетаИнтеграцииСБанком КАК БанковскиеСчетаИнтеграцииСБанком
				|		ПО ЖурналДокументовБанковскиеВыписки.БанковскийСчет = БанковскиеСчетаИнтеграцииСБанком.БанковскийСчет}
				|ГДЕ
				|	(ЖурналДокументовБанковскиеВыписки.Ссылка ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
				|			ИЛИ ЖурналДокументовБанковскиеВыписки.Ссылка ССЫЛКА Документ.СписаниеСРасчетногоСчета)";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "ЖурналДокументов.Деньги";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);     
		
	//Команды
	КомандаФормы = Команды.Добавить("ПроставитьЗаявки");  //На форме отсутствует
	КомандаФормы.Заголовок = "ПроставитьЗаявки";
	КомандаФормы.Действие  = "ПроставитьЗаявки";
		
	КнопкаКоманднойПанели = Элементы.Вставить("ФормаПроставитьЗаявки", Тип("КнопкаФормы"), Элементы.ГруппаГлобальныеКоманды, Элементы.ОбщаяКомандаСтруктураПодчиненности);
	КнопкаКоманднойПанели.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаКоманднойПанели.Заголовок = "Проставить заявки";
	КнопкаКоманднойПанели.ИмяКоманды  = "ПроставитьЗаявки"; 

	//Поля списка
	ЭлементСпискаФормы = Элементы.Вставить("ЗаявкиПроставлены", Тип("ПолеФормы"), Элементы.Список, Элементы.Дата);
	ЭлементСпискаФормы.Заголовок = "Заявки проставлены"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеФлажка; 
	ЭлементСпискаФормы.ОтображатьВШапке = Ложь;
	ЭлементСпискаФормы.КартинкаШапки = БиблиотекаКартинок.ЗавершитьРедактированиеМакета;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ЗаявкиПроставлены";   
	
КонецПроцедуры
