
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	//Команды
	КомандаФормы = Команды.Добавить("ИИТ_КомандаОтбораПоВсемЗаказам");
	КомандаФормы.Заголовок = "Отбора по всем заказам";
	КомандаФормы.Действие  = "ИИТ_КомандаОтбораПоВсемЗаказам";
	
	КомандаФормы = Команды.Добавить("ИИТ_КомандаОтбораПоНезакрытымЗаказам");
	КомандаФормы.Заголовок = "Отбора по незакрытым заказам";
	КомандаФормы.Действие  = "ИИТ_КомандаОтбораПоНезакрытымЗаказам";
	
	КомандаФормы = Команды.Добавить("ИИТ_КомандаОтбораПоТекущемуПользователю");
	КомандаФормы.Заголовок = "Отбор по текущему пользователю";
	КомандаФормы.Действие  = "ИИТ_КомандаОтбораПоТекущемуПользователю";
	
	КомандаФормы = Команды.Добавить("ОтразитьВБДДС");
	КомандаФормы.Заголовок = "Отразить в БДДС";
	КомандаФормы.Действие  = "ОтразитьВБДДС";  
	
	КомандаФормы = Команды.Добавить("ИИТ_ХодСогласования");
	КомандаФормы.Заголовок = "Ход согласования";
	КомандаФормы.Действие  = "ИИТ_ХодСогласования";  
	
	КомандаФормы = Команды.Добавить("ИИТ_ИсторияСогласования");
	КомандаФормы.Заголовок = "История согласования";
	КомандаФормы.Действие  = "ИИТ_ИсторияСогласования";  
	
	КомандаФормы = Команды.Добавить("АС_ВсеФайлы"); 
	КомандаФормы.Заголовок = "Все файлы";
	КомандаФормы.Действие  = "АС_ВсеФайлы"; 
	
	КомандаФормы = Команды.Добавить("АС_РедактироватьЭтап"); 
	КомандаФормы.Заголовок = "Редактировать этап";
	КомандаФормы.Действие  = "АС_РедактироватьЭтап";

	//Стандартная команда списка не создается программно, размещена на форме
	
	//Элементы формы
	ГруппаОтбор = Элементы.Вставить("ИИТ_ГруппаОтбораСписка", Тип("ГруппаФормы"), , Элементы.ГруппаПользовательскихНастроек);
	ГруппаОтбор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаОтбор.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор.ОтображатьЗаголовок = Ложь;  
	
	ГруппаОтбор_1 = Элементы.Добавить("ИИТ_ГруппаПолей", Тип("ГруппаФормы"), ГруппаОтбор);
	ГруппаОтбор_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОтбор_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор_1.ОтображатьЗаголовок = Ложь; 	

	ГруппаОтбор_2 = Элементы.Добавить("ИИТ_ГруппаКнопок", Тип("ГруппаФормы"), ГруппаОтбор);
	ГруппаОтбор_2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор_2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОтбор_2.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор_2.ОтображатьЗаголовок = Ложь; 	
   	ГруппаОтбор_2.Видимость = Ложь;
	
	//Элементы группы 1
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьОтборПоОтветственным", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Заголовок = "Ответственный";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ИспользоватьОтборПоОтветственным";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИспользоватьОтборПоОтветственнымПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтборПоОтветственным", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ОтборПоОтветственным";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтборПоОтветственнымПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьОтборПоПоставщикам", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Заголовок = "Контрагент";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ИспользоватьОтборПоПоставщикам";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИспользоватьОтборПоПоставщикамПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтборПоПоставщикам", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ОтборПоПоставщикам";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтборПоПоставщикамПриИзменении");
	
	//Элементы группы 2, команды
	КнопкаФормы = Элементы.Добавить("ИИТ_КомандаОтбораПоТекущемуПользователю", Тип("КнопкаФормы"), ГруппаОтбор_2);
	КнопкаФормы.Заголовок = "Свои заявки"; 	
	КнопкаФормы.ИмяКоманды = "ИИТ_КомандаОтбораПоТекущемуПользователю";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	КнопкаФормы = Элементы.Добавить("ИИТ_КомандаОтбораПоНезакрытымЗаказам", Тип("КнопкаФормы"), ГруппаОтбор_2);
	КнопкаФормы.Заголовок = "Незакрытые заявки"; 	
	КнопкаФормы.ИмяКоманды = "ИИТ_КомандаОтбораПоНезакрытымЗаказам";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	КнопкаФормы = Элементы.Добавить("ИИТ_КомандаОтбораПоВсемЗаказам", Тип("КнопкаФормы"), ГруппаОтбор_2);
	КнопкаФормы.Заголовок = "Все заявки"; 	
	КнопкаФормы.ИмяКоманды = "ИИТ_КомандаОтбораПоВсемЗаказам";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;     
	
	Элементы.Переместить(Элементы.СписокУстановитьИнтервал, ГруппаОтбор_2);
	
	//Список
	КнопкаФормы = Элементы.Добавить("ИИТ_ХодСогласования", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
	КнопкаФормы.Заголовок = "Ход согласования";
	КнопкаФормы.Картинка = БиблиотекаКартинок.СхемаПроцесса;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст; 
	КнопкаФормы.ИмяКоманды = "ИИТ_ХодСогласования";
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;    

	КнопкаФормы = Элементы.Добавить("ИИТ_ИсторияСогласования", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
	КнопкаФормы.Заголовок = "История согласования";
	КнопкаФормы.Картинка = БиблиотекаКартинок.ИсторияВыгрузок;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст; 
	КнопкаФормы.ИмяКоманды = "ИИТ_ИсторияСогласования";
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;    
	
	КнопкаФормы = Элементы.Добавить("АС_ВсеФайлы", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
	КнопкаФормы.Заголовок = "Все файлы";
	КнопкаФормы.ИмяКоманды = "АС_ВсеФайлы";
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;  
	
	КнопкаФормы = Элементы.Добавить("АС_РедактироватьЭтап", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
	КнопкаФормы.Заголовок 	= "Редактировать этап";
	КнопкаФормы.ИмяКоманды 	= "АС_РедактироватьЭтап";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаФормы.Доступность = ИИТ_ВспомогательныеФункцииСервер.РольДоступна_("АС_ИзменениеЭтапаВСогласованныхЗаявка");
	
	КнопкаФормы = Элементы.Добавить("СписокОтразитьВБДДС", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
	КнопкаФормы.Заголовок = "Отразить в БДДС"; 	
	КнопкаФормы.ИмяКоманды = "ОтразитьВБДДС";
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;    
	
	//Элементы.КнопкаПоказатьСкрытьАктуальные.Видимость = Ложь;   

	//Колонки списка
	Элементы.Приоритет.Видимость = Ложь;
	Элементы.Проект.Видимость = Ложь;
	
	ЭлементТаблицыФормы = Элементы.Вставить("ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Список, Элементы.ДатаДокумента);
	ЭлементТаблицыФормы.Заголовок = "Объект строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ОбъектСтроительства";
	
	ЭлементТаблицыФормы = Элементы.Вставить("ЭтапПроцесса", Тип("ПолеФормы"), Элементы.Список, Элементы.ДатаДокумента);
	ЭлементТаблицыФормы.Заголовок = "Этап процесса";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ЭтапПроцесса";
	
	//ЭлементТаблицыФормы = Элементы.Вставить("Комментарий", Тип("ПолеФормы"), Элементы.Список, Элементы.ДоговорКонтрагента);
	//ЭлементТаблицыФормы.Заголовок = "Комментарий";
	//ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	//ЭлементТаблицыФормы.ПутьКДанным = "Список.Комментарий";
	
	ЭлементТаблицыФормы = Элементы.Вставить("ЭтапСтроительства", Тип("ПолеФормы"), Элементы.Список, Элементы.ЦФО);
	ЭлементТаблицыФормы.Заголовок = "Этап строительства";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ЭтапСтроительства";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ДокументОснование", Тип("ПолеФормы"), Элементы.Список);
	ЭлементТаблицыФормы.Заголовок = "Документ основание";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ДокументОснование";
	
	ЭлементТаблицыФормы = Элементы.Добавить("Проект_", Тип("ПолеФормы"), Элементы.Список);
	ЭлементТаблицыФормы.Заголовок = "Проект МОРС";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ПроектМОРС";

	ЭлементТаблицыФормы = Элементы.Добавить("ДатаСтатуса", Тип("ПолеФормы"), Элементы.Список);
	ЭлементТаблицыФормы.Заголовок = "Дата статуса";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ДатаСтатуса";

	ЭлементТаблицыФормы = Элементы.Добавить("ТекущийСогласующий", Тип("ПолеФормы"), Элементы.Список);
	ЭлементТаблицыФормы.Заголовок = "Текущий согласующий";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ТекущийСогласующий";

	ЭлементТаблицыФормы = Элементы.Добавить("СтатьяДвиженияДенежныхСредств", Тип("ПолеФормы"), Элементы.Список);
	ЭлементТаблицыФормы.Заголовок = "Статья движения денежных средств";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.СтатьяДвиженияДенежныхСредств";

	//+ИИТ_Аксеньюшкин
	МассивОС = ИИТ_ВспомогательныеФункцииСервер.ПолучитьМассивДоступныхПроектов();
	Список.Параметры.УстановитьЗначениеПараметра("МассивОС", МассивОС);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеОС", РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_ПолноеЧтение") ИЛИ РольДоступна("ИИТ_Финслужба"));
	
	МассивОпераций = ИИТ_ВспомогательныеФункцииСервер.ПолучитьДоступныеВидыОперацийЗаявкаНаРасходДСЧтение();
	Список.Параметры.УстановитьЗначениеПараметра("МассивОпераций", МассивОпераций);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеВидыОпераций", РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_ПолноеЧтение") ИЛИ РольДоступна("ИИТ_Финслужба"));
	
	ДоступныЗаявкиПоМатериалам = РольДоступна("ИИТ_РуководительСнабжения") ИЛИ РольДоступна("ИИТ_Снабжение");
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныЗаявкиПоМатериалам", ДоступныЗаявкиПоМатериалам);
	
	ДоступныеРасчетныеСчета = ПолучитьДоступныеРасчетныеСчета();
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеСчета", ДоступныеРасчетныеСчета);
	
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеОплатыПоставщикам", РольДоступна("ИИТ_Бухгалтер"));
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры

#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПолучитьДоступныеРасчетныеСчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Заместители КАК Заместители
	|		ПО БанковскиеСчета.Ответственный = Заместители.ЗамещаемыйПользователь
	|ГДЕ
	|	(БанковскиеСчета.Ответственный = &ТекПользователь
	|			ИЛИ Заместители.Заместитель = &ТекПользователь)";
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоОтветственным) И ИИТ_ИспользоватьОтборПоОтветственным = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоОтветственным.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоПоставщикам) И ИИТ_ИспользоватьОтборПоПоставщикам = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоПоставщикам.Ссылка;
	КонецЕсли; 
		
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборПоОтветственнымПриИзменении(Элемент)
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборПоПоставщикамПриИзменении(Элемент)
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_КомандаОтбораПоВсемЗаказам(Команда)
	ИИТ_КомандаОтбораПоВсемЗаказамНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_КомандаОтбораПоВсемЗаказамНаСервере()
	
	ИИТ_ИспользоватьОтборПоОтветственным = Ложь;
	ИИТ_ИспользоватьОтборПоПоставщикам = Ложь;
	Список.Отбор.Элементы.Очистить();
		
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_КомандаОтбораПоНезакрытымЗаказам(Команда)
	ИИТ_КомандаОтбораПоНезакрытымЗаказамНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_КомандаОтбораПоНезакрытымЗаказамНаСервере()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоОтветственным) И ИИТ_ИспользоватьОтборПоОтветственным = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоПоставщикам) И ИИТ_ИспользоватьОтборПоПоставщикам = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоПоставщикам.Ссылка;
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеСогласования");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияСогласования.Утверждена;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_КомандаОтбораПоТекущемуПользователю(Команда)
	ИИТ_КомандаОтбораПоТекущемуПользователюНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_КомандаОтбораПоТекущемуПользователюНаСервере()
	
	ИИТ_ИспользоватьОтборПоОтветственным = Ложь;
	
	Список.Отбор.Элементы.Очистить();

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоПоставщикам) И ИИТ_ИспользоватьОтборПоПоставщикам = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоПоставщикам.Ссылка;
	КонецЕсли; 
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоОтветственнымПриИзменении(Элемент)
	ИИТ_ИспользоватьОтборПоОтветственным = Истина;
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок(); 	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоПоставщикамПриИзменении(Элемент)
    ИИТ_ИспользоватьОтборПоПоставщикам = Истина;
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок(); 
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОтразитьВБДДС(Команда)

	Попытка
		МассивДокументов = Новый Массив;
		Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
			МассивДокументов.Добавить(ВыделеннаяСтрока.Ссылка);
		КонецЦикла;
		ОтразитьВБДДСНаСервере(МассивДокументов);
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура АС_ВсеФайлы(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	 
	ПараметрыОткрытияФормы 	= Новый Структура;
    Отбор 					= Новый Структура; 
	Отбор.Вставить("ЗаявкаНаОплату"	, ТекущиеДанные.Ссылка);
	ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.АС_ПрисоединенныеФайлы.ФормаСписка", ПараметрыОткрытияФормы);

КонецПроцедуры

&НаКлиенте
Процедура АС_РедактироватьЭтап(Команда)
	 
	Оповещение 		= Новый ОписаниеОповещения("ПриЗавершенииВыбораПроекта", ЭтотОбъект);      
	ТекущиеДанные 	= Элементы.Список.ТекущиеДанные; 

	ПараметрыОткрытияФормы 	= Новый Структура;
    Отбор 					= Новый Структура; 
	Отбор.Вставить("Родитель"	, ТекущиеДанные.ОбъектСтроительства);
    ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);

	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыОткрытияФормы,,,,,Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииВыбораПроекта(Результат, ДополнительныеПараметры)  Экспорт 
	
	ТекущиеДанные 			= Элементы.Список.ТекущиеДанные; 
	Если ЗначениеЗаполнено(Результат) Тогда 
		ИзменитьЭтапСтроительства(ТекущиеДанные.Ссылка, Результат);
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура ИзменитьЭтапСтроительства(ДокументСсылка, Этап)
	ДокументОбъект 			= ДокументСсылка.ПолучитьОбъект();
	ДокументОбъект.Проект 	= Этап; 
	Если ДокументОбъект.ДвиженияОперации.Количество() > 0 И ЗначениеЗаполнено(ДокументОбъект.ДвиженияОперации[0].Проект) Тогда
		 ДокументОбъект.ДвиженияОперации[0].Проект = Этап;
	КонецЕсли;

	Если ДокументОбъект.Проведен Тогда 
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе 
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры	

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ОтразитьВБДДСНаСервере(МассивДокументов)

	Для Каждого ДокСсылка Из МассивДокументов Цикл
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ДокОбъект.ИИТ_ОтразитьБДДС = Истина;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		Попытка
			ДокОбъект.ОбменДанными.Загрузка = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры    

&НаКлиенте
Процедура ИИТ_ХодСогласования(Команда)                         
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Ссылка = Элементы.Список.ТекущиеДанные.Ссылка;
	
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ИИТ_ИсторияСогласования(Команда)

	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Ссылка = Элементы.Список.ТекущиеДанные.Ссылка;
	
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Ссылка);

КонецПроцедуры

#КонецОбласти