
&ИзменениеИКонтроль("ПриЧтенииНаСервере")
Процедура АЛФ_ПриЧтенииНаСервере(Форма, ТекущийОбъект)
	#Область УХ_Встраивание
	ВзаиморасчетыВстраиваниеУХ.ПоступлениеТоваровУслугПередЧтениемНаСервере(Форма, ТекущийОбъект);
	#КонецОбласти
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
#Удаление
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект);
#КонецУдаления
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	

	ПроверитьДоступПоВидуОперации(Форма);

	Если НЕ Форма.Параметры.Свойство("ИзменитьВидОперации")
		ИЛИ НЕ Форма.Параметры.ИзменитьВидОперации Тогда

		ЗаполнитьДанныеОРасхождениях(Форма);
	КонецЕсли;

	Форма.ПодготовитьФормуНаСервере();

КонецПроцедуры
