&НаСервере
Процедура АЛФ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//+ИИТ_Аксеньюшкин
	Если Найти(НадписьПояснениеПроверкиДублейФНС, "С таким ИНН и КПП") > 0 Тогда
		Сообщить("Запрещено создавать контрагентов с совпадающими ИНН и КПП. Действие отменено.");
		Отказ = Истина;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаСервере    
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АЛФ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 	
#Вставка        
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ВнешнийМОЛ", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Внешний МОЛ";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ВнешнийМОЛ";
#КонецВставки
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаОсновнаяКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "КнопкиКоманднойПанели");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если НЕ ЗначениеЗаполнено(БанковскийСчет.ВалютаДенежныхСредств) Тогда
		БанковскийСчет.ВалютаДенежныхСредств = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	КонецЕсли;
	
	ВестиУчетРасчетовСКонтрагентами = ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСКонтрагентами")
		И Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхБухгалтерии, ЧтениеДанныхБухгалтерии, ПросмотрРасчетовСКонтрагентами");
		// Данные о расчетах доступны администратору, полным правам или указанным ролям
	
	Если Параметры.Свойство("СтруктураЗаполнения")
		И Параметры.СтруктураЗаполнения.Свойство("КонтактнаяИнформацияДляПолнойФормы") Тогда
		ЗаполнитьКонтактнуюИнформациюПоДаннымЗаполнения(Параметры.СтруктураЗаполнения.КонтактнаяИнформацияДляПолнойФормы);
	КонецЕсли;
	
	РазместитьКонтактнуюИнформацию();
	
	РазместитьОсновноеКонтактноеЛицо(Истина);
	
	УстановитьДействиеНаПоляКИОсновногоКонтактногоЛица();
	
	ДоступенОтчетЗадолженностьПокупателей = ПравоДоступа("Использование", Метаданные.Отчеты.ЗадолженностьПокупателей);
	ДоступенОтчетЗадолженностьПоставщикам = ПравоДоступа("Использование", Метаданные.Отчеты.ЗадолженностьПоставщикам);
	ДоступенОтчетНеоплаченныеСчетаПокупателям = ПравоДоступа("Использование", Метаданные.Отчеты.АнализНеоплаченныхСчетовПокупателям);
	ДоступенОтчетНеоплаченныеСчетаПоставщиков = ПравоДоступа("Использование", Метаданные.Отчеты.АнализНеоплаченныхСчетовПоставщиков);

	Если Параметры.Свойство("СтруктураЗаполнения") Тогда
		СтруктураЗаполнения = Параметры.СтруктураЗаполнения;
		ЗаполнитьЗначенияСвойств(Объект, СтруктураЗаполнения);
		Если СтруктураЗаполнения.Свойство("БанковскийСчет") Тогда
			ДанныеБанковскогоСчета = СтруктураЗаполнения.БанковскийСчет;
			Если Не ПустаяСтрока(ДанныеБанковскогоСчета.НомерСчета) Тогда
				ЗаполнитьЗначенияСвойств(БанковскийСчет, ДанныеБанковскогоСчета);
				ИзмененБанковскийСчет = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СтруктураЗаполнения.Свойство("ДанныеМодифицированы") Тогда
			ДанныеМодифицированы = СтруктураЗаполнения.ДанныеМодифицированы;
		КонецЕсли;
	КонецЕсли;
	
	РаботаСМетками.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		ЗаполнитьРеквизитыПоТекстуЗаполнения(Параметры.ТекстЗаполнения);
		// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	ОграничитьВыборРеквизитов(Параметры.ЗначенияЗаполнения);
	
	// Если проверка контрагентов не возможна, то не будем ее и запускать.
	// Это нужно, например, для самозанятых.
	Если ПроверкаКонтрагентовПоИННКППВозможна Тогда
		// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		ПроверкаКонтрагентов.ПриСозданииНаСервереКонтрагент(ЭтотОбъект, Параметры);
		// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами  
	Иначе
		// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		ПроверкаКонтрагентов.ИнициализироватьРеквизитыФормыКонтрагент(ЭтотОбъект);
		// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами  
	КонецЕсли;
	
	#Область УХ_Обработчики
	ПриСозданииНаСервереУХ(Отказ, СтандартнаяОбработка);
	#КонецОбласти
	
	УправлениеПанельюПодсказки.ПриСозданииНаСервере(ЭтотОбъект);
	
	УправлениеФормой(ЭтаФорма);
	
	УстановитьУсловноеОформление();
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.Справочник.Контрагенты",
		"ФормаЭлемента",
		НСтр("ru='Новости: Контрагент'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере

	НастройкиУчетаМСФО.НастроитьФормуОбъектаУчета(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеБП.КомандыЭДО_ФормаЭлементаПриСоздании(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	Если Параметры.Свойство("СтруктураЗаполнения") Тогда
		СтруктураЗаполнения = Параметры.СтруктураЗаполнения;
		ЗаполнитьЗначенияСвойств(Объект, СтруктураЗаполнения);
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	Элементы.Подменю1СПАРКРиски.Видимость = СПАРКРиски.ИспользованиеРазрешено();
	#Вставка
	Попытка
#КонецВставки
	Элементы.ФормаСправочникКонтрагентыВебВерсияСПАРК.Видимость = СПАРКРиски.ИспользованиеРазрешено("ПереходВВебВерсиюСПАРК;");
	#Вставка
	Исключение
	КонецПопытки;
#КонецВставки
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	#Область УХ_НСИ 
	
	Если Метаданные.ОбщиеМодули.Найти("УправлениеФормойНСИСервер") <> Неопределено Тогда
		МодульУправлениеНСИСервер = ОбщегоНазначения.ОбщийМодуль("УправлениеФормойНСИСервер");
		МодульУправлениеНСИСервер.ПриСозданииНаСервереНСИ(ЭтотОбъект,Параметры);
	КонецЕсли;

	#КонецОбласти
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(
			ЭтотОбъект,
			Элементы.ГруппаГлобальныеКоманды);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком() Тогда
		Элементы.ВидРасширеннаяПодсказка.Заголовок =
			НСтр("ru = 'Для самозанятых укажите ""Физическое лицо""'");
	КонецЕсли;
	
	МобильныйКлиентАдаптацияФормы();

КонецПроцедуры

