
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура АЛФ_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.НазначениеПроцесса = Перечисления.НазначенияУниверсальныхПроцессов.ПроцессПодготовкиОтчетности Тогда
		ТекущийОбъект.ТипОбъектаСогласования = Справочники.ДокументыБД.НайтиПоНаименованию("УправлениеПериодомСценария", , , Справочники.ТипыБазДанных.ТекущаяИБ);
	КонецЕсли;
	ЗаписатьПараметрыПроцесса(ТекущийОбъект);
	// Сохраним информацию о первой записи шаблона.
	ЭтоНовыйШаблон = (Не ЗначениеЗаполнено(Объект.Ссылка));
	ПараметрыЗаписи.Вставить("ЭтоНовый", ЭтоНовыйШаблон);

#Удаление
	Если Не ПустаяСтрока(АдресНастроекПроверки) Тогда
		ТекущийОбъект.НастройкиПроверкиКонтрольнойСуммы =
			Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекПроверки), Новый СжатиеДанных(9));
	КонецЕсли;
#КонецУдаления

КонецПроцедуры
