
&НаСервере
Функция ПолучитьОбщийМассивПечатныхФорм()
	Возврат Справочники.Сотрудники.ПолучитьПолныйМассивПечатныхФорм();
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Если Диалог.Выбрать() Тогда
		ИмяФайлыВыгрузки = Диалог.ПолноеИмяФайла + ".zip";
	Иначе
		Возврат;
	КонецЕсли;

	МассивПечатныхФорм = ПолучитьОбщийМассивПечатныхФорм();
	МассивИменФайлов = Новый Массив;
	
	Для Каждого ПечатнаяФорма Из МассивПечатныхФорм Цикл
		ТабДок = Новый ТабличныйДокумент;
		ПечатьДокумента(ТабДок, ПараметрКоманды, ПечатнаяФорма);
		ИмяФайла = КаталогВременныхФайлов() + "/" + СтрЗаменить(ПечатнаяФорма, "ИИТ_", "") + ".xls";
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		МассивИменФайлов.Добавить(ИмяФайла);		
	КонецЦикла;

	ЗаписьZIP = Новый ЗаписьZipФайла(ИмяФайлыВыгрузки);
	Для Каждого ИмяФайла Из МассивИменФайлов Цикл
		ЗаписьZIP.Добавить(ИмяФайла);
	КонецЦикла;
	ЗаписьZIP.Записать();

КонецПроцедуры

&НаСервере
Процедура ПечатьДокумента(ТабДок, ПараметрКоманды, ПечатнаяФорма)
	Выполнить("Справочники.Сотрудники." + ПечатнаяФорма + "(ТабДок, ПараметрКоманды)");
КонецПроцедуры

