
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура АЛФ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если ЭтоГруппа Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидНоменклатуры");
	КонецЕсли;

	Если ЭтоГруппа ИЛИ Услуга Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмерения");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

#Вставка
	Если ЗначениеЗаполнено(Родитель) И Родитель.ИИТ_КатегорияПримененияНоменклатуры = Перечисления.ИИТ_КатегорииПримененияНоменклатуры.БухгалтерскаяНоменклатура Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидНоменклатуры");
	КонецЕсли;
#КонецВставки

КонецПроцедуры

&Перед("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ)

	Если ЗначениеЗаполнено(Родитель) Тогда
		ИИТ_КатегорияПримененияНоменклатуры = Родитель.ИИТ_КатегорияПримененияНоменклатуры;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИИТ_Автор) Тогда
		ИИТ_Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&После("ПередЗаписью")
Процедура АЛФ_ПередЗаписью1(Отказ)

	Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.ИИТ_ВсеОсновныеСредства Тогда
		Сообщить("Вид номенклатуры ""Все основные средства"" нельзя использовать при создании номенклатуры.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&После("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ)

	Если ИИТ_КатегорияПримененияНоменклатуры = Перечисления.ИИТ_КатегорииПримененияНоменклатуры.ТоварСнабжения ИЛИ 
		ИИТ_КатегорияПримененияНоменклатуры = Перечисления.ИИТ_КатегорииПримененияНоменклатуры.Услуга Тогда
		Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИИТ_Оператор") И Не РольДоступна("ИИТ_РедактированиеНоменклатурыСнабжение") Тогда
			Сообщить("Недостаточно прав для создания номенклатуры!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ИИТ_КатегорияПримененияНоменклатуры = Перечисления.ИИТ_КатегорииПримененияНоменклатуры.БухгалтерскаяНоменклатура Тогда
		Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИИТ_Оператор") Тогда
			Сообщить("Недостаточно прав для создания номенклатуры!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Родитель) Тогда
		Сообщить("Необходимо указать родителя данной позиции номенклатуры. Действие отменено.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры



