
&ИзменениеИКонтроль("ЗапрещеноСозданиеДокументаВЗакрытомПериоде")
Функция АЛФ_ЗапрещеноСозданиеДокументаВЗакрытомПериоде(Знач ТипДокументаСтрокой, Знач ДатаДокумента)

#Вставка
	Если ТипДокументаСтрокой = "ПоступлениеТоваровУслуг" Тогда
		Возврат Ложь;
	КонецЕсли;
#КонецВставки
	ПроверяемыйДокумент = Документы[ТипДокументаСтрокой].СоздатьДокумент();
	ПроверяемыйДокумент.Дата = ДатаДокумента;
	РедактированиеЗапрещено = ДатыЗапретаИзменения.ИзменениеЗапрещено(ПроверяемыйДокумент);

	Возврат РедактированиеЗапрещено;

КонецФункции
