
&ИзменениеИКонтроль("ОбработкаПолученияФормы")
Процедура АЛФ_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
#Вставка 
	//ТВН++ Оригинальный код удален
	//Если ВидФормы = "ФормаОбъекта" И НЕ УправлениеДоступомБПВызовСервера.ПравоПросмотраВсехКадровыхДанных() Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ВыбраннаяФорма = "ФормаЭлементаТолькоОбщедоступныеДанные";
	//	Возврат;
	//КонецЕсли;
#КонецВставки
#Удаление
	ФизическиеЛицаЗарплатаКадрыВнутренний.ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
#КонецУдаления
КонецПроцедуры
