
&После("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ)

	//ЗАПИСЬ В ИСТОРИИ РЕЗИДЕНСТВА
	ДатаЗаписи = Дата(1,1,1);
	Если ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.ВНЖ Тогда
		ДатаЗаписи = ВНЖДата;
	ИначеЕсли ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.ЕАЭС Тогда
	ИначеЕсли ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.Патент Тогда
		ДатаЗаписи = ПатентДатаВыдачи;
	ИначеЕсли ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.РВП Тогда
		ДатаЗаписи = РВПДата;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаЗаписи) Тогда

		НоваяЗапись = РегистрыСведений.ИИТ_ИсторияТипаРезиденства.СоздатьМенеджерЗаписи();
		НоваяЗапись.ФизЛицо = Ссылка;
		НоваяЗапись.ТипРезиденства = ИИТ_ТипРезиденства;
		НоваяЗапись.Период = ДатаЗаписи;
		
		Если ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.ВНЖ Тогда
			НоваяЗапись.Серия = ВНЖСерия;
			НоваяЗапись.Номер = ВНЖНомер;
			НоваяЗапись.КемВыдан = ВНЖКемВыдан;
			НоваяЗапись.СрокДействия = ВНЖСрокДействия;
		ИначеЕсли ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.ЕАЭС Тогда
		ИначеЕсли ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.Патент Тогда
			НоваяЗапись.Серия = ПатентСерия;
			НоваяЗапись.Номер = ПатентНомер;
			НоваяЗапись.КемВыдан = ПатентОрганВыдачи;
			НоваяЗапись.СрокДействия = ПатентСрокДействия;
		ИначеЕсли ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.РВП Тогда
			НоваяЗапись.Серия = РВПСерия;
			НоваяЗапись.Номер = РВПНомер;
			НоваяЗапись.КемВыдан = РВПКемВыдан;
			НоваяЗапись.СрокДействия = РВПСрокДействия;
		КонецЕсли;
		НоваяЗапись.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ)
		Если Не ЗначениеЗаполнено(АС_ДатаСоздания) Тогда 		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ВерсииОбъектов.ДатаВерсии) КАК ДатаВерсии
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Объект = &Объект";
		
		Запрос.УстановитьПараметр("Объект", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			АС_ДатаСоздания = ТекущаяДатаСеанса();
		Иначе 			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				АС_ДатаСоздания = ВыборкаДетальныеЗаписи.ДатаВерсии;
			КонецЦикла;			
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
