
#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
Функция ПолучитьКурсВалюты(Валюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Курс), Выборка.Курс, 1);
	Иначе
		Возврат 1;
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьОбъектСтроительстваМОРС(Проект)
	
	ИИТ_ПроектМОРС_ = Справочники.Проекты.ПустаяСсылка();

	Если Проект.Проект Тогда
		ИИТ_ПроектМОРС_ = Проект;
	ИначеЕсли Проект.Родитель.Проект Тогда
		ИИТ_ПроектМОРС_ = Проект.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Проект Тогда
		ИИТ_ПроектМОРС_ = Проект.Родитель.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Родитель.Проект Тогда
		ИИТ_ПроектМОРС_ = Проект.Родитель.Родитель.Родитель;
	КонецЕсли;
	
	Возврат ИИТ_ПроектМОРС_;

КонецФункции

#КонецОбласти

&Перед("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Не ЗначениеЗаполнено(ИИТ_ОбъектСтроительства) Тогда
		Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(СтрокаРасшифровки.Проект) Тогда
				ИИТ_ОбъектСтроительства = СтрокаРасшифровки.Проект;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.ПоступлениеНаРасчетныйСчет.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка     
	Если Контрагент <> Неопределено И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") И Контрагент.ПометкаУдаления Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Контрагент, указанный в документе, помечен на удаление, проведение документа отменено.";
		Сообщение.Сообщить();		
	КонецЕсли;
	#КонецВставки
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	ТаблицаВзаиморасчетов = УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности(
	ПараметрыПроведения.РасшифровкаПлатежа, ПараметрыПроведения.Реквизиты, Отказ);

	ТаблицаВозвратОтПодотчетногоЛицаВВалюте = УчетДенежныхСредств.ПодготовитьТаблицуВозвратОтПодотчетногоЛицаВВалюте(
	ПараметрыПроведения.ВозвратОтПодотчетногоЛицаВВалюте);

	ТаблицаПрочихРасчетов = УчетВзаиморасчетов.ПодготовитьТаблицуПрочихРасчетовОплатаПокупателя(
	ТаблицаВзаиморасчетов, ПараметрыПроведения.Реквизиты);

	ТаблицыРасчетовДляУСН = Документы.ПоступлениеНаРасчетныйСчет.ПодготовитьТаблицыРасчетовДляУСН(
	ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчетов, Отказ);

	ТаблицаВзаиморасчетыУСН            = ТаблицыРасчетовДляУСН.ТаблицаВзаиморасчетыУСН;
	ТаблицаПрочихРасчетовУСН           = ТаблицыРасчетовДляУСН.ТаблицаПрочихРасчетовУСН;
	ТаблицаВозвратыПоВзаиморасчетамУСН = ТаблицыРасчетовДляУСН.ТаблицаВозвратыПоВзаиморасчетамУСН;
	КУДиРПереквалификация              = ТаблицыРасчетовДляУСН.КУДиРПереквалификация;
	КУДиРПатент                        = ТаблицыРасчетовДляУСН.КУДиРПатент;

	ТаблицаВзаиморасчетов = УчетВзаиморасчетов.ОчиститьСуммыСпециальныхРежимовПогашениеЗадолженности(
	ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчетов, Отказ);

	ТаблицаСуммовыхРазниц = УчетНДС.ПодготовитьТаблицуСуммовыхРазниц(ТаблицаВзаиморасчетов,
	ПараметрыПроведения.Реквизиты, Отказ);

	ТаблицаНДСПоРеализациямНеплательщика = УчетУСН.ПодготовитьТаблицуНДСПоРеализацииНеплательщиком(ТаблицаВзаиморасчетыУСН,
	ПараметрыПроведения.Реквизиты);

	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСН = Новый Структура("ТаблицаРасчетов, ТаблицаНДСПродажи, ПокупкаПродажаВалюты, КУДиРПереквалификация, КУДиРПатент",
	ТаблицаВзаиморасчетыУСН, ТаблицаНДСПоРеализациямНеплательщика, ПараметрыПроведения.ПокупкаПродажаВалюты, КУДиРПереквалификация, КУДиРПатент);

	// Разметка операций Автоматизированной УСН
	ТаблицаРазметкиАУСН = РазметкаОперацийАУСН.ПодготовитьТаблицуПоступлениеДенежныхСредств(
	ПараметрыПроведения.РеквизитыАУСН,
	ТаблицаВзаиморасчетыУСН,
	ТаблицаНДСПоРеализациямНеплательщика,
	ПараметрыПроведения.РазметкаАУСНБанка);

	// Учет доходов и расходов ИП
	ТаблицаОплатПокупателяИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуОплатыПокупателя(
	ТаблицаВзаиморасчетов, ПараметрыПроведения.Реквизиты);

	ТаблицыПоступленияОтПродажПоПлатежнымКартамИП =
	УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыПоступленияОтПродажПоПлатежнымКартам(
	ПараметрыПроведения.РасшифровкаПлатежа,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	ТаблицыПоступленияОтФакторинговойКомпанииИП =
	УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыПоступленияОтФакторинговойКомпании(
	ПараметрыПроведения.РасшифровкаПлатежа,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	ТаблицаУслугИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступленияМПЗ(
	ПараметрыПроведения.ПоступлениеМПЗИПТаблицаУслуг,
	ПараметрыПроведения.ПоступлениеМПЗИПРеквизиты);

	СтруктураТаблицМПЗ = Новый Структура("ТаблицаУслуг", ТаблицаУслугИП);

	// соберем таблицу прочих расчетов
	Если ЗначениеЗаполнено(ТаблицаПрочихРасчетовУСН) Тогда
		ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаПрочихРасчетовУСН, ТаблицаПрочихРасчетов);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТаблицыПоступленияОтПродажПоПлатежнымКартамИП.ТаблицаПрочиеРасчеты) Тогда
		ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(
		ТаблицыПоступленияОтПродажПоПлатежнымКартамИП.ТаблицаПрочиеРасчеты, ТаблицаПрочихРасчетов);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТаблицыПоступленияОтФакторинговойКомпанииИП.ТаблицаПрочиеРасчеты) Тогда
		ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(
		ТаблицыПоступленияОтФакторинговойКомпанииИП.ТаблицаПрочиеРасчеты, ТаблицаПрочихРасчетов);
	КонецЕсли;

	Если Не ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		ТаблицаСтатусовСчетов = СтатусыДокументов.ПодготовитьТаблицуСтатусовОплатыСчетов(
		ПараметрыПроведения.ОплатаСчетов, ПараметрыПроведения.Реквизиты);
	КонецЕсли;

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

	УчетВзаиморасчетов.СформироватьДвиженияПоПрочимРасчетам(ТаблицаПрочихРасчетов, Движения, Отказ);

	УчетВзаиморасчетов.СформироватьДвиженияПогашениеЗадолженности(ТаблицаВзаиморасчетов,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетВзаиморасчетов.СформироватьТолькоДвиженияПоСчетамУСНЗачетВозврата(ТаблицаВозвратыПоВзаиморасчетамУСН,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетВзаиморасчетов.СформироватьТолькоДвиженияПоСчетамУСНПогашениеЗадолженности(ТаблицаВзаиморасчетыУСН,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	НачалоПростогоУчета = ЕдиныйНалоговыйСчет.НачалоПростогоУчета();
	Если Дата < НачалоПростогоУчета Тогда
		ЕдиныйНалоговыйСчет.ЗарегистрироватьВозвратНаЕдиныйНалоговыйСчет(ПараметрыПроведения.Реквизиты,
		ПараметрыПроведения.РасшифровкаПлатежаПрочее, Движения, Отказ);
	КонецЕсли;

	УчетДоходовРасходов.СформироватьДвиженияСуммовыеРазницыРасчетыВУЕ(ТаблицаСуммовыхРазниц,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетНДС.СформироватьДвиженияКурсовыеРазницы(ПараметрыПроведения.Реквизиты,
	ТаблицаВзаиморасчетов, Движения, Отказ);

	УчетНДС.СформироватьДвиженияСуммовыеРазницы(ТаблицаСуммовыхРазниц, ПараметрыПроведения.Реквизиты, 
	Движения, Отказ);

	УчетДенежныхСредств.СформироватьДвиженияПродажаВалюты(ПараметрыПроведения.ПродажаВалюты,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДенежныхСредств.СформироватьДвиженияПриобретениеВалюты(ПараметрыПроведения.ПриобретениеВалюты,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДенежныхСредств.СформироватьДвиженияВозвратОтПодотчетногоЛицаВВалюте(
	ТаблицаВозвратОтПодотчетногоЛицаВВалюте, Движения, Отказ);

	#Область УХ_Встраивание
	//УчетДенежныхСредств.СформироватьДвиженияПрочееПоступление(ПараметрыПроведения.РасшифровкаПлатежаПрочее,
	//	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	ДенежныеСредстваВстраиваниеУХ.СформироватьДвиженияПрочееПоступлениеУХ(ПараметрыПроведения.РасшифровкаПлатежаПрочее,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);
	#КонецОбласти

	УчетЗарплаты.СформироватьДвиженияПоВозвратамНалоговИВзносовСФОТ(ПараметрыПроведения.РасшифровкаПлатежаПрочее,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УставныйКапитал.СформироватьДвиженияВзносВУставныйКапитал(ПараметрыПроведения.ВзносВУставныйКапитал,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);

	РазметкаОперацийАУСН.СформироватьДвиженияРазметки(ПараметрыПроведения.РеквизитыАУСН,
	ТаблицаРазметкиАУСН, Движения);

	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияОплатаПокупателя(
	ТаблицаОплатПокупателяИП,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияЗачетОплатыПокупателя(
	ТаблицыПоступленияОтПродажПоПлатежнымКартамИП.ТаблицаИПМПЗОтгруженные,
	ТаблицыПоступленияОтПродажПоПлатежнымКартамИП.ТаблицаВзаиморасчеты, 
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияЗачетОплатыПокупателя(
	ТаблицыПоступленияОтФакторинговойКомпанииИП.ТаблицаИПМПЗОтгруженные,
	ТаблицыПоступленияОтФакторинговойКомпанииИП.ТаблицаВзаиморасчеты, 
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПоступлениеМПЗ(
	СтруктураТаблицМПЗ,
	ПараметрыПроведения.ПоступлениеМПЗИПТаблицаВзаиморасчетов,,
	ПараметрыПроведения.ПоступлениеМПЗИПРеквизиты, Движения, Отказ);

	// Переоценка валютных остатков - после формирования проводок всеми другими механизмами
	ТаблицаПереоценка = УчетДоходовРасходов.ПодготовитьТаблицуПереоценкиДвиженийДокумента(
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовРасходов.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовРасходов.СформироватьДвиженияРасчетПереоценкиВалютныхСредств(ТаблицаПереоценка,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетУСН.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	СтатусыДокументов.СформироватьДвиженияОплатаСчетов(
	ПараметрыПроведения.ОплатаСчетов, ПараметрыПроведения.Реквизиты, Движения, Отказ);

	Если Не ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		СтатусыДокументов.СформироватьДвиженияСтатусовДокументов(
		ТаблицаСтатусовСчетов, ПараметрыПроведения.Реквизиты);

		ТаблицаЗадачОплатыУставногоКапитала = ВыполнениеЗадачБухгалтера.ЗадачиПоОплатеУставногоКапитала(Организация);
		Если ТаблицаЗадачОплатыУставногоКапитала.Количество() > 0 Тогда 
			СтатусОплатыУставногоКапитала = УставныйКапитал.СтатусОплатыУставногоКапиталаПоДаннымДокумента(
			ПараметрыПроведения.ВзносВУставныйКапитал,
			ПараметрыПроведения.Реквизиты);

			ВыполнениеЗадачБухгалтера.ОбновитьСтатусОплатыУставногоКапитала(
			ТаблицаЗадачОплатыУставногоКапитала, СтатусОплатыУставногоКапитала);
		КонецЕсли;
	КонецЕсли;

	// Отложенные расчеты с контрагентами.
	УчетВзаиморасчетовОтложенноеПроведение.ЗарегистрироватьОтложенныеРасчетыСКонтрагентами(
	ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);

	// Регистрация в последовательности
	РаботаСПоследовательностями.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
	ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);

	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
	#Вставка
	Если ВалютаДокумента.Код <> "643" Тогда
		Курс = ПолучитьКурсВалюты(ВалютаДокумента);
	Иначе
		Курс = 1;
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() > 0 Тогда
		
		Для Каждого СтрокаРасшифровки ИЗ РасшифровкаПлатежа Цикл
			Движение = Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.БанковскийСчет = СчетОрганизации;
			Движение.ЭтапСтроительства = СтрокаРасшифровки.Проект;
			Если ЗначениеЗаполнено(СтрокаРасшифровки.Проект) Тогда
				Движение.ОбъектСтроительства = ПолучитьОбъектСтроительстваМОРС(СтрокаРасшифровки.Проект);
			Иначе
				Движение.ОбъектСтроительства = ПолучитьОбъектСтроительстваМОРС(Проект);
			КонецЕсли;
			Движение.Сумма = СтрокаРасшифровки.СуммаПлатежа * Курс;
			Движение.СуммаБДДС = СтрокаРасшифровки.СуммаПлатежа * Курс;
			Движение.СтатьяДДС = ?(ЗначениеЗаполнено(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств), СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств, СтатьяДвиженияДенежныхСредств);
			Если Движение.СтатьяДДС.Депозит Тогда
				Движение.Депозит = -СтрокаРасшифровки.СуммаПлатежа * Курс;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Движение = Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.БанковскийСчет = СчетОрганизации;
		Движение.ЭтапСтроительства = Проект;
		Движение.ОбъектСтроительства = ПолучитьОбъектСтроительстваМОРС(Проект);
		Движение.Сумма = СуммаДокумента * Курс;
		Движение.СуммаБДДС = СуммаДокумента;
		Движение.СтатьяДДС = СтатьяДвиженияДенежныхСредств;
		Если Движение.СтатьяДДС.Депозит Тогда
			Движение.Депозит = -СуммаДокумента * Курс;
		КонецЕсли;
		
	КонецЕсли;
	
	Движения.ИИТ_ДенежныеСредстваОбъектовСтроительства.Записать();
	#КонецВставки
КонецПроцедуры

