
&ИзменениеИКонтроль("ЗаполнитьВКоллекции")
Процедура АЛФ_ЗаполнитьВКоллекции(Коллекция, ИменаПолей, ДополнитьКлюч, ПараметрыЗаполнения)
	УстановитьПривилегированныйРежим(Истина);

	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = ПараметрыЗаполненияКлючейАналитики();
	КонецЕсли;

	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Организация,
	Метаданные.Справочники.КлючиАналитикиПланированияРасчетовСКонтрагентами.Реквизиты.Организация.Тип);

	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Контрагент, 
	Метаданные.Справочники.КлючиАналитикиПланированияРасчетовСКонтрагентами.Реквизиты.Контрагент.Тип);

	Если ИменаПолей = Неопределено Тогда
		ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
	КонецЕсли;
	Запрос = Новый Запрос(ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей));
	Запрос.УстановитьПараметр("ПустаяОрганизация",        КэшируемыеПроцедурыОПК.ПустаяОрганизация());
	Запрос.УстановитьПараметр("ПустойКонтрагент",         КэшируемыеПроцедурыОПК.ПустойКонтрагент());
	Запрос.УстановитьПараметр("ПустойДоговорКонтрагента", КэшируемыеПроцедурыОПК.ПустойДоговор());
	Запрос.УстановитьПараметр("Коллекция", Коллекция);

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

#Вставка
	//+ИИТ_Аксеньюшкин
	КоллекцияИспр = Коллекция.Скопировать();
	КоллекцияИспр.Колонки.Удалить("Контрагент");
	КоллекцияИспр.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		НоваяСтрока = КоллекцияИспр.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
	КонецЦикла;
	Запрос.УстановитьПараметр("Коллекция", КоллекцияИспр);
	//-ИИТ_Аксеньюшкин
#КонецВставки
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.АналитикаПланированияРасчетовСКонтрагентами) Тогда
			Если ПараметрыЗаполнения.СоздаватьВКлючи Тогда
				Если ЗначениеЗаполнено(Выборка.Организация) ИЛИ ЗначениеЗаполнено(Выборка.Контрагент) ИЛИ ЗначениеЗаполнено(Выборка.Договор) Тогда
					КлючАналитики = ЗначениеКлючаАналитики(Выборка);
				Иначе
					КлючАналитики = Справочники.КлючиАналитикиПланированияРасчетовСКонтрагентами.ПустаяСсылка();
				КонецЕсли;
			Иначе
				ТекстИсключения = НСтр("ru = 'Ошибка при заполнении ключей в коллекции: есть аналитики, по которым ключи еще не созданы.'");
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.КлючиАналитикиПланированияРасчетовСКонтрагентами,
				,
				ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Иначе
			КлючАналитики = Выборка.АналитикаПланированияРасчетовСКонтрагентами;
		КонецЕсли;
		ПараметрыЗаполнения.ИзмененаАналитика = Истина;
		Если НЕ ПараметрыЗаполнения.ЗаполнятьКлючВКоллекции Тогда
			Продолжить;
		КонецЕсли;

		Коллекция[Выборка.Индекс][ИменаПолей.АналитикаПланированияРасчетовСКонтрагентами] = КлючАналитики;

	КонецЦикла;
КонецПроцедуры
