
&ИзменениеИКонтроль("ФизическиеЛицаПередЗаписью")
Процедура АЛФ_ФизическиеЛицаПередЗаписью(Форма, Отказ, ПараметрыЗаписи, ОповещениеЗавершения, ЗакрытьПослеЗаписи)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", ЗакрытьПослеЗаписи);

	Если Не Форма.СозданиеНового И Не Отказ Тогда
		// запрос про гражданство
#Вставка		
		Попытка
#КонецВставки
		Оповещение = Новый ОписаниеОповещения("ФизическиеЛицаПередЗаписьюФИО", ЭтотОбъект, ДополнительныеПараметры);
		СотрудникиКлиент.ЗапроситьРежимИзмененияГражданства(Форма, Форма.ГражданствоФизическихЛиц.Период, Отказ, Оповещение);
#Вставка
		Исключение
			ФизическиеЛицаПередЗаписьюФИО(Отказ, ДополнительныеПараметры);
		КонецПопытки;
#КонецВставки
	Иначе 
		ФизическиеЛицаПередЗаписьюФИО(Отказ, ДополнительныеПараметры);
	КонецЕсли; 

КонецПроцедуры

&ИзменениеИКонтроль("ФизическиеЛицаПередЗаписьюУдостоверениеЛичности")
Процедура АЛФ_ФизическиеЛицаПередЗаписьюУдостоверениеЛичности(Результат, ДополнительныеПараметры)

	Отказ = (Результат = Неопределено);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Форма = ДополнительныеПараметры.Форма;

	// Запрос про документ удостоверяющий личность.
#Вставка
	Попытка
#КонецВставки
	Оповещение = Новый ОписаниеОповещения("ФизическиеЛицаПередЗаписьюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СотрудникиКлиент.ЗапроситьРежимИзмененияУдостоверенияЛичности(Форма, Форма.ДокументыФизическихЛиц.Период, Отказ, Оповещение);	
#Вставка
	Исключение
		ФизическиеЛицаПередЗаписьюЗавершение(Ложь, ДополнительныеПараметры);
	КонецПопытки;
#КонецВставки

КонецПроцедуры
