
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)   
	
	//Переопределение запроса
	ТекстЗапроса = 	"ВЫБРАТЬ
	               	|	ДокументПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ПометкаУдаления КАК ПометкаУдаления,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Номер КАК Номер,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Дата КАК Дата,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Проведен КАК Проведен,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Организация КАК Организация,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ВидОперации КАК ВидОперации,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетОрганизации КАК СчетОрганизации,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетБанк КАК СчетБанк,
	               	|	ДокументПоступлениеНаРасчетныйСчет.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Контрагент КАК Контрагент,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетКонтрагента КАК СчетКонтрагента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Патент КАК Патент,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СуммаДокумента КАК СуммаДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СубконтоКт1 КАК СубконтоКт1,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СубконтоКт2 КАК СубконтоКт2,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СубконтоКт3 КАК СубконтоКт3,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ПодразделениеКт КАК ПодразделениеКт,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СуммаУслуг КАК СуммаУслуг,
	               	|	ДокументПоступлениеНаРасчетныйСчет.КурсНаДатуПриобретенияРеализацииВалюты КАК КурсНаДатуПриобретенияРеализацииВалюты,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ОтражатьРазницуВКурсеВСоставеОперационныхРасходов КАК ОтражатьРазницуВКурсеВСоставеОперационныхРасходов,
	               	|	ДокументПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Ответственный КАК Ответственный,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Комментарий КАК Комментарий,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ВалютаДокумента КАК ВалютаДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДокументОснование КАК ДокументОснование,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Содержание_УСН КАК Содержание_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа4_УСН КАК Графа4_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа5_УСН КАК Графа5_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа6_УСН КАК Графа6_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа7_УСН КАК Графа7_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДоходыЕНВД_УСН КАК ДоходыЕНВД_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.НДС_УСН КАК НДС_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.РучнаяКорректировка КАК РучнаяКорректировка,
	               	|	ВЫБОР
	               	|		КОГДА ДокументПоступлениеНаРасчетныйСчет.РучнаяКорректировка = ИСТИНА
	               	|			ТОГДА ВЫБОР
	               	|					КОГДА ДокументПоступлениеНаРасчетныйСчет.ПометкаУдаления = ИСТИНА
	               	|						ТОГДА 10
	               	|					КОГДА ДокументПоступлениеНаРасчетныйСчет.Проведен = ЛОЖЬ
	               	|						ТОГДА 9
	               	|					ИНАЧЕ 8
	               	|				КОНЕЦ
	               	|		ИНАЧЕ ВЫБОР
	               	|				КОГДА ДокументПоступлениеНаРасчетныйСчет.ПометкаУдаления = ИСТИНА
	               	|					ТОГДА 2
	               	|				КОГДА ДокументПоступлениеНаРасчетныйСчет.Проведен = ИСТИНА
	               	|					ТОГДА 1
	               	|				ИНАЧЕ 0
	               	|			КОНЕЦ
	               	|	КОНЕЦ КАК СостояниеДокумента,
	               	|	ВЫБОР
	               	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	               	|			ТОГДА 1
	               	|		КОГДА НаличиеФайлов.ЕстьФайлы
	               	|			ТОГДА 0
	               	|		ИНАЧЕ 1
	               	|	КОНЕЦ КАК ЕстьФайлы,
	               	|	ЧекиНПД.НомерЧека КАК НомерЧека,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ИИТ_ОбъектСтроительства КАК ИИТ_ОбъектСтроительства,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ИИТ_ЭтапСтроительства КАК ИИТ_ЭтапСтроительства
	               	|ИЗ
	               	|	Документ.ПоступлениеНаРасчетныйСчет КАК ДокументПоступлениеНаРасчетныйСчет
	               	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	               	|		ПО ДокументПоступлениеНаРасчетныйСчет.Ссылка = НаличиеФайлов.ОбъектСФайлами}
	               	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧекиНПД КАК ЧекиНПД
	               	|		ПО (ЧекиНПД.ДокументОснование = ДокументПоступлениеНаРасчетныйСчет.Ссылка)
	               	|			И (ЧекиНПД.Организация = ДокументПоступлениеНаРасчетныйСчет.Организация)}";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Документ.ПоступлениеНаРасчетныйСчет";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);   
		
	//Колонки в ТЧ
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Объект строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ОбъектСтроительства";
	
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ЭтапСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Этап строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ЭтапСтроительства";

КонецПроцедуры
