
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Группа_АЛФ = Элементы.Вставить("ИИТ_ГруппаПриходРасходВнОбороты", Тип("ГруппаФормы"), Элементы.ГруппаУХ, Элементы.ГруппаОчередностьПлатежа);
	Группа_АЛФ.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	Группа_АЛФ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_АЛФ.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_АЛФ.ОтображатьЗаголовок = Ложь;    
	
	ЭтаФорма.Элементы.Переместить(Элементы.ПриходРасход, Элементы.ИИТ_ГруппаПриходРасходВнОбороты);
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользованиеДляВнутреннихОборотов1", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Вн. движение";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ИспользованиеДляВнутреннихОборотов";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ПолеВвода_АЛФ = Элементы.Добавить("Депозит", Тип("ПолеФормы"), );
	ПолеВвода_АЛФ.Заголовок = "Депозит";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.Депозит";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьТипПлатежа", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Вн. движение";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ИспользоватьТипПлатежа";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
КонецПроцедуры
