#Область Перенос_доработок

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция НаименованиеФайла(Заявка, Индекс)
	Возврат Заявка.Номер + " " + Формат(Заявка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0") + " " + ?(ЗначениеЗаполнено(Индекс), Строка(Индекс), "");
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПолучитьДанныеДляОповещения()
	
	МассивРезультат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрСведенийОповещенияПользователей.Тема КАК Тема,
	|	РегистрСведенийОповещенияПользователей.Задача.СвязанныйОбъект КАК Ссылка
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК РегистрСведенийОповещенияПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних
	|		ПО РегистрСведенийОповещенияПользователей.Задача = ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача
	|			И (РегистрСведенийОповещенияПользователей.Задача <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка))
	|			И РегистрСведенийОповещенияПользователей.Пользователь = ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Ответственный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение
	|		ПО РегистрСведенийОповещенияПользователей.Задача = ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Задача
	|			И (РегистрСведенийОповещенияПользователей.Задача <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка))
	|			И (ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Ответственный В (&Замещаемые))
	|ГДЕ
	|	РегистрСведенийОповещенияПользователей.Пользователь = &Ответственный
	|	И РегистрСведенийОповещенияПользователей.Задача.СвязанныйОбъект.Организация.Наименование <> ""ТЕСТ ОРГ""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ИИТ_УведомленияОВозвратеСогласования.Заявка ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|				ИЛИ ИИТ_УведомленияОВозвратеСогласования.Заявка ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ИИТ_УведомленияОВозвратеСогласования.Пояснение, 1, 100) = """"
	|						ТОГДА ""Возврат заявки автору""
	|					ИНАЧЕ ИИТ_УведомленияОВозвратеСогласования.Пояснение
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИИТ_УведомленияОВозвратеСогласования.Заявка ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|					ТОГДА ПОДСТРОКА(ИИТ_УведомленияОВозвратеСогласования.Пояснение, 1, 100)
	|				ИНАЧЕ ""Согласуйте получение денежных средств""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ИИТ_УведомленияОВозвратеСогласования.Заявка
	|ИЗ
	|	РегистрСведений.ИИТ_УведомленияОВозвратеСогласования КАК ИИТ_УведомленияОВозвратеСогласования
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИИТ_УведомленияОВозвратеСогласования.Заявка КАК Заявка,
	|			МАКСИМУМ(ИсторияВыполненияПроцессов.Период) КАК Период
	|		ИЗ
	|			РегистрСведений.ИИТ_УведомленияОВозвратеСогласования КАК ИИТ_УведомленияОВозвратеСогласования
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияВыполненияПроцессов КАК ИсторияВыполненияПроцессов
	|				ПО ИИТ_УведомленияОВозвратеСогласования.Заявка = ИсторияВыполненияПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ИИТ_УведомленияОВозвратеСогласования.Заявка) КАК ЗаявкаДатаПоследнегоСообщения
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияВыполненияПроцессов КАК ИсторияВыполненияПроцессов
	|			ПО ЗаявкаДатаПоследнегоСообщения.Заявка = ИсторияВыполненияПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса
	|				И ЗаявкаДатаПоследнегоСообщения.Период = ИсторияВыполненияПроцессов.Период
	|		ПО ИИТ_УведомленияОВозвратеСогласования.Заявка = ЗаявкаДатаПоследнегоСообщения.Заявка
	|ГДЕ
	|	ИИТ_УведомленияОВозвратеСогласования.Ответственный = &Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИИТ_УведомленияПоПоступлениям.СодержаниеУведомления,
	|	ИИТ_УведомленияПоПоступлениям.ДокументПоступления
	|ИЗ
	|	РегистрСведений.ИИТ_УведомленияПоПоступлениям КАК ИИТ_УведомленияПоПоступлениям
	|ГДЕ
	|	НЕ ИИТ_УведомленияПоПоступлениям.Выполнена
	|	И ИИТ_УведомленияПоПоступлениям.ДокументПоступления.ИИТ_СнабженецУведомление = &Ответственный";
	Запрос.УстановитьПараметр("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Замещаемые", Новый Массив);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивРезультат.Добавить(Новый Структура("Текст,Ссылка", Выборка.Тема, Выборка.Ссылка));
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьМассивЗадач(МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача КАК Задача
	|ИЗ
	|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних(
	|			,
	|			Выполнено = ЛОЖЬ
	|				И ДокументПроцесса.КлючевойОбъектПроцесса В (&МассивДокументов)) КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних";
	Запрос.УстановитьПараметр("МассивДокументов", МассивСсылок);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Задача");
	
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервере
Функция ПолучитьМассивФайлов(ЗаявкаСсылка)
	
	МассивВладельцев = Новый Массив;
	МассивВладельцев.Добавить(ЗаявкаСсылка);
	Если ТипЗнч(ЗаявкаСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		МассивВладельцев.Добавить(ЗаявкаСсылка.ИИТ_ЗаявкаНаЗакуп);
		Для Каждого СтрокаТоваров Из ЗаявкаСсылка.Товары Цикл
			МассивВладельцев.Добавить(ЗаявкаСсылка.ИИТ_ЗаявкаНаЗакуп);
		КонецЦикла;
	КонецЕсли;
	Если ТипЗнч(ЗаявкаСсылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		МассивВладельцев.Добавить(ЗаявкаСсылка.ИИТ_ЗаказПоставщику);
		Для Каждого СтрокаТоваров Из ЗаявкаСсылка.ИИТ_ЗаказПоставщику.Товары Цикл
			МассивВладельцев.Добавить(СтрокаТоваров.ИИТ_ЗаявкаНаЗакуп);
		КонецЦикла;
	КонецЕсли;
	Если ТипЗнч(ЗаявкаСсылка) = Тип("ДокументСсылка.ИИТ_ТТН") Тогда
		МассивВладельцев.Добавить(ЗаявкаСсылка.ОснованиеЗаполнения);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
	|			ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
	|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
	|	КОНЕЦ КАК ИндексКартинки,
	|	Файлы.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
	|	Файлы.Автор КАК Автор,
	|	Файлы.ДатаСоздания КАК ДатаСоздания,
	|	Файлы.Изменил КАК Отредактировал,
	|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
	|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
	|	Файлы.ПодписанЭП КАК ПодписанЭП,
	|	Файлы.Зашифрован КАК Зашифрован,
	|	ВЫБОР
	|		КОГДА Файлы.ПодписанЭП
	|				И Файлы.Зашифрован
	|			ТОГДА 2
	|		КОГДА Файлы.Зашифрован
	|			ТОГДА 1
	|		КОГДА Файлы.ПодписанЭП
	|			ТОГДА 0
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируется,
	|	ВЫБОР
	|		КОГДА Файлы.Редактирует = &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируетТекущийПользователь,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|				И Файлы.Редактирует <> &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируетДругойПользователь,
	|	Файлы.Расширение КАК Расширение,
	|	ВЫБОР
	|		КОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись <> НЕОПРЕДЕЛЕНО
	|				И Файлы.Редактирует = НЕОПРЕДЕЛЕНО
	|			ТОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись
	|		ИНАЧЕ Файлы.Редактирует
	|	КОНЕЦ КАК Редактирует,
	|	Файлы.Редактирует КАК РедактируетПользователь,
	|	Файлы.ЭтоГруппа КАК ЭтоГруппа,
	|	ЛОЖЬ КАК Служебный,
	|	Файлы.ВладелецФайла КАК ВладелецФайла,
	|	Файлы.ХранитьВерсии КАК ХранитьВерсии
	|ИЗ
	|	Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСинхронизацииФайловСОблачнымСервисом КАК СтатусыСинхронизацииФайловСОблачнымСервисом
	|		ПО Файлы.Ссылка = СтатусыСинхронизацииФайловСОблачнымСервисом.Файл
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивВладельцев)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Файлы.Ссылка,
	|	Файлы.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
	|			ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
	|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
	|	КОНЕЦ,
	|	Файлы.Наименование,
	|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)),
	|	Файлы.Автор,
	|	Файлы.ДатаСоздания,
	|	Файлы.Изменил,
	|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени),
	|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)),
	|	Файлы.ПодписанЭП,
	|	Файлы.Зашифрован,
	|	ВЫБОР
	|		КОГДА Файлы.ПодписанЭП
	|				И Файлы.Зашифрован
	|			ТОГДА 2
	|		КОГДА Файлы.Зашифрован
	|			ТОГДА 1
	|		КОГДА Файлы.ПодписанЭП
	|			ТОГДА 0
	|		ИНАЧЕ -1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Файлы.Редактирует = &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|				И Файлы.Редактирует <> &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Файлы.Расширение,
	|	ВЫБОР
	|		КОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись <> НЕОПРЕДЕЛЕНО
	|				И Файлы.Редактирует = НЕОПРЕДЕЛЕНО
	|			ТОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись
	|		ИНАЧЕ Файлы.Редактирует
	|	КОНЕЦ,
	|	Файлы.Редактирует,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Файлы.ВладелецФайла,
	|	Файлы.ХранитьВерсии
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСинхронизацииФайловСОблачнымСервисом КАК СтатусыСинхронизацииФайловСОблачнымСервисом
	|		ПО Файлы.Ссылка = СтатусыСинхронизацииФайловСОблачнымСервисом.Файл
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивВладельцев)";
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("СекундДоМестногоВремени", 1800);
	МассивПустыхПользователей = Новый Массив;
	МассивПустыхПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустыеПользователи", МассивПустыхПользователей);
	Запрос.УстановитьПараметр("МассивВладельцев", МассивВладельцев);

	ТЗФайлы = Запрос.Выполнить().Выгрузить();

	Возврат ТЗФайлы.ВыгрузитьКолонку("Ссылка");

КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьСтруктуруСсылок(МассивСсылок)
	
	СтруктураСсылок = Новый Структура;
	СтруктураСсылок.Вставить("АдресТаблицыЗадач", "");
	СтруктураСсылок.Вставить("ЗадачиНеВыполнены", Истина);
	СтруктураСсылок.Вставить("ЗадачиРазнородные", Ложь);

	СписокСсылок = Новый СписокЗначений;
	СписокСсылок.ЗагрузитьЗначения(МассивСсылок);
	СтруктураСсылок.Вставить("СписокСсылок", СписокСсылок);

	СписокЗадач = Новый СписокЗначений;
	МассивЗадач = ПолучитьМассивЗадач(МассивСсылок);
	СписокЗадач.ЗагрузитьЗначения(МассивЗадач);
	СтруктураСсылок.Вставить("СписокЗадач", СписокЗадач);
	
	СтруктураСсылок.Вставить("СписокЗамещаемых", Новый СписокЗначений);

	СтруктураСсылок.Вставить("ТипЗадачи", Справочники.ВидыСобытийОповещений.ТребуетсяСогласование);
	СтруктураСсылок.Вставить("ТребуетсяВыполнение", Истина);
	СтруктураСсылок.Вставить("ЭтоДопСогласование", Ложь);
	
	Возврат СтруктураСсылок;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьтипДокумента(ДокСсылка)
	Возврат Строка(ТипЗнч(ДокСсылка));
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПомеченНаУдаление(ФайлСсылка)
	Возврат ФайлСсылка.ПометкаУдаления;
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция РасширениеФайла(ФайлСсылка)
	Возврат ФайлСсылка.Расширение;
КонецФункции

//ИИТ_Аксеньюшкин
Процедура ВыполнитьОтборСпискаПоступлений()

	ИИТ_Поступления.Параметры.УстановитьЗначениеПараметра("Пользователь", ?(ИИТ_ИспользоватьОтборПоОтветственным, ИИТ_ОтборПоОтветственным, Справочники.Пользователи.ПустаяСсылка()));
	ИИТ_Поступления.Параметры.УстановитьЗначениеПараметра("Контрагент", ?(ИИТ_ИспользоватьОтборПоПоставщикам, ИИТ_ОтборПоПоставщикам, Справочники.Контрагенты.ПустаяСсылка()));
	ИИТ_Поступления.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	ИИТ_Поступления.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончания);
	Элементы.ИИТ_Поступления.Обновить();

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ВыполнитьОтборСпискаПоступлений();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ВыполнитьОтборСпискаПоступлений();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_АвансовыеОтчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ИИТ_АвансовыеОтчеты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка(ТекДанные.ОбъектСистемы) = "Авансовый отчет" Тогда
		Форма = ПолучитьФорму("Документ.АвансовыйОтчет.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
		Форма.Открыть();
	ИначеЕсли Строка(ТекДанные.ОбъектСистемы) = "Заявка на закуп" Тогда
		Форма = ПолучитьФорму("Документ.ИИТ_ЗаявкаНаЗакуп.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
		Форма.Открыть();
	Иначе
		Если ТекДанные.Описание = "Согласуйте получение денежных средств" Тогда
			ОткрытьФорму("Документ.ИИТ_ПеремещениеДенежныхСредствПодотчетныхЛиц.Форма.ФормаДокумента", Новый Структура("Ключ,ОткрытьДляСогласования", ТекДанные.Ссылка, Истина));
		Иначе 
			ОткрытьФорму("Документ.ИИТ_ПеремещениеДенежныхСредствПодотчетныхЛиц.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
			УдалитьОповещениеОбАО(ТекДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ВыборкаПериода(Команда)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	СтандартныйПериод = Новый СтандартныйПериод;
	СтандартныйПериод.ДатаНачала = ДатаНачала;
	СтандартныйПериод.ДатаОкончания = ДатаОкончания;
	
	Диалог.Период = СтандартныйПериод;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериода", ЭтаФорма);	
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ЗаявкиНаЗакупВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элементы.ИИТ_ЗаявкиНаЗакуп.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Документ.ИИТ_ЗаявкаНаЗакуп.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
	Форма.Открыть();

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборПоОтветственнымПриИзменении(Элемент)
	ВыполнитьОтборСпискаПоступлений();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоОтветственнымПриИзменении(Элемент)
	ИИТ_ИспользоватьОтборПоОтветственным = Истина;
	ВыполнитьОтборСпискаПоступлений();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоОбъектуЗаявкиПриИзменении(Элемент)
	
	МассивЭлементыОтбораКУдалению = Новый Массив;
	Для Каждого ЭлементОтбора Из ЭтаФорма.ЗаявкиНаОперацию.Отбор.Элементы Цикл
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Проект" Тогда
			МассивЭлементыОтбораКУдалению.Добавить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементКУдалению Из МассивЭлементыОтбораКУдалению Цикл
		ЭтаФорма.ЗаявкиНаОперацию.Отбор.Элементы.Удалить(ЭлементКУдалению);
	КонецЦикла;

	Если ЗначениеЗаполнено(ИИТ_ОтборПоОбъектуЗаявки) Тогда
		Отбор = ЭтаФорма.ЗаявкиНаОперацию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		Отбор.ПравоеЗначение = ИИТ_ОтборПоОбъектуЗаявки;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
		Отбор.Использование = Истина;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборПоПоставщикамПриИзменении(Элемент)
	ВыполнитьОтборСпискаПоступлений();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоПоставщикамПриИзменении(Элемент)
	ИИТ_ИспользоватьОтборПоПоставщикам = Истина;
	ВыполнитьОтборСпискаПоступлений();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ПеремещенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ИИТ_Перемещения.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.Содержание = "Согласовать поступление ТМЦ" Тогда
			СтруктураПараметров = Новый Структура("Ключ,Принятие", ТекСтрока.Документ, Истина);
		Иначе
			СтруктураПараметров = Новый Структура("Ключ,Расхождение", ТекСтрока.Документ, Истина);
		КонецЕсли;
		Форма = ПолучитьФорму("Документ.ПеремещениеТоваров.Форма.ФормаДокумента", СтруктураПараметров);
		Форма.Открыть();
		УдалитьУведомленияПоПеремещению(ТекСтрока.Документ);
	КонецЕсли;
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекСтрока = Элементы.ИИТ_Поступления.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Форма = ПолучитьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары", Новый Структура("Ключ,ОткрытьКакЗадачу", ТекСтрока.ДокументПоступления, Истина));		
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ИИТ_СкачатьАрхив(Команда)
	
	Попытка
		ВыделенныеСтрокиТаблицы = Элементы.ЗаявкаНаРасходованиеДенежныхСредств.ВыделенныеСтроки;
	Исключение
		Возврат;
	КонецПопытки;

	Если ВыделенныеСтрокиТаблицы.Количество() = 0 Тогда
		Возврат;
	Иначе
		Заявка = ВыделенныеСтрокиТаблицы[0].Задача.СвязанныйОбъект;
	КонецЕсли;

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяАрхива = ДиалогВыбора.Каталог + "\Заявка на оплату №" + Заявка.Номер + " от " + Формат(Заявка.Дата, "ДФ=dd.MM.yyyy") + " сумма "
		+ Формат(Заявка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0") + "_" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	МассивФайлов = ПолучитьМассивФайлов(Заявка);
	МассивИменФайлов = Новый Массив;
	
	Н = 1;
	
	Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		
		Если ПомеченНаУдаление(ПрисоединенныйФайл) Тогда
			Продолжить;
		КонецЕсли;

		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(ПрисоединенныйФайл,, Новый УникальныйИдентификатор);
		ПутьКФайлу = КаталогВременныхФайлов() + НаименованиеФайла(Заявка, ?(МассивФайлов.Количество() = 1, 0, Н)) + "." + РасширениеФайла(ПрисоединенныйФайл);
		АдресФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		
		ПередаваемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(ПутьКФайлу, АдресФайла);
		ПередаваемыеФайлы.Добавить(Описание);
		
		// Сохраним Файл из БД на диск.
		Если ПолучитьФайлы(ПередаваемыеФайлы,, КаталогВременныхФайлов(), Ложь) Тогда
			Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
				УдалитьИзВременногоХранилища(АдресФайла);
			КонецЕсли;
		КонецЕсли;
		
		//РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, Неопределено);
		МассивИменФайлов.Добавить(ПутьКФайлу);
		
		Н = Н + 1;

	КонецЦикла;

	ЗаписьZIP = Новый ЗаписьZipФайла(ИмяАрхива);
	Для Каждого ИмяФайла Из МассивИменФайлов Цикл
		ЗаписьZIP.Добавить(ИмяФайла);
	КонецЦикла;
	ЗаписьZIP.Записать();

КонецПроцедуры

&НаСервере
Процедура ИИТ_СкачатьАрхивНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_Удалить(Команда)

	Для Каждого ВыделеннаяСтрока Из Элементы.ТекущиеОповещенияСписок.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ТекущиеОповещенияСписок.ДанныеСтроки(ВыделеннаяСтрока);
		ИИТ_УдалитьНаСервере(ДанныеСтроки.Ссылка, ДанныеСтроки.Пользователь);
	КонецЦикла;
	
	Элементы.ТекущиеОповещенияСписок.Обновить();

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_УдалитьНаСервере(Заявка, Ответственный)

	НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НаборЗаписей.Отбор.Ответственный.Установить(Ответственный);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОбработкаВыбораПериода(Период, Параметры) Экспорт
	
	Если Период <> Неопределено Тогда
		ДатаНачала = Период.ДатаНачала;
		ДатаОкончания = Период.ДатаОкончания;
	КонецЕсли;
	
	ВыполнитьОтборСпискаПоступлений();

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ОтобразитьУведомленияПоАвансовымОтчетам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИИТ_АвансовыеОтчеты.ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	КолвоЗаписейАО = Запрос.Выполнить().Выгрузить().Количество();
	Элементы.ИИТ_ГрАвансовыеОтчеты.Видимость = (КолвоЗаписейАО > 0);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ОтобразитьУведомленияПоЗаявкамНаЗакуп()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИИТ_ЗаявкиНаЗакуп.ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	КолвоЗаписейЗЗ = Запрос.Выполнить().Выгрузить().Количество();
	Элементы.ИИТ_ГрЗаявкиНаЗакуп.Видимость = (КолвоЗаписейЗЗ > 0);
	
	Если КолвоЗаписейЗЗ > 0 Тогда
		ИмяТекущейТаблицы = "ИИТ_ЗаявкиНаЗакуп";
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ОтобразитьУведомленияПоПоПеремещениям()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_УведомленияПоПеремещениям.ДокументПеремещения КАК Документ,
	|	ИИТ_УведомленияПоПеремещениям.СодержаниеУведомления КАК Содержание,
	|	ИИТ_УведомленияПоПеремещениям.ДатаПостановкиЗадачи КАК Дата,
	|	ИИТ_УведомленияПоПеремещениям.ДокументПеремещения.ОбъектОтправитель КАК ОбъектОтправитель,
	|	ИИТ_УведомленияПоПеремещениям.ДокументПеремещения.ОбъектПолучатель КАК ОбъектПолучатель
	|ИЗ
	|	РегистрСведений.ИИТ_УведомленияПоПеремещениям КАК ИИТ_УведомленияПоПеремещениям
	|ГДЕ
	|	ИИТ_УведомленияПоПеремещениям.Пользователь = &Пользователь
	|	И НЕ ИИТ_УведомленияПоПеремещениям.Выполнена";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() > 0 Тогда
		Элементы.ИИТ_ГрПемещения.Видимость = Истина;
		Элементы.ИИТ_Перемещения.Обновить();
	Иначе
		Элементы.ИИТ_ГрПемещения.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ОтобразитьУведомленияПоПоПоступлению()
	
	Элементы.ИИТ_ГрПоступления.Видимость = РольДоступна("ИИТ_РуководительСнабжения") ИЛИ РольДоступна("ИИТ_Снабжение");
	Элементы.ИИТ_Поступления.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура УбратьИзСписка(Команда)
	УбратьИзСпискаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УбратьИзСпискаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура УдалитьОповещениеОбАО(ЗаявкаСсылка)
	
	НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(ЗаявкаСсылка);
	НаборЗаписей.Отбор.Ответственный.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура УдалитьОповещениеОЗаявкеПоПользователю(ЗаявкаСсылка)
	
	НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(ЗаявкаСсылка);
	НаборЗаписей.Отбор.Ответственный.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура УдалитьУведомленияПоПеремещению(ДокументПеремещения)
	
	НаборЗаписей = РегистрыСведений.ИИТ_УведомленияПоПеремещениям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументПеремещения.Установить(ДокументПеремещения);
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры
	
#КонецОбласти

&После("ОбновитьОтображение")
Процедура АЛФ_ОбновитьОтображение()
	
	//+ИИТ_Аксеньюшкин
	ОтобразитьУведомленияПоПоПоступлению();
	ОтобразитьУведомленияПоПоПеремещениям();
	ОтобразитьУведомленияПоАвансовымОтчетам();
	ОтобразитьУведомленияПоЗаявкамНаЗакуп();
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ОбработчикСписокПриАктивизацииСтроки")
Процедура АЛФ_Подключаемый_ОбработчикСписокПриАктивизацииСтроки()

ТекущиеДанные = Элементы.ТекущиеОповещенияСписок.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Задача") Тогда
#Вставка
		//+ИИТ_Аксеньюшкин
		Если ТекущиеДанные.Тема = "Возврат заявки автору" Тогда
			Возврат;
		КонецЕсли;
		//-ИИТ_Аксеньюшкин
#КонецВставки
		// Отображение команды Согласование документа.
		УстановитьДоступностьКомандСогласования(ТекущиеДанные.Задача, ТекущиеДанные.Пользователь);
		// Вывод текущего оповещения.
		ОтобразитьСодержимоеТекущегоОповещения(ТекущиеДанные);
	Иначе
		Элементы.СогласованиеДокумента.Доступность           = Ложь;
		Элементы.МаршрутСогласования.Доступность             = Ложь;
		Элементы.ИсторияСогласования.Доступность             = Ложь;
		Элементы.ФормаДополнительноеСогласование.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТекущиеОповещенияСписокВыбор")
Процедура АЛФ_ТекущиеОповещенияСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Открыть выбранную задачу.
	ТекДанные = Элементы.ТекущиеОповещенияСписок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.Задача) Тогда
			// Получим данные по выбранной задаче.
			ВыделенныеСтрокиТаблицы = Элементы[ИмяТекущейТаблицы].ВыделенныеСтроки;
			СписокКлючей = Новый СписокЗначений;
			СписокКлючей.Добавить(Элементы.ТекущиеОповещенияСписок.ТекущаяСтрока);
			СтруктураСсылок = ВернутьСтруктуруСсылокПоКлючам(СписокКлючей, ЗадачиЗамещаемых.ВыгрузитьЗначения());
			// Откроем задачу при необходимости.
			Если СтруктураСсылок.ЗадачиНеВыполнены Тогда
				ОткрытьЗадачиПоСтруктуреСсылок(СтруктураСсылок);
			Иначе
				// Нет невыполненных задач. Ничего не делаем.
			КонецЕсли;
#Вставка
		//+ИИТ_Аксеньюшкин
		ИначеЕсли Найти(ТекДанные.Тема, "оплатил заявку") > 0 ИЛИ Найти(ТекДанные.Тема, "отправлена бухгалтеру без утверждения") > 0 
		ИЛИ Найти(ТекДанные.Тема, "Пожалуйста, ознакомьтесь с согласованием заявки.") > 0 ИЛИ Найти(ТекДанные.Тема, "отклонена при согласовании") > 0 Тогда
			ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
			//УдалитьОповещениеОЗаявкеПоПользователю(ТекДанные.Ссылка);
		ИначеЕсли Найти(Строка(ТекДанные.Ссылка), "Выдача наличных") > 0 Тогда
			ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
			УдалитьОповещениеОЗаявкеПоПользователю(ТекДанные.Ссылка);
		ИначеЕсли ТекДанные.Тема = "Возврат заявки автору" Тогда
			ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
		ИначеЕсли ТекДанные.Тема = "Согласовать поступление ТМЦ" Тогда
			ОткрытьФорму("Документ.ПеремещениеТоваров.Форма.ФормаДокумента", Новый Структура("Ключ,Принятие", ТекДанные.Ссылка, Истина));
		ИначеЕсли ТекДанные.Тема = "Расхождение принятого и отправленного количества" Тогда
			ОткрытьФорму("Документ.ПеремещениеТоваров.Форма.ФормаДокумента", Новый Структура("Ключ,Расхождение", ТекДанные.Ссылка, Истина));
		ИначеЕсли ТекДанные.Тема = "Оплачена заявка" ИЛИ Найти(ТекДанные.Тема, "Сопоставить") > 0 Тогда
			ОткрытьФорму("ОбщаяФорма.ИИТ_ОзнакомлениеСОповещением", Новый Структура("Заявка,Ответственный,ДатаСоздания,Пояснение", 
						ТекДанные.Ссылка, ТекДанные.Пользователь, ТекДанные.ДатаСоздания, ТекДанные.Тема));
		ИначеЕсли ТекДанные.Тема = "Получение денежных средств не согласовано." Тогда
			ОткрытьФорму("Документ.ИИТ_ПеремещениеДенежныхСредствПодотчетныхЛиц.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДанные.Ссылка));
		ИначеЕсли ТекДанные.Тема = "Согласуйте получение денежных средств" Тогда
			ТипДокумента = Строка(ПолучитьтипДокумента(ТекДанные.Ссылка));
			Если ТипДокумента = "Перемещение денежных средств подотчетных лиц" Тогда
				ОткрытьФорму("Документ.ИИТ_ПеремещениеДенежныхСредствПодотчетныхЛиц.Форма.ФормаДокумента", Новый Структура("Ключ,ОткрытьДляСогласования", ТекДанные.Ссылка, Истина));
			Иначе
				ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента", Новый Структура("Ключ,ОткрытьДляСогласования", ТекДанные.Ссылка, Истина));
			КонецЕсли;
		//-ИИТ_Аксеньюшкин
#КонецВставки
		Иначе
			// Нет данных для открытия
		КонецЕсли;
	Иначе	
		// Нет связанного объекта
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьПризнакПрочитано")
Процедура АЛФ_УстановитьПризнакПрочитано(Команда)
	МассивВыделенных = Элементы.ТекущиеОповещенияСписок.ВыделенныеСтроки; 
#Вставка
	//+ИИТ_Аксеньюшкин
	МассивВыделенных_ = Новый Массив;
	Для Каждого ВыделеннаяСтрока_ Из МассивВыделенных Цикл
		ДанныеСтроки = Элементы.ТекущиеОповещенияСписок.ДанныеСтроки(ВыделеннаяСтрока_);
		МассивВыделенных_.Добавить(ДанныеСтроки);
	КонецЦикла;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	ЕстьНепрочитанные = ОпределитьНаличиеНепрочитанных(МассивВыделенных);
	Для Каждого вСтрока Из Элементы.ТекущиеОповещенияСписок.ВыделенныеСтроки Цикл
		УстановитьПометкуПрочитано(вСтрока, ЕстьНепрочитанные);			
	КонецЦикла;
	Элементы.ТекущиеОповещенияСписок.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ЭлементыСогласованияПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)

	//+ИИТ_Аксеньюшкин
	Элементы.СогласованиеДокумента.Доступность				 = Истина;    
	Элементы.МаршрутСогласования.Доступность				 = Истина;
	Элементы.ИсторияСогласования.Доступность				 = Истина;
	Элементы.ФормаДополнительноеСогласование.Доступность	 = Истина;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СогласованиеДокумента")
Процедура АЛФ_СогласованиеДокумента(Команда)
ВыделенныеСтрокиТаблицы = Элементы[ИмяТекущейТаблицы].ВыделенныеСтроки;
	Если ВыделенныеСтрокиТаблицы.Количество() = 0 Тогда
		Возврат;
	Иначе
		// Получим данные по задачам.
		СписокКлючей = Новый СписокЗначений;
		Для Каждого Стр Из ВыделенныеСтрокиТаблицы Цикл  
			СписокКлючей.Добавить(Стр);
		КонецЦикла;
		СтруктураСсылок = ВернутьСтруктуруСсылокПоКлючам(СписокКлючей, ЗадачиЗамещаемых.ВыгрузитьЗначения());
		// Откроем задачи при необходимости.
		Если Не СтруктураСсылок.ЗадачиНеВыполнены Тогда
			ТекстСообщения = НСтр("ru = 'Задачи были выполнены ранее.'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			ОбновитьОтображение();
			Возврат;
		Иначе
#Вставка
			//+ИИТ_Аксеньюшкин
			Если ИмяТекущейТаблицы = "ИИТ_АвансовыеОтчеты" Тогда
				МассивСсылок = Новый Массив;
				Для Каждого ВыделеннаяСтрока Из ВыделенныеСтрокиТаблицы Цикл
					ДокСсылка = Элементы.ИИТ_АвансовыеОтчеты.ДанныеСтроки(ВыделеннаяСтрока).Ссылка;
					МассивСсылок.Добавить(ДокСсылка);
				КонецЦикла;
				СтруктураСсылок = ПолучитьСтруктуруСсылок(МассивСсылок);
			ИначеЕсли ИмяТекущейТаблицы = "ИИТ_ЗаявкиНаЗакуп" Тогда
				МассивСсылок = Новый Массив;
				Для Каждого ВыделеннаяСтрока Из ВыделенныеСтрокиТаблицы Цикл
					ДокСсылка = Элементы.ИИТ_ЗаявкиНаЗакуп.ДанныеСтроки(ВыделеннаяСтрока).Ссылка;
					МассивСсылок.Добавить(ДокСсылка);
				КонецЦикла;
				СтруктураСсылок = ПолучитьСтруктуруСсылок(МассивСсылок);
			КонецЕсли;
			//-ИИТ_Аксеньюшкин
#КонецВставки
			ОткрытьЗадачиПоСтруктуреСсылок(СтруктураСсылок);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
&ИзменениеИКонтроль("ВернутьСтруктуруСсылокПоКлючам")
Функция АЛФ_ВернутьСтруктуруСсылокПоКлючам(СписокКлючей, ЗадачиЗамещаемых)
	РезультатФункции = ИнициироватьСтруктуруСсылокПоКлючам();
	Если СписокКлючей.Количество() = 0 Тогда
		// Передан пустой список. Задач по нему нет.
		РезультатФункции = ИнициироватьСтруктуруСсылокПоКлючам();	
	Иначе	
		ПервыйЭлементЗначение = СписокКлючей[0].Значение;
		Если ТипЗнч(ПервыйЭлементЗначение) = Тип("РегистрСведенийКлючЗаписи.ОповещенияПользователей") Тогда
			// Возьмём задачи из оповещений пользователей.
			// Получим массив идентификаторов сообщений.
			СписокСсылок = Новый СписокЗначений; 
			СписокЗадач = Новый СписокЗначений;
			МассивИдентификаторов = Новый Массив;
			Для Каждого нКлюч Из СписокКлючей Цикл
				МассивИдентификаторов.Добавить(нКлюч.Значение.ИдентификаторОповещения);
			КонецЦикла;
			// По известным идентификаторам получим список ссылок на согласуемые объекты.
			ТаблицаЗадач = ПолучитьТаблицуЗадачОповещений(МассивИдентификаторов);
			// Обойдём полученную таблицу и заполним результирующие данные.
			ЭтоДопСогласование = Ложь;
			ВидДействияДопСогласование = Перечисления.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа;
			ТипЗадачи = Неопределено;
			ЗадачиРазнородные = Ложь;
			ТребуетсяВыполнение = Ложь;
			Для Каждого ТекТаблицаЗадач Из ТаблицаЗадач Цикл
				ТекСсылка = ТекТаблицаЗадач.Ссылка;
				ТекВидОповещения = ТекТаблицаЗадач.ВидОповещения;
				ЭтоВидОповещенияСогласования	 = (ТекВидОповещения = Справочники.ВидыСобытийОповещений.ТребуетсяСогласование);
				ЭтоВидОповещенияОбработка		 = (ТекВидОповещения = Справочники.ВидыСобытийОповещений.ТребуетсяОбработка);
				ЭтоВидОповещенияВыборЭтапа		 = (ТекВидОповещения = Справочники.ВидыСобытийОповещений.ТребуетсяВыборЭтапа);   
				ЭтоВидОповещенияЭкспертизаЗаявки = (ТекВидОповещения = Справочники.ВидыСобытийОповещений.ЗадачаЭкспертизыЗаявкиНаОбеспечение);
				ТекЗадача = ТекТаблицаЗадач.Задача;
				// Заполнение списка ссылок.
				Если ЗначениеЗаполнено(ТекСсылка) Тогда
					СписокСсылок.Добавить(ТекСсылка);	
				Иначе
					// Нет ссылки, не добавляем.
				КонецЕсли;
				// Обработка прикреплённой задачи.
				Если ЗначениеЗаполнено(ТекЗадача) Тогда  
					// Заполнение списка задач.
					СписокЗадач.Добавить(ТекЗадача);
					// Получим тип текущей задачи.
					Если ЭтоВидОповещенияСогласования ИЛИ ЭтоВидОповещенияОбработка ИЛИ ЭтоВидОповещенияВыборЭтапа ИЛИ ЭтоВидОповещенияЭкспертизаЗаявки Тогда
						ВидОповещенияРабочий = ТекВидОповещения;										// Известный тип задачи. Оставим его.
					Иначе
						ВидОповещенияРабочий = Справочники.ВидыСобытийОповещений.ПустаяСсылка();		// Задача задана, но тип неизвестный. Обрабатываем как общую задачу.
					КонецЕсли;
					// Сравним полученный тип задачи с имеющимся.
					Если ТипЗадачи = Неопределено Тогда
						ТипЗадачи = ВидОповещенияРабочий;
						// Проверка на доп согласование.
						Если ТекТаблицаЗадач.ВидДействия = ВидДействияДопСогласование Тогда
							ЭтоДопСогласование = Истина;
						Иначе
							// Выполняем поиск далее.
						КонецЕсли;
					Иначе
						Если ТипЗадачи = ВидОповещенияРабочий Тогда
							// Такая же задача. Оставляем тип.
						Иначе
							ЗадачиРазнородные =  Истина; 	// Предыдущие задачи были другими. Выполнять вместе нельзя.
						КонецЕсли;
					КонецЕсли;    				
					// Установим флаг необходимости выполнения, если задача ещё не выполнена.
					Если (НЕ ТекТаблицаЗадач.Выполнено) И (НЕ ЗначениеЗаполнено(ТекТаблицаЗадач.ВремяЗавершенияЗадачи)) Тогда
						ТребуетсяВыполнение = Истина;
					Иначе
						// Задача уже выполнена. Не требуется её выполнение.
					КонецЕсли;
				Иначе
					// Задачи нет. Пропускаем эту строку.
				КонецЕсли;
			КонецЦикла;
			ЗадачиНеВыполнены = Справочники.Задачи.ЗадачиНеВыполнены(СписокЗадач);
			МассивЗамещаемых = ТаблицаЗадач.ВыгрузитьКолонку("Замещаемый");
			МассивЗамещаемых = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗамещаемых);
			СписокЗамещаемых = Новый СписокЗначений;
			СписокЗамещаемых.ЗагрузитьЗначения(МассивЗамещаемых);
			АдресТаблицыЗадач = ПоместитьВоВременноеХранилище(ТаблицаЗадач);
			// Вывод результата.
			РезультатФункции.Вставить("ЗадачиНеВыполнены", ЗадачиНеВыполнены);
			РезультатФункции.Вставить("СписокСсылок", СписокСсылок);
			РезультатФункции.Вставить("СписокЗадач", СписокЗадач);
			РезультатФункции.Вставить("ЭтоДопСогласование", ЭтоДопСогласование);		
			РезультатФункции.Вставить("ЗадачиРазнородные", ЗадачиРазнородные);		
			РезультатФункции.Вставить("ТипЗадачи", ТипЗадачи);		
			РезультатФункции.Вставить("ТребуетсяВыполнение", ТребуетсяВыполнение);		
			РезультатФункции.Вставить("АдресТаблицыЗадач", АдресТаблицыЗадач);		
			РезультатФункции.Вставить("СписокЗамещаемых", СписокЗамещаемых);		
		ИначеЕсли ТипЗнч(ПервыйЭлементЗначение) = Тип("РегистрСведенийКлючЗаписи.ОтложеннаяОбработкаЭтаповПроцессов") Тогда
			// Получим массив задач в списке.
			СписокСсылок = Новый СписокЗначений;
			СписокЗадач = Новый СписокЗначений;
			ЭтоСогласование = Истина;
			ЭтоДопСогласование = Ложь;
			ВидДействияДопСогласование = Перечисления.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа;
			ТипЗадачи = Неопределено;
			ЗадачиРазнородные = Ложь;
			Для Каждого ТекСписокКлючей Из СписокКлючей Цикл
				ТекСписокКлючейЗначение = ТекСписокКлючей.Значение;
				СписокСсылок.Добавить(ТекСписокКлючейЗначение.ДокументПроцесса.КлючевойОбъектПроцесса);
				ТекЭтап = ТекСписокКлючейЗначение.ЭтапПроцесса;
				ЕстьДокументПроцесса = ЗначениеЗаполнено(ТекСписокКлючейЗначение.ДокументПроцесса);
				Если (ЕстьДокументПроцесса) И (ТекСписокКлючейЗначение.ВидДействия = ВидДействияДопСогласование) Тогда
					ЭтоДопСогласование = Истина;
				Иначе
					// Выполняем далее.
				КонецЕсли;
				// Получение типа задачи.
				ТипЗадачиРабочий = Неопределено;
				Если ЗначениеЗаполнено(ТекЭтап) Тогда
					ЭтоРучнойПереход	 = (ТекЭтап.ТипЭтапа = Перечисления.ТипыЭтаповУниверсальныхПроцессов.РучнойПереход);
					ЭтоУсловныйПереход	 = (ТекЭтап.ТипЭтапа = Перечисления.ТипыЭтаповУниверсальныхПроцессов.УсловныйПереход);
					ЭтоСогласование		 = (ТекЭтап.ТипЭтапа = Перечисления.ТипыЭтаповУниверсальныхПроцессов.ЭтапСогласования);
					ЭтоОбработка		 = (ТекЭтап.ТипЭтапа = Перечисления.ТипыЭтаповУниверсальныхПроцессов.ОбработкаУниверсальногоПроцесса);
					Если ЭтоРучнойПереход ИЛИ ЭтоУсловныйПереход Тогда
						ТипЗадачиРабочий = Справочники.ВидыСобытийОповещений.ТребуетсяВыборЭтапа;
					ИначеЕсли ЭтоСогласование Тогда
						ТипЗадачиРабочий = Справочники.ВидыСобытийОповещений.ТребуетсяСогласование;
					ИначеЕсли ЭтоОбработка Тогда
						ТипЗадачиРабочий = Справочники.ВидыСобытийОповещений.ТребуетсяОбработка;
					Иначе
						ТекстСообщения = НСтр("ru = 'Неизвестный тип этапа %ТипЭтапа%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипЭтапа%", Строка(ТекЭтап.ТипЭтапа));
						ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
						ТипЗадачиРабочий = Неопределено;
					КонецЕсли;
				Иначе
					ТипЗадачиРабочий = Неопределено;
				КонецЕсли;
				Если ТипЗадачи = Неопределено Тогда
					ТипЗадачи = ТипЗадачиРабочий;
				Иначе 
					Если ТипЗадачи <> ТипЗадачиРабочий Тогда
						ЗадачиРазнородные =  Истина; 
					Иначе
						// Такая же задача. Оставляем тип.
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			МассивЗадач = ПолучитьЗадачиПользователяПоОбъекту(СписокСсылок.ВыгрузитьЗначения(), ЗадачиЗамещаемых);
			СписокЗадач.ЗагрузитьЗначения(МассивЗадач);
			ЗадачиНеВыполнены = Справочники.Задачи.ЗадачиНеВыполнены(СписокЗадач);
			СписокЗамещаемых = Новый СписокЗначений;	
			// Вывод результата.
			РезультатФункции.Вставить("ЗадачиНеВыполнены", ЗадачиНеВыполнены);
			РезультатФункции.Вставить("СписокСсылок", СписокСсылок);
			РезультатФункции.Вставить("СписокЗадач", СписокЗадач);
			РезультатФункции.Вставить("ЭтоДопСогласование", ЭтоДопСогласование);
			РезультатФункции.Вставить("ЗадачиРазнородные", ЗадачиРазнородные);		
			РезультатФункции.Вставить("ТипЗадачи", ТипЗадачи);	// Т.к. на эти закладки попадают только задачи согласования.
			РезультатФункции.Вставить("ТребуетсяВыполнение", Истина);	
			РезультатФункции.Вставить("АдресТаблицыЗадач", "");	
			РезультатФункции.Вставить("СписокЗамещаемых", СписокЗамещаемых);	
		Иначе
			// Неизвестный вариант ключа.
			#Удаление
			ТекстОшибки = Нстр("ru = 'Неизвестный вариант записи таблицы: %СтрокаЗаписи%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СтрокаЗаписи%", Строка(ПервыйЭлементЗначение));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки);
			РезультатФункции = ИнициироватьСтруктуруСсылокПоКлючам()
			#КонецУдаления	
		КонецЕсли;
	КонецЕсли;
	// Пост-обработка и вывод результатов.
	СверткаСпискаСсылок = ОбщегоНазначенияКлиентСерверУХ.СвернутьСписокЗначений(РезультатФункции.СписокСсылок);
	СверткаСписокЗадач = ОбщегоНазначенияКлиентСерверУХ.СвернутьСписокЗначений(РезультатФункции.СписокЗадач);
	РезультатФункции.Вставить("СписокСсылок", СверткаСпискаСсылок);
	РезультатФункции.Вставить("СписокЗадач", СверткаСписокЗадач);	
	Возврат РезультатФункции;	
КонецФункции

&НаКлиенте
Процедура АЛФ_ИИТ_ИспользоватьОтборОписаниеЗаказаПриИзмененииПеред(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ИИТ_ОтборПоОписаниеПриИзмененииПеред(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АЛФ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
    #Вставка
	КомандаФормы = Команды.Добавить("ИИТ_Ознакомиться");
	КомандаФормы.Заголовок = "Ознакомиться";
	КомандаФормы.Действие  = "ИИТ_Ознакомиться";

	КомандаФормы = Команды.Добавить("ИИТ_СкачатьАрхив");
	КомандаФормы.Заголовок = "Скачать архив";
	КомандаФормы.Действие  = "ИИТ_СкачатьАрхив";  

	КомандаФормы = Команды.Добавить("ИИТ_Удалить");
	КомандаФормы.Заголовок = "Удалить";
	КомандаФормы.Действие  = "ИИТ_Удалить";  

	КомандаФормы = Команды.Добавить("ВнизОтТекущей");
	КомандаФормы.Заголовок = "Вниз от текущей";
	КомандаФормы.Действие  = "ВнизОтТекущей";  

	КомандаФормы = Команды.Добавить("СброситьФильтры");
	КомандаФормы.Заголовок = "Сбросить фильтры";
	КомандаФормы.Действие  = "СброситьФильтры";  

	КомандаФормы = Команды.Добавить("УбратьИзСписка");
	КомандаФормы.Заголовок = "Убрать из списка";
	КомандаФормы.Действие  = "УбратьИзСписка"; 
	
	//Элементы формы
	КнопкаФормы = Элементы.Вставить("ФормаИИТ_СкачатьАрхив", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель, Элементы.НазначитьЗаместителя);
	КнопкаФормы.Заголовок = "";
	КнопкаФормы.ИмяКоманды = "ИИТ_СкачатьАрхив";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  
	КнопкаФормы.Картинка = БиблиотекаКартинок.ЗакончитьРедактированиеФайла;
	КнопкаФормы.Отображение = ОтображениеКнопки.Картинка;
	
	Элементы.ГрТекущиеОповещенияСписок.Заголовок = "Уведомления по оплатам";
	
	КнопкаФормы = Элементы.Добавить("ТекущиеОповещенияСписокИИТ_Ознакомиться", Тип("КнопкаФормы"), Элементы.ТекущиеОповещенияСписокКоманднаяПанель);
	КнопкаФормы.Заголовок = "Ознакомиться";
	КнопкаФормы.ИмяКоманды = "ИИТ_Ознакомиться";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  
	
	КнопкаФормы = Элементы.Добавить("ТекущиеОповещенияСписокИИТ_Удалить", Тип("КнопкаФормы"), Элементы.ТекущиеОповещенияСписокКоманднаяПанель);
	КнопкаФормы.Заголовок = "Удалить";
	КнопкаФормы.ИмяКоманды = "ИИТ_Удалить";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  

	ЭлементТаблицыФормы = Элементы.Вставить("ТекущиеОповещенияСписокСсылкаКонтрагент", Тип("ПолеФормы"), Элементы.ТекущиеОповещенияСписок, Элементы.ТекущиеОповещенияСписокКатегорияОповещений);
	ЭлементТаблицыФормы.Заголовок = "Контрагент"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "МоиОповещения.Ссылка.Контрагент";

	ЭлементТаблицыФормы = Элементы.Вставить("ТекущиеОповещенияСписокСсылкаИИТ_ПроектМОРС", Тип("ПолеФормы"), Элементы.ТекущиеОповещенияСписок, Элементы.ТекущиеОповещенияСписокКатегорияОповещений);
	ЭлементТаблицыФормы.Заголовок = "Объект строительства"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "МоиОповещения.Ссылка.ИИТ_ПроектМОРС";

	ЭлементТаблицыФормы = Элементы.Вставить("ТекущиеОповещенияСписокСсылка", Тип("ПолеФормы"), Элементы.ТекущиеОповещенияСписок, Элементы.ТекущиеОповещенияСписокКатегорияОповещений);
	ЭлементТаблицыФормы.Заголовок = "Заявка"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "МоиОповещения.Ссылка";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТекущиеОповещенияСписокЗадачаСвязанныйОбъектИИТ_ОписаниеЗаявки", Тип("ПолеФормы"), Элементы.ТекущиеОповещенияСписок);
	ЭлементТаблицыФормы.Заголовок = "Описание заявки"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "МоиОповещения.Задача.СвязанныйОбъект.ИИТ_ОписаниеЗаявки"; 
	
	Элементы.Переместить(Элементы.ПрочееСтандартнаяКартинка, Элементы.Прочее, Элементы.ПрочееСсылка);
	
#КонецВставки
		// Проверим необходимость показа формы на рабочем столе.
	Если ОбщегоНазначения.РазделениеВключено()
		И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПараметрыКлиента = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере();
	Если ПараметрыКлиента.Получить("СкрытьРабочийСтолПриНачалеРаботыСистемы") <> Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	текПользователи.Очистить();
	
	ТаблицаЗамещаемых = МодульУправленияПроцессамиУХ.ТаблицаЗамещаемых(
		ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"),
		ЕстьУточнениеЗамещения);
	Если ТаблицаЗамещаемых.Количество() > 0 Тогда
		ЗамещаемыеПользователи = ТаблицаЗамещаемых.ВыгрузитьКолонку("ЗамещаемыйПользователь");
		Если ЗамещаемыеПользователи.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЗамещаемыеПользователи);
			Для Каждого Стр Из ЗамещаемыеПользователи Цикл
				текПользователи.Добавить(Стр);
			КонецЦикла;
		КонецЕсли;
		Если ЕстьУточнениеЗамещения Тогда
			ЗамещаемыеРасширенныеОтборы.Загрузить(ТаблицаЗамещаемых);
			ОбновитьЗадачиЗамещаемых();
		КонецЕсли;
	КонецЕсли;
	МассивПользователей = текПользователи.ВыгрузитьЗначения();
	МоиОповещения.Параметры.УстановитьЗначениеПараметра("Замещаемые", МассивПользователей);
	текПользователи.Добавить(ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
	МоиОповещения.Параметры.УстановитьЗначениеПараметра("Ответственный", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь")); 
	#Удаление
	МоиОповещения.Параметры.УстановитьЗначениеПараметра("ВидОповещения", Справочники.ВидыСобытийОповещений.ОценкаПредложенийПоставщиков);
	#КонецУдаления
	МоиОповещения.Параметры.УстановитьЗначениеПараметра("ЕстьУточнениеЗамещения", ЕстьУточнениеЗамещения);
	МоиОповещения.Параметры.УстановитьЗначениеПараметра("ЗадачиЗамещаемых", ЗадачиЗамещаемых.ВыгрузитьЗначения());
	
	//Определим доступные текущему пользователю объекты (закладки)
	
	СоздатьПрограммноСпискиОповещений();
	
	ЗапросОбъекты = Новый Запрос;
	ЗапросОбъекты.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                       |	ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ТипКлючевогоОбъекта.Наименование КАК ТипОбъекта
	                       |ИЗ
	                       |	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
	                       |ГДЕ
	                       |	ЗадачиУниверсальныхПроцессов.Ответственный В(&Ответственный)
	                       |	И ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
	                       |	И ЗадачиУниверсальныхПроцессов.Задача <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
	                       |	И НЕ ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ТипКлючевогоОбъекта.Наименование ЕСТЬ NULL
	                       |	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
	                       |	И ВЫБОР
	                       |			КОГДА &ЕстьУточнениеЗамещения
	                       |				ТОГДА ВЫБОР
	                       |						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
	                       |							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
	                       |						ИНАЧЕ ИСТИНА
	                       |					КОНЕЦ
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта.Наименование
	                       |ИЗ
	                       |	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
	                       |ГДЕ
	                       |	ЗадачиУниверсальныхПроцессов.Ответственный В(&Ответственный)
	                       |	И ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
	                       |	И ЗадачиУниверсальныхПроцессов.Задача <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
	                       |	И НЕ ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта.Наименование ЕСТЬ NULL
	                       |	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
	                       |	И ВЫБОР
	                       |			КОГДА &ЕстьУточнениеЗамещения
	                       |				ТОГДА ВЫБОР
	                       |						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
	                       |							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
	                       |						ИНАЧЕ ИСТИНА
	                       |					КОНЕЦ
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ";
	ЗапросОбъекты.УстановитьПараметр("ТекущийПользователь", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
	ЗапросОбъекты.УстановитьПараметр("Ответственный", текПользователи);
	ЗапросОбъекты.УстановитьПараметр("ЕстьУточнениеЗамещения", ЕстьУточнениеЗамещения);
	ЗапросОбъекты.УстановитьПараметр("ЗадачиЗамещаемых", ЗадачиЗамещаемых.ВыгрузитьЗначения());
	ТзОбъекты = ЗапросОбъекты.Выполнить().Выгрузить();	
	ОбновитьОтображениеЗакладокПоТаблицеОбъектов(ТзОбъекты);
	// Установим начальные настройки элементов.
	Элементы.КоманднаяПанель.Видимость = Истина;
	Элементы.КоманднаяПанельОповещения.Видимость = Ложь;
	ИмяТекущейТаблицы = "ТекущиеОповещенияСписок";
	ЦветТекущегоФлажка = Перечисления.ЦветаФлажковОповещений.Красный;
	// Установим запросы таблиц.
		
	Если Лев(Метаданные.Версия, 4) = "3.1." Тогда
		Элементы.ВложенияСогласования.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ТекущиеОповещенияСписок.ПодчиненныеЭлементы.ТекущиеОповещенияСписокНадписьДекорация.Заголовок = НСтр("ru = 'Надпись декорация'");
	Элементы.ТекущиеОповещенияСписок.ПодчиненныеЭлементы.ТекущиеОповещенияСписокИндексПрочитано.Заголовок = НСтр("ru = 'Индекс прочитано'");	
	Элементы.Прочее.ПодчиненныеЭлементы.ПрочееСсылка.Заголовок = НСтр("ru = 'Ссылка'");
	
	#Вставка     
    ОтобразитьУведомленияПоПоПоступлению();
	ВыполнитьОтборСпискаПоступлений();
	
	ИИТ_АвансовыеОтчеты.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	ИИТ_ЗаявкиНаЗакуп.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	ОтобразитьУведомленияПоАвансовымОтчетам();
	ОтобразитьУведомленияПоЗаявкамНаЗакуп();
	
	ИИТ_Перемещения.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
 #КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура АЛФ_ПриОткрытии(Отказ) 
#Вставка     
	//+ИИТ_Аксеньюшкин
	ИмяТекущейТаблицы = СтрЗаменить(Элементы.ЭлементыСогласования.ТекущаяСтраница.Имя, "Гр", "");
	//-ИИТ_Аксеньюшкин
#КонецВставки
	ИзменитьЦветТекущегоФлажка(ЦветТекущегоФлажка);
	ПодключитьОбработчикОжидания("ОбновлениеФормы", 5*60);		// Обновляем форму полностью каждые 5 минут.

	ПодсистемаКорпоративноеКазначейство = ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.КорпоративноеКазначейство");
	ПодсистемаЦентрализованныеЗакупки = ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.ЦентрализованныеЗакупки");
	ПодсистемаПланированиеИКонтрольСлужебный = ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.ПланированиеИКонтрольСлужебный");

	Если ПодсистемаКорпоративноеКазначейство Тогда
		Если Элементы.Найти("ВерсииСоглашения") <> Неопределено Тогда
			Элементы.ВерсииСоглашенияИзменить.Видимость = Ложь;
			Элементы.ВерсииСоглашенияКонтекстноеМенюИзменить.Видимость = Ложь;
		КонецЕсли;

		Если Элементы.Найти("ЗаявкаНаРасходованиеДенежныхСредств") <> Неопределено Тогда
			Элементы.ЗаявкаНаРасходованиеДенежныхСредствИзменить.Видимость = Ложь;
			Элементы.ЗаявкаНаРасходованиеДенежныхСредствКонтекстноеМенюИзменить.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ПодсистемаЦентрализованныеЗакупки И Элементы.Найти("ЗакупочныеПроцедуры") <> Неопределено Тогда
		Элементы.ЗакупочныеПроцедурыИзменить.Видимость = Ложь;
		Элементы.ЗакупочныеПроцедурыКонтекстноеМенюИзменить.Видимость = Ложь;
	КонецЕсли;

	Если ПодсистемаПланированиеИКонтрольСлужебный И Элементы.Найти("ОперативныйПлан") <> Неопределено Тогда
		Элементы.ОперативныйПланИзменить.Видимость = Ложь;
		Элементы.ОперативныйПланКонтекстноеМенюИзменить.Видимость = Ложь;
	КонецЕсли;
#Вставка     
	//+ИИТ_Аксеньюшкин
	МассивДанныхДляОповещения = ПолучитьДанныеДляОповещения();
	Для Каждого ЭлементМассива Из МассивДанныхДляОповещения Цикл
		Если ЗначениеЗаполнено(ЭлементМассива.Ссылка) Тогда
			ПоказатьОповещениеПользователя(ЭлементМассива.Текст, ПолучитьНавигационнуюСсылку(ЭлементМассива.Ссылка), "Открыть оповещение", , СтатусОповещенияПользователя.Информация);
		КонецЕсли;
	КонецЦикла;
	//-ИИТ_Аксеньюшкин
#КонецВставки
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СоздатьПрограммноСпискиОповещений")
Процедура АЛФ_СоздатьПрограммноСпискиОповещений()

	
	ГрЭлементыСогласования = ЭтотОбъект.Элементы.ЭлементыСогласования;
	ДобавляемыеРеквизиты = Новый Массив;
			
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ПодсистемаКорпоративноеКазначейство = ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.КорпоративноеКазначейство");
		ПодсистемаЦентрализованныеЗакупки = ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ЦентрализованныеЗакупки");
		ПодсистемаПланированиеИКонтрольСлужебный = ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ПланированиеИКонтрольСлужебный");
	#Иначе
		ПодсистемаКорпоративноеКазначейство = ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.КорпоративноеКазначейство");
		ПодсистемаЦентрализованныеЗакупки = ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.ЦентрализованныеЗакупки");
		ПодсистемаПланированиеИКонтрольСлужебный = ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.ПланированиеИКонтрольСлужебный");
	#КонецЕсли
	
	ДополнительныеУсловияПрочее = "";
		
	Если ПодсистемаКорпоративноеКазначейство Тогда
		
		//ВерсииСоглашения
		Если ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "РегистрыСведений", "ОтложеннаяОбработкаЭтаповПроцессов") 
			И (ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияКоммерческийДоговор")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияАккредитив")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияБанковскаяГарантия")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияВалютноПроцентныйСвоп")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияВалютныйСвоп")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияВалютныйФорвард")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияДепозит")
				ИЛИ ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ВерсияСоглашенияКредит")) Тогда
			
			ВерсииСоглашенияРеквизит = Новый РеквизитФормы("ВерсииСоглашения", Новый ОписаниеТипов("ДинамическийСписок"),, НСтр("ru = 'Версии соглашения'"), Ложь);
			
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(ВерсииСоглашенияРеквизит);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ЭтотОбъект.ВерсииСоглашения.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                                           |	ОтложеннаяОбработкаЭтаповПроцессов.Задача.СвязанныйОбъект КАК Ссылка,
			                                           |	ВложенныйЗапрос.Номер КАК Номер,
			                                           |	ВложенныйЗапрос.ДатаПодписания КАК ДатаПодписания,
			                                           |	ВложенныйЗапрос.Дата КАК Дата,
			                                           |	ВложенныйЗапрос.Организация КАК Организация,
			                                           |	ВложенныйЗапрос.Ответственный КАК Ответственный,
			                                           |	ВложенныйЗапрос.ВидДействия КАК ВидДействия,
			                                           |	ВложенныйЗапрос.Сумма КАК Сумма,
			                                           |	ВложенныйЗапрос.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
			                                           |	ОтложеннаяОбработкаЭтаповПроцессов.Задача КАК Задача
			                                           |ИЗ
			                                           |	(ВЫБРАТЬ
			                                           |		ВерсияСоглашенияКоммерческийДоговор.Ссылка КАК Ссылка,
			                                           |		ВерсияСоглашенияКоммерческийДоговор.Номер КАК Номер,
			                                           |		ВерсияСоглашенияКоммерческийДоговор.ДатаПодписания КАК ДатаПодписания,
			                                           |		ВерсияСоглашенияКоммерческийДоговор.Дата КАК Дата,
			                                           |		ВерсияСоглашенияКоммерческийДоговор.Организация КАК Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный КАК Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия КАК ВидДействия,
			                                           |		ВерсияСоглашенияКоммерческийДоговор.Сумма КАК Сумма,
			                                           |		ВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача КАК Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса КАК ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса КАК ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта КАК ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияКоммерческийДоговор.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияКоммерческийДоговор.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияАккредитив.Ссылка,
			                                           |		ВерсияСоглашенияАккредитив.Номер,
			                                           |		ВерсияСоглашенияАккредитив.ДатаПодписания,
			                                           |		ВерсияСоглашенияАккредитив.Дата,
			                                           |		ВерсияСоглашенияАккредитив.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияАккредитив.Сумма,
			                                           |		ВерсияСоглашенияАккредитив.ВалютаВзаиморасчетов,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияАккредитив КАК ВерсияСоглашенияАккредитив
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияАккредитив.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияАккредитив.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияБанковскаяГарантия.Ссылка,
			                                           |		ВерсияСоглашенияБанковскаяГарантия.Номер,
			                                           |		ВерсияСоглашенияБанковскаяГарантия.ДатаПодписания,
			                                           |		ВерсияСоглашенияБанковскаяГарантия.Дата,
			                                           |		ВерсияСоглашенияБанковскаяГарантия.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияБанковскаяГарантия.Сумма,
			                                           |		ВерсияСоглашенияБанковскаяГарантия.ВалютаВзаиморасчетов,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияБанковскаяГарантия КАК ВерсияСоглашенияБанковскаяГарантия
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияБанковскаяГарантия.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияБанковскаяГарантия.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.Ссылка,
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.Номер,
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.ДатаПодписания,
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.Дата,
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.СуммаОрганизации,
			                                           |		ВерсияСоглашенияВалютноПроцентныйСвоп.ВалютаОрганизации,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияВалютноПроцентныйСвоп КАК ВерсияСоглашенияВалютноПроцентныйСвоп
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияВалютноПроцентныйСвоп.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияВалютноПроцентныйСвоп.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияВалютныйСвоп.Ссылка,
			                                           |		ВерсияСоглашенияВалютныйСвоп.Номер,
			                                           |		ВерсияСоглашенияВалютныйСвоп.ДатаПодписания,
			                                           |		ВерсияСоглашенияВалютныйСвоп.Дата,
			                                           |		ВерсияСоглашенияВалютныйСвоп.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияВалютныйСвоп.СуммаПервоначальногоПлатежаВПервойВалюте,
			                                           |		ВерсияСоглашенияВалютныйСвоп.ПерваяВалюта,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияВалютныйСвоп КАК ВерсияСоглашенияВалютныйСвоп
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияВалютныйСвоп.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияВалютныйСвоп.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияВалютныйФорвард.Ссылка,
			                                           |		ВерсияСоглашенияВалютныйФорвард.Номер,
			                                           |		ВерсияСоглашенияВалютныйФорвард.ДатаПодписания,
			                                           |		ВерсияСоглашенияВалютныйФорвард.Дата,
			                                           |		ВерсияСоглашенияВалютныйФорвард.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияВалютныйФорвард.СуммаВБазовойВалюте,
			                                           |		ВерсияСоглашенияВалютныйФорвард.БазоваяВалюта,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияВалютныйФорвард КАК ВерсияСоглашенияВалютныйФорвард
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияВалютныйФорвард.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияВалютныйФорвард.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияДепозит.Ссылка,
			                                           |		ВерсияСоглашенияДепозит.Номер,
			                                           |		ВерсияСоглашенияДепозит.ДатаПодписания,
			                                           |		ВерсияСоглашенияДепозит.Дата,
			                                           |		ВерсияСоглашенияДепозит.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияДепозит.Сумма,
			                                           |		ВерсияСоглашенияДепозит.ВалютаВзаиморасчетов,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияДепозит КАК ВерсияСоглашенияДепозит
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияДепозит.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияДепозит.ПометкаУдаления
			                                           |	
			                                           |	ОБЪЕДИНИТЬ ВСЕ
			                                           |	
			                                           |	ВЫБРАТЬ
			                                           |		ВерсияСоглашенияКредит.Ссылка,
			                                           |		ВерсияСоглашенияКредит.Номер,
			                                           |		ВерсияСоглашенияКредит.ДатаПодписания,
			                                           |		ВерсияСоглашенияКредит.Дата,
			                                           |		ВерсияСоглашенияКредит.Организация,
			                                           |		ЗадачиУниверсальныхПроцессов.Ответственный,
			                                           |		ЗадачиУниверсальныхПроцессов.ВидДействия,
			                                           |		ВерсияСоглашенияКредит.Сумма,
			                                           |		ВерсияСоглашенияКредит.ВалютаВзаиморасчетов,
			                                           |		ЗадачиУниверсальныхПроцессов.Задача,
			                                           |		ЗадачиУниверсальныхПроцессов.ДокументПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ЭтапПроцесса,
			                                           |		ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта
			                                           |	ИЗ
			                                           |		РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                           |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКредит КАК ВерсияСоглашенияКредит
			                                           |			ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ВерсияСоглашенияКредит.Ссылка
			                                           |	ГДЕ
			                                           |		ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                           |		И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                           |		И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                           |		И НЕ ВерсияСоглашенияКредит.ПометкаУдаления) КАК ВложенныйЗапрос
			                                           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ОтложеннаяОбработкаЭтаповПроцессов
			                                           |		ПО ВложенныйЗапрос.Ссылка = ОтложеннаяОбработкаЭтаповПроцессов.Задача.СвязанныйОбъект
			                                           |			И ВложенныйЗапрос.ВидДействия = ОтложеннаяОбработкаЭтаповПроцессов.ВидДействия
			                                           |			И ВложенныйЗапрос.ДокументПроцесса = ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса
			                                           |			И ВложенныйЗапрос.ЭтапПроцесса = ОтложеннаяОбработкаЭтаповПроцессов.ЭтапПроцесса
			                                           |			И ВложенныйЗапрос.Ответственный = ОтложеннаяОбработкаЭтаповПроцессов.Ответственный
			                                           |			И ВложенныйЗапрос.ТипКлючевогоОбъекта = ОтложеннаяОбработкаЭтаповПроцессов.ТипКлючевогоОбъекта
			                                           |			И (ОтложеннаяОбработкаЭтаповПроцессов.Выполнено = ЛОЖЬ)
			                                           |			И ВложенныйЗапрос.Задача = ОтложеннаяОбработкаЭтаповПроцессов.Задача
			                                           |ГДЕ
			                                           |	ВЫБОР
			                                           |			КОГДА &ЕстьУточнениеЗамещения
			                                           |				ТОГДА ВЫБОР
			                                           |						КОГДА ВложенныйЗапрос.Ответственный <> &ТекущийПользователь
			                                           |							ТОГДА ОтложеннаяОбработкаЭтаповПроцессов.Задача В (&ЗадачиЗамещаемых)
			                                           |						ИНАЧЕ ИСТИНА
			                                           |					КОНЕЦ
			                                           |			ИНАЧЕ ИСТИНА
			                                           |		КОНЕЦ";
			
			ЭтотОбъект.ВерсииСоглашения.ОсновнаяТаблица = "РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов";
			
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ЭтотОбъект.ВерсииСоглашения.Отбор, "Ответственный", текПользователи, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
			ГрВерсииСоглашения = ЭтотОбъект.Элементы.Добавить("ГрВерсииСоглашения", Тип("ГруппаФормы"), ГрЭлементыСогласования);
			ГрВерсииСоглашения.Вид  = ВидГруппыФормы.Страница;
			ГрВерсииСоглашения.Заголовок = Нстр("ru = 'Договоры'");
			ГрВерсииСоглашения.Подсказка = Нстр("ru = 'Договоры'");
			
			Элементы.Переместить(ГрВерсииСоглашения, ГрЭлементыСогласования, Элементы.ГрЗаявкаНаИзменениеНСИ);
			
			ВерсииСоглашенияТаблицаФормы = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашения", Тип("ТаблицаФормы"), ГрВерсииСоглашения);	
			ВерсииСоглашенияТаблицаФормы.ПутьКДанным = "ВерсииСоглашения";	
			ВерсииСоглашенияТаблицаФормы.ИзменятьСоставСтрок = Ложь;
			ВерсииСоглашенияТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ВерсииСоглашенияТаблицаФормы.Видимость = Ложь;
	#Вставка     
			Попытка
#КонецВставки		
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияВалютаВзаиморасчетов", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.ВалютаВзаиморасчетов";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияВидДействия", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.ВидДействия";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияДата", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Дата";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияДатаПодписания", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.ДатаПодписания";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияЗадача", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Задача";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияНомер", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Номер";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияОрганизация", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Организация";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияОтветственный", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Ответственный";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияСсылка", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Ссылка";
			
			ВерсииСоглашенияКолонка = ЭтотОбъект.Элементы.Добавить("ВерсииСоглашенияСумма", Тип("ПолеФормы"), ВерсииСоглашенияТаблицаФормы);       
			ВерсииСоглашенияКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ВерсииСоглашенияКолонка.ПутьКДанным = "ВерсииСоглашения.Сумма";
			
			ВерсииСоглашенияТаблицаФормы.УстановитьДействие("Выбор", "ВерсииСоглашенияВыбор");
			ВерсииСоглашенияТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки", "ВерсииСоглашенияПриАктивизацииСтроки");
			#Вставка     
			Исключение
			КонецПопытки;
#КонецВставки
			ВыводимыеДинамическиеСписки.Добавить("ВерсииСоглашения");
		КонецЕсли;
		
		//ЗаявкиНаОперацию	
		Если ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "РегистрыСведений", "ОтложеннаяОбработкаЭтаповПроцессов") 
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			#Вставка
			Попытка
#КонецВставки
			ЗаявкиНаОперациюРеквизит = Новый РеквизитФормы("ЗаявкиНаОперацию", Новый ОписаниеТипов("ДинамическийСписок"),, НСтр("ru = 'Заявки на операцию'"), Ложь);
			
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(ЗаявкиНаОперациюРеквизит);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ЭтотОбъект.ЗаявкиНаОперацию.ТекстЗапроса = УправлениеПроцессамиСогласованияУхПереопределяемый.ПолучитьТекстЗапросаЗаявкиНаОперациюМоиОповещения();		
			ЭтотОбъект.ЗаявкиНаОперацию.ОсновнаяТаблица = "РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов";
			
			ЭтотОбъект.ЗаявкиНаОперацию.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
			ЭтотОбъект.ЗаявкиНаОперацию.Параметры.УстановитьЗначениеПараметра("ЕстьУточнениеЗамещения", ЕстьУточнениеЗамещения);
			ЭтотОбъект.ЗаявкиНаОперацию.Параметры.УстановитьЗначениеПараметра("ЗадачиЗамещаемых", ЗадачиЗамещаемых.ВыгрузитьЗначения());
			
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ЭтотОбъект.ЗаявкиНаОперацию.Отбор, "Ответственный", текПользователи, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
			ГрЗаявкиНаОперацию = ЭтотОбъект.Элементы.Добавить("ГрЗаявкаНаРасходованиеДенежныхСредств", Тип("ГруппаФормы"), ГрЭлементыСогласования);
			ГрЗаявкиНаОперацию.Вид  = ВидГруппыФормы.Страница;
			ГрЗаявкиНаОперацию.Заголовок = Нстр("ru = 'Заявки на операцию'");
			ГрЗаявкиНаОперацию.Подсказка = Нстр("ru = 'Заявки на операцию'");			
			#Вставка
			ГрЗаявкиНаОперацию.Заголовок = Нстр("ru = 'Согласование оплат'");
			ГрЗаявкиНаОперацию.Подсказка = Нстр("ru = 'Согласование оплат'");
#КонецВставки
			Элементы.Переместить(ГрЗаявкиНаОперацию, ГрЭлементыСогласования, Элементы.ГрПроекты);
			
			ЗаявкиНаОперациюТаблицаФормы = ЭтотОбъект.Элементы.Добавить("ЗаявкаНаРасходованиеДенежныхСредств", Тип("ТаблицаФормы"), ГрЗаявкиНаОперацию);	
			ЗаявкиНаОперациюТаблицаФормы.ПутьКДанным = "ЗаявкиНаОперацию";	
			ЗаявкиНаОперациюТаблицаФормы.ИзменятьСоставСтрок = Ложь;
			ЗаявкиНаОперациюТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ЗаявкиНаОперациюТаблицаФормы.Видимость = Ложь;
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюЕстьПревышениеЛимитыБюджет", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеКартинки;
			ЗаявкиНаОперациюКолонка.КартинкаЗначений = БиблиотекаКартинок.СообщениеОПроблемах;
			ЗаявкиНаОперациюКолонка.КартинкаШапки = БиблиотекаКартинок.СообщениеОПроблемах;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ЕстьПревышениеЛимитыБюджет";
			ЗаявкиНаОперациюКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюВидОперацииБюджетирование", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ВидОперацииУХ";
			ЗаявкиНаОперациюКолонка.Заголовок = Нстр("ru = 'Вид операции'");
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюНомер", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Номер";
	#Вставка
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюДатаСтатуса", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ДатаСтатуса";
	#КонецВставки		
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюДата", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Дата";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюСуммаДокумента", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.СуммаДокумента";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюВалютаДокумента", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ВалютаДокумента";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюДоговорКонтрагента", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ДоговорКонтрагента";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюКонтрагент", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Контрагент";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюКрайняяДата", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.КрайняяДата";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюОрганизация", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Организация";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюПриоритет", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Приоритет";		 
#Вставка     
			ЗаявкиНаОперациюКолонка.Заголовок = "Этап строительства";
#КонецВставки
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюСчетКонтрагента", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.СчетКонтрагента";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюФормаОплаты", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ФормаОплаты";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюЦФО", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.ЦФО";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюОтветственный", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Ответственный";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюСсылка", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Ссылка";
			
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюЗадача", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Задача";
			
			ЭтотОбъект.ЗаявкиНаОперацию.УстановитьОбязательноеИспользование("ВидДействия", Истина);
			ЭтотОбъект.ЗаявкиНаОперацию.УстановитьОбязательноеИспользование("ЕстьПревышениеЛимитыБюджет", Истина);
			ЭтотОбъект.ЗаявкиНаОперацию.УстановитьОбязательноеИспользование("Ответственный", Истина);
			ЭтотОбъект.ЗаявкиНаОперацию.УстановитьОбязательноеИспользование("Ссылка", Истина);			 
#Вставка
			ЗаявкиНаОперациюКолонка = ЭтотОбъект.Элементы.Добавить("ЗаявкиНаОперациюКомментарий", Тип("ПолеФормы"), ЗаявкиНаОперациюТаблицаФормы);       
			ЗаявкиНаОперациюКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗаявкиНаОперациюКолонка.ПутьКДанным = "ЗаявкиНаОперацию.Комментарий";
#КонецВставки
			ЗаявкиНаОперациюТаблицаФормы.УстановитьДействие("Выбор", "ВыборЭлемента");
			ЗаявкиНаОперациюТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки", "ЗаявкаНаОперациюПриАктивизацииСтроки");
			
			ДополнительныеУсловияПрочее = ДополнительныеУсловияПрочее + "
			|	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств";
	#Вставка
			Элементы.ИИТ_ОтборПоОбъектуЗаявки.Видимость = Истина;
			Элементы.Переместить(Элементы.ИИТ_ОтборПоОбъектуЗаявки, ГрЗаявкиНаОперацию, ЗаявкиНаОперациюТаблицаФормы); 
			Исключение
			КонецПопытки;
#КонецВставки		
			ВыводимыеДинамическиеСписки.Добавить("ЗаявкиНаОперацию");
		КонецЕсли;
				
	КонецЕсли;
	
	Если ПодсистемаЦентрализованныеЗакупки Тогда
		
		//ЗакупочныеПроцедуры
		Если ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "РегистрыСведений", "ОтложеннаяОбработкаЭтаповПроцессов") 
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Справочники", "ЗакупочныеПроцедуры") Тогда
			
			ЗакупочныеПроцедурыРеквизит = Новый РеквизитФормы("ЗакупочныеПроцедуры", Новый ОписаниеТипов("ДинамическийСписок"),, НСтр("ru = 'Закупочные процедуры'"), Ложь);
						
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(ЗакупочныеПроцедурыРеквизит);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ЭтотОбъект.ЗакупочныеПроцедуры.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                                              |	ЗакупочныеПроцедуры.Ссылка КАК Ссылка,
			                                              |	ЗакупочныеПроцедуры.ВерсияДанных КАК ВерсияДанных,
			                                              |	ЗакупочныеПроцедуры.Код КАК Код,
			                                              |	ЗакупочныеПроцедуры.Наименование КАК Наименование,
			                                              |	ЗакупочныеПроцедуры.ВалютаДокумента КАК ВалютаДокумента,
			                                              |	ЗакупочныеПроцедуры.ДатаНачалаПериодаПоставки КАК ДатаНачалаПериодаПоставки,
			                                              |	ЗакупочныеПроцедуры.ДатаНачалаПодготовкиЗакупки КАК ДатаНачалаПодготовкиЗакупки,
			                                              |	ЗакупочныеПроцедуры.ЗакрытаяЗакупка КАК ЗакрытаяЗакупка,
			                                              |	ЗакупочныеПроцедуры.ИсточникФинансирования КАК ИсточникФинансирования,
			                                              |	ЗакупочныеПроцедуры.ОрганизаторЗакупки КАК ОрганизаторЗакупки,
			                                              |	ЗадачиУниверсальныхПроцессов.Ответственный КАК Ответственный,
			                                              |	ЗакупочныеПроцедуры.ПериодЗакупок КАК ПериодЗакупок,
			                                              |	ЗакупочныеПроцедуры.ЭТП КАК ЭТП,
			                                              |	ЗадачиУниверсальныхПроцессов.ВидДействия КАК ВидДействия,
			                                              |	ЗадачиУниверсальныхПроцессов.Задача КАК Задача
			                                              |ИЗ
			                                              |	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗакупочныеПроцедуры КАК ЗакупочныеПроцедуры
			                                              |		ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ЗакупочныеПроцедуры.Ссылка
			                                              |ГДЕ
			                                              |	ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                              |	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                              |	И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                              |	И ВЫБОР
			                                              |			КОГДА &ЕстьУточнениеЗамещения
			                                              |				ТОГДА ВЫБОР
			                                              |						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
			                                              |							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
			                                              |						ИНАЧЕ ИСТИНА
			                                              |					КОНЕЦ
			                                              |			ИНАЧЕ ИСТИНА
			                                              |		КОНЕЦ";
			
			ЭтотОбъект.ЗакупочныеПроцедуры.ОсновнаяТаблица = "РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов";
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ЭтотОбъект.ЗакупочныеПроцедуры.Отбор, "Ответственный", текПользователи, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
			ГрЗакупочныеПроцедуры = ЭтотОбъект.Элементы.Добавить("ГрЗакупочныеПроцедуры", Тип("ГруппаФормы"), ГрЭлементыСогласования);
			ГрЗакупочныеПроцедуры.Вид  = ВидГруппыФормы.Страница;
			ГрЗакупочныеПроцедуры.Заголовок = Нстр("ru = 'Закупочные процедуры'");
			ГрЗакупочныеПроцедуры.Подсказка = Нстр("ru = 'Закупочные процедуры'");
			
			Элементы.Переместить(ГрЗакупочныеПроцедуры, ГрЭлементыСогласования, Элементы.ГрПроекты);
			
			ЗакупочныеПроцедурыТаблицаФормы = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедуры", Тип("ТаблицаФормы"), ГрЗакупочныеПроцедуры);	
			ЗакупочныеПроцедурыТаблицаФормы.ПутьКДанным = "ЗакупочныеПроцедуры";	
			ЗакупочныеПроцедурыТаблицаФормы.ИзменятьСоставСтрок = Ложь;
			ЗакупочныеПроцедурыТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ЗакупочныеПроцедурыТаблицаФормы.Видимость = Ложь;
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыСсылка", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.Ссылка";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыКод", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.Код";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыВалютаДокумента", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ВалютаДокумента";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыДатаНачалаПериодаПоставки", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ДатаНачалаПериодаПоставки";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыДатаНачалаПодготовкиЗакупки", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ДатаНачалаПодготовкиЗакупки";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыЗакрытаяЗакупка", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеФлажка;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ЗакрытаяЗакупка";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыИсточникФинансирования", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ИсточникФинансирования";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыНаименование", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.Наименование";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыОрганизаторЗакупки", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ОрганизаторЗакупки";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыОтветственный", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.Ответственный";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыПериодЗакупок", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ПериодЗакупок";
			
			ЗакупочныеПроцедурыКолонка = ЭтотОбъект.Элементы.Добавить("ЗакупочныеПроцедурыЭТП", Тип("ПолеФормы"), ЗакупочныеПроцедурыТаблицаФормы);       
			ЗакупочныеПроцедурыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ЗакупочныеПроцедурыКолонка.ПутьКДанным = "ЗакупочныеПроцедуры.ЭТП";
			
			ЭтотОбъект.ЗакупочныеПроцедуры.УстановитьОбязательноеИспользование("ВидДействия", Истина);
			ЭтотОбъект.ЗакупочныеПроцедуры.УстановитьОбязательноеИспользование("Задача", Истина);
			ЭтотОбъект.ЗакупочныеПроцедуры.УстановитьОбязательноеИспользование("Ответственный", Истина);
			
			ЗакупочныеПроцедурыТаблицаФормы.УстановитьДействие("Выбор", "ВыборЭлемента");
			ЗакупочныеПроцедурыТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки", "ЗакупочныеПроцедурыПриАктивизацииСтроки");
			
			ВыводимыеДинамическиеСписки.Добавить("ЗакупочныеПроцедуры");
			
		КонецЕсли;
	
		//МероприятияОценкиПоставщиков
		Если ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "РегистрыСведений", "СостояниеОценкиОбъектов") 
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "Мероприятие")
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "КритерииОценкиПоставщиков")
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Справочники", "Пользователи") Тогда
			
			МероприятияОценкиПоставщиковРеквизит = Новый РеквизитФормы("МероприятияОценкиПоставщиков", Новый ОписаниеТипов("ДинамическийСписок"),, НСтр("ru = 'Мероприятия оценки поставщиков'"), Ложь);
			
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(МероприятияОценкиПоставщиковРеквизит);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ЭтотОбъект.МероприятияОценкиПоставщиков.ТекстЗапроса = "ВЫБРАТЬ Разрешенные
			|	Мероприятие.Ссылка КАК Владелец,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостояниеОценкиОбъектов.Завершен, ЛОЖЬ) = ЛОЖЬ
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ СостояниеОценкиОбъектов.Завершен
			|	КОНЕЦ КАК Завершен,
			|	СостояниеОценкиОбъектов.Ответственный КАК ОтветственноеФизЛицо
			|ПОМЕСТИТЬ НЕЗавершенныеЗадачи
			|ИЗ
			|	Документ.Мероприятие КАК Мероприятие
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КритерииОценкиПоставщиков.Эксперты КАК КритерииОценкиПоставщиковЭксперты
			|		ПО Мероприятие.Контекст = КритерииОценкиПоставщиковЭксперты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОценкиОбъектов КАК СостояниеОценкиОбъектов
			|		ПО (СостояниеОценкиОбъектов.Владелец = Мероприятие.Ссылка)
			|ГДЕ
			|	НЕ Мероприятие.ПометкаУдаления
			|
			|СГРУППИРОВАТЬ ПО
			|	Мероприятие.Ссылка,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостояниеОценкиОбъектов.Завершен, ЛОЖЬ) = ЛОЖЬ
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ СостояниеОценкиОбъектов.Завершен
			|	КОНЕЦ,
			|	СостояниеОценкиОбъектов.Ответственный
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ Разрешенные
			|	Мероприятие.Ссылка КАК МероприятиеПоОценке,
			|	Пользователи.Ссылка КАК Ответственный,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.Организация КАК Организация,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.Периодичность КАК Периодичность,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.ГлубинаАнализа КАК ГлубинаАнализа,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.ФункциональноеНаправления КАК ФункциональноеНаправление,
			|	СостояниеОценкиОбъектов.Завершен КАК Завершен
			|ИЗ
			|	Документ.Мероприятие КАК Мероприятие
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КритерииОценкиПоставщиков.Эксперты КАК КритерииОценкиПоставщиковЭксперты
			|		ПО Мероприятие.Контекст = КритерииОценкиПоставщиковЭксперты.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО (КритерииОценкиПоставщиковЭксперты.Эксперт = Пользователи.ФизическоеЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ НЕЗавершенныеЗадачи КАК СостояниеОценкиОбъектов
			|		ПО (СостояниеОценкиОбъектов.Владелец = Мероприятие.Ссылка)
			|			И (СостояниеОценкиОбъектов.ОтветственноеФизЛицо = Пользователи.Ссылка.ФизическоеЛицо)
			|ГДЕ
			|	Мероприятие.ПометкаУдаления = ЛОЖЬ
			|	И Мероприятие.Контекст.ПометкаУдаления = ЛОЖЬ
			|
			|СГРУППИРОВАТЬ ПО
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.Организация,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.Периодичность,
			|	Пользователи.Ссылка,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.ГлубинаАнализа,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.ФункциональноеНаправления,
			|	СостояниеОценкиОбъектов.Завершен,
			|	Мероприятие.Ссылка,
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.Дата,
			|	СостояниеОценкиОбъектов.Владелец
			|
			|УПОРЯДОЧИТЬ ПО
			|	КритерииОценкиПоставщиковЭксперты.Ссылка.Дата УБЫВ";
			
			ЭтотОбъект.МероприятияОценкиПоставщиков.ДинамическоеСчитываниеДанных = Ложь;
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ЭтотОбъект.МероприятияОценкиПоставщиков.Отбор, "Ответственный", текПользователи, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
			ГрМероприятияОценкиПоставщиков = ЭтотОбъект.Элементы.Добавить("ГрМероприятияОценкиПоставщиков", Тип("ГруппаФормы"), ГрЭлементыСогласования);
			ГрМероприятияОценкиПоставщиков.Вид  = ВидГруппыФормы.Страница;
			ГрМероприятияОценкиПоставщиков.Заголовок = Нстр("ru = 'Оценка поставщиков'");
			ГрМероприятияОценкиПоставщиков.Подсказка = Нстр("ru = 'Оценка поставщиков'");
			
			МероприятияОценкиПоставщиковТаблицаФормы = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиков", Тип("ТаблицаФормы"), ГрМероприятияОценкиПоставщиков);	
			МероприятияОценкиПоставщиковТаблицаФормы.ПутьКДанным = "МероприятияОценкиПоставщиков";	
			МероприятияОценкиПоставщиковТаблицаФормы.ИзменятьСоставСтрок = Ложь;
			МероприятияОценкиПоставщиковТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			#Вставка
			Попытка
#КонецВставки
			МероприятияОценкиПоставщиковКолонка = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиковОрганизация", Тип("ПолеФормы"), МероприятияОценкиПоставщиковТаблицаФормы);       
			МероприятияОценкиПоставщиковКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			МероприятияОценкиПоставщиковКолонка.ПутьКДанным = "МероприятияОценкиПоставщиков.Организация";
			МероприятияОценкиПоставщиковКолонка.Заголовок = Нстр("ru = 'Организация'");
			
			МероприятияОценкиПоставщиковКолонка = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиковЗавершен", Тип("ПолеФормы"), МероприятияОценкиПоставщиковТаблицаФормы);       
			МероприятияОценкиПоставщиковКолонка.Вид = ВидПоляФормы.ПолеФлажка;
			МероприятияОценкиПоставщиковКолонка.ПутьКДанным = "МероприятияОценкиПоставщиков.Завершен";
			МероприятияОценкиПоставщиковКолонка.Заголовок = Нстр("ru = 'Оценка завершена'");
			
			МероприятияОценкиПоставщиковКолонка = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиковФункциональноеНаправление", Тип("ПолеФормы"), МероприятияОценкиПоставщиковТаблицаФормы);       
			МероприятияОценкиПоставщиковКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			МероприятияОценкиПоставщиковКолонка.ПутьКДанным = "МероприятияОценкиПоставщиков.ФункциональноеНаправление";
			
			МероприятияОценкиПоставщиковКолонка = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиковПериодичность", Тип("ПолеФормы"), МероприятияОценкиПоставщиковТаблицаФормы);       
			МероприятияОценкиПоставщиковКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			МероприятияОценкиПоставщиковКолонка.ПутьКДанным = "МероприятияОценкиПоставщиков.Периодичность";
			
			МероприятияОценкиПоставщиковКолонка = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиковГлубинаАнализа", Тип("ПолеФормы"), МероприятияОценкиПоставщиковТаблицаФормы);       
			МероприятияОценкиПоставщиковКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			МероприятияОценкиПоставщиковКолонка.ПутьКДанным = "МероприятияОценкиПоставщиков.ГлубинаАнализа";
			
			МероприятияОценкиПоставщиковКолонка = ЭтотОбъект.Элементы.Добавить("МероприятияОценкиПоставщиковМероприятиеПоОценке", Тип("ПолеФормы"), МероприятияОценкиПоставщиковТаблицаФормы);       
			МероприятияОценкиПоставщиковКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			МероприятияОценкиПоставщиковКолонка.ПутьКДанным = "МероприятияОценкиПоставщиков.МероприятиеПоОценке";
			
			МероприятияОценкиПоставщиковТаблицаФормы.УстановитьДействие("Выбор", "МероприятияОценкиПоставщиковВыбор");
			
			ДополнительныеУсловияПрочее = ДополнительныеУсловияПрочее + "
			|	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Справочник.Лоты";
			Элементы.Переместить(ГрМероприятияОценкиПоставщиков,Элементы.ЭлементыСогласования,Элементы.ГрПрочее);
		#Вставка     
			Исключение
			КонецПопытки;
#КонецВставки	
		КонецЕсли;
		
		
		//МероприятияОценкиПоставщиков
		Если ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "РегистрыСведений", "СостояниеОценкиОбъектов") 
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ПредложениеПоставщика")
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Справочники", "Пользователи") Тогда
			
			ОповещенияОценкиПредложений = Новый РеквизитФормы("ОповещенияОценкиПредложений", Новый ОписаниеТипов("ДинамическийСписок"),, НСтр("ru = 'Оповещения оценки предложений'"), Ложь);
			
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(ОповещенияОценкиПредложений);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ЭтотОбъект.ОповещенияОценкиПредложений.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			                                                      |	РегистрСведенийОповещенияПользователей.Пользователь КАК Пользователь,
			                                                      |	РегистрСведенийОповещенияПользователей.Прочитано КАК Прочитано,
			                                                      |	РегистрСведенийОповещенияПользователей.ВидОповещения КАК ВидОповещения,
			                                                      |	РегистрСведенийОповещенияПользователей.ДатаСоздания КАК ДатаСоздания,
			                                                      |	ВЫБОР
			                                                      |		КОГДА НЕ РегистрСведенийОповещенияПользователей.Прочитано
			                                                      |			ТОГДА 0
			                                                      |		ИНАЧЕ 1
			                                                      |	КОНЕЦ КАК ИндексПрочитано,
			                                                      |	РегистрСведенийОповещенияПользователей.Тема КАК Тема,
			                                                      |	РегистрСведенийОповещенияПользователей.КатегорияОповещений КАК КатегорияОповещений,
			                                                      |	РегистрСведенийОповещенияПользователей.Задача КАК Задача,
			                                                      |	РегистрСведенийОповещенияПользователей.Задача.СвязанныйОбъект КАК Ссылка,
			                                                      |	ВЫБОР
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Задача = НЕОПРЕДЕЛЕНО
			                                                      |				ИЛИ РегистрСведенийОповещенияПользователей.Задача = ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
			                                                      |				ИЛИ РегистрСведенийОповещенияПользователей.Задача ЕСТЬ NULL
			                                                      |				ИЛИ ЕСТЬNULL(ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача, ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Задача) ЕСТЬ NULL
			                                                      |			ТОГДА -1
			                                                      |		ИНАЧЕ ВЫБОР
			                                                      |				КОГДА НЕ ЕСТЬNULL(ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Выполнено, ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Выполнено)
			                                                      |					ТОГДА 0
			                                                      |				ИНАЧЕ -1
			                                                      |			КОНЕЦ
			                                                      |	КОНЕЦ КАК НомерКартинкиСтатусЗадачи,
			                                                      |	ВЫБОР
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Прочитано
			                                                      |			ТОГДА 1
			                                                      |		ИНАЧЕ 0
			                                                      |	КОНЕЦ КАК НомерКартинкиСтроки,
			                                                      |	ВЫБОР
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Задача = НЕОПРЕДЕЛЕНО
			                                                      |				ИЛИ РегистрСведенийОповещенияПользователей.Задача = ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
			                                                      |				ИЛИ РегистрСведенийОповещенияПользователей.Задача ЕСТЬ NULL
			                                                      |				ИЛИ ЕСТЬNULL(ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача, ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Задача) ЕСТЬ NULL
			                                                      |			ТОГДА ЛОЖЬ
			                                                      |		ИНАЧЕ НЕ ЕСТЬNULL(ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Выполнено, ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Выполнено)
			                                                      |	КОНЕЦ КАК ЗадачаАктивна,
			                                                      |	ВЫБОР
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Красный)
			                                                      |			ТОГДА 1
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Синий)
			                                                      |			ТОГДА 2
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Желтый)
			                                                      |			ТОГДА 3
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Зеленый)
			                                                      |			ТОГДА 4
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Оранжевый)
			                                                      |			ТОГДА 5
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Лиловый)
			                                                      |			ТОГДА 6
			                                                      |		КОГДА РегистрСведенийОповещенияПользователей.Флажок = ЗНАЧЕНИЕ(Перечисление.ЦветаФлажковОповещений.Серый)
			                                                      |			ТОГДА 7
			                                                      |		ИНАЧЕ 0
			                                                      |	КОНЕЦ КАК НомерКартинкиФлажка,
			                                                      |	РегистрСведенийОповещенияПользователей.Флажок КАК Флажок,
			                                                      |	ЕСТЬNULL(ЕСТЬNULL(ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ВидДействия, ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.ВидДействия), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ПустаяСсылка)) КАК ВидДействия,
			                                                      |	"""" КАК НадписьДекорация,
			                                                      |	ТИПЗНАЧЕНИЯ(НЕОПРЕДЕЛЕНО) КАК ТипКлючевогоОбъекта,
			                                                      |	ТИПЗНАЧЕНИЯ(РегистрСведенийОповещенияПользователей.Задача.СвязанныйОбъект) КАК ТипОбъектаОповещения
			                                                      |ИЗ
			                                                      |	РегистрСведений.ОповещенияПользователей КАК РегистрСведенийОповещенияПользователей
			                                                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних
			                                                      |		ПО РегистрСведенийОповещенияПользователей.Задача = ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача
			                                                      |			И (РегистрСведенийОповещенияПользователей.Задача <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка))
			                                                      |			И РегистрСведенийОповещенияПользователей.Пользователь = ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Ответственный
			                                                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних(
			                                                      |				,
			                                                      |				ВЫБОР
			                                                      |					КОГДА &ЕстьУточнениеЗамещения
			                                                      |						ТОГДА Задача В (&ЗадачиЗамещаемых)
			                                                      |					ИНАЧЕ ИСТИНА
			                                                      |				КОНЕЦ) КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение
			                                                      |		ПО РегистрСведенийОповещенияПользователей.Задача = ОтложеннаяОбработкаЭтаповПроцессовСрезПоследнихЗамещение.Задача
			                                                      |			И (РегистрСведенийОповещенияПользователей.Задача <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка))
			                                                      |ГДЕ
			                                                      |	РегистрСведенийОповещенияПользователей.Пользователь = &Ответственный
			                                                      |	И РегистрСведенийОповещенияПользователей.ВидОповещения = &ВидОповещения";
			
			ЭтотОбъект.ОповещенияОценкиПредложений.ДинамическоеСчитываниеДанных = Ложь; 
			ЭтотОбъект.ОповещенияОценкиПредложений.Параметры.УстановитьЗначениеПараметра("ВидОповещения", Справочники.ВидыСобытийОповещений.ОценкаПредложенийПоставщиков);
			ЭтотОбъект.ОповещенияОценкиПредложений.Параметры.УстановитьЗначениеПараметра("Ответственный", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
			ЭтотОбъект.ОповещенияОценкиПредложений.ОсновнаяТаблица = "РегистрСведений.ОповещенияПользователей";
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ЭтотОбъект.ОповещенияОценкиПредложений.Отбор, "Ответственный", текПользователи, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
			ГрОценкаПредложенийПоставщиков = ЭтотОбъект.Элементы.Добавить("ГрОценкаПредложенийПоставщиков", Тип("ГруппаФормы"), ГрЭлементыСогласования);
			ГрОценкаПредложенийПоставщиков.Вид  = ВидГруппыФормы.Страница;
			ГрОценкаПредложенийПоставщиков.Заголовок = Нстр("ru = 'Оценка предложений поставщиков'");
			ГрОценкаПредложенийПоставщиков.Подсказка = Нстр("ru = 'Оценка предложений поставщиков'");
			ГрОценкаПредложенийПоставщиков.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			
			ТекущееОповещениеОценкиПредложений = Новый РеквизитФормы("ТекущееОповещениеОценкиПредложений", Новый ОписаниеТипов("Строка"),, , Ложь);
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(ТекущееОповещениеОценкиПредложений);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
			
			ОповещенияОценкиПредложений = ЭтотОбъект.Элементы.Добавить("ОценкаПредложенийПоставщиков", Тип("ТаблицаФормы"), ГрОценкаПредложенийПоставщиков);	
			ОповещенияОценкиПредложений.ПутьКДанным = "ОповещенияОценкиПредложений";	
			ОповещенияОценкиПредложений.ИзменятьСоставСтрок = Ложь;
			ОповещенияОценкиПредложений.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
			ГруппаCообщение1 = ЭтотОбъект.Элементы.Добавить("ГруппаCообщение1", Тип("ГруппаФормы"), ГрОценкаПредложенийПоставщиков);
			ГруппаCообщение1.Вид  = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаCообщение1.ОтображатьЗаголовок = Ложь;       
			
			ТекущееОповещениеОценкиПредложенийЭлемент = ЭтотОбъект.Элементы.Добавить("ТекущееОповещениеОценкиПредложений", Тип("ПолеФормы"), ГруппаCообщение1);	
			ТекущееОповещениеОценкиПредложенийЭлемент.ПутьКДанным = "ТекущееОповещениеОценкиПредложений";	
			ТекущееОповещениеОценкиПредложенийЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ТекущееОповещениеОценкиПредложенийЭлемент.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			ТекущееОповещениеОценкиПредложенийЭлемент.УстановитьДействие("ПриНажатии","ТекущееОповещениеОценкиПредложенийПриНажатии");
			
			ОповещенияОценкиПредложенийКолонка = ЭтотОбъект.Элементы.Добавить("ОповещенияОценкиПредложенийДатаСоздания", Тип("ПолеФормы"), ОповещенияОценкиПредложений);       
			ОповещенияОценкиПредложенийКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОповещенияОценкиПредложенийКолонка.ПутьКДанным = "ОповещенияОценкиПредложений.ДатаСоздания";
			ОповещенияОценкиПредложенийКолонка.Заголовок = Нстр("ru = 'Дата создания'");
			//
			ОповещенияОценкиПредложенийКолонка = ЭтотОбъект.Элементы.Добавить("ОповещенияОценкиПредложенийТема", Тип("ПолеФормы"), ОповещенияОценкиПредложений);       
			ОповещенияОценкиПредложенийКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОповещенияОценкиПредложенийКолонка.ПутьКДанным = "ОповещенияОценкиПредложений.Тема";
			ОповещенияОценкиПредложенийКолонка.Заголовок = Нстр("ru = 'Заголовок'");

			ОповещенияОценкиПредложенийКолонка = ЭтотОбъект.Элементы.Добавить("ОповещенияОценкиПредложенийКатегорияОповещений", Тип("ПолеФормы"), ОповещенияОценкиПредложений);       
			ОповещенияОценкиПредложенийКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОповещенияОценкиПредложенийКолонка.ПутьКДанным = "ОповещенияОценкиПредложений.КатегорияОповещений";
			ОповещенияОценкиПредложенийКолонка.Заголовок = Нстр("ru = 'Категория'");

			ОповещенияОценкиПредложенийКолонка = ЭтотОбъект.Элементы.Добавить("ОповещенияОценкиПредложенийЗадача", Тип("ПолеФормы"), ОповещенияОценкиПредложений);       
			ОповещенияОценкиПредложенийКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОповещенияОценкиПредложенийКолонка.ПутьКДанным = "ОповещенияОценкиПредложений.Задача";
			ОповещенияОценкиПредложенийКолонка.Заголовок = Нстр("ru = 'Задача'");
			Элементы.ОповещенияОценкиПредложенийЗадача.Видимость = Ложь;

			ОповещенияОценкиПредложенийКолонка = ЭтотОбъект.Элементы.Добавить("ОповещенияОценкиПредложенийПрочитано", Тип("ПолеФормы"), ОповещенияОценкиПредложений);       
			ОповещенияОценкиПредложенийКолонка.Вид = ВидПоляФормы.ПолеФлажка;
			ОповещенияОценкиПредложенийКолонка.ПутьКДанным = "ОповещенияОценкиПредложений.Прочитано";
			ОповещенияОценкиПредложенийКолонка.Заголовок = Нстр("ru = 'Прочитано'");
			
			ОповещенияОценкиПредложений.УстановитьДействие("Выбор", "ОповещенияОценкиПредложенийВыбор"); 
			ОповещенияОценкиПредложений.УстановитьДействие("ПриАктивизацииСтроки", "ОповещенияОценкиПредложенийПриАктивизацииСтроки");
			Элементы.Переместить(ГрОценкаПредложенийПоставщиков,Элементы.ЭлементыСогласования,Элементы.ГрПрочее);
			
			ВыводимыеДинамическиеСписки.Добавить("ОповещенияОценкиПредложений");
		КонецЕсли;
			
			
	КонецЕсли;
	
	Если ПодсистемаПланированиеИКонтрольСлужебный тогда
		
		//Оперативный план
		Если ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "РегистрыСведений", "ОтложеннаяОбработкаЭтаповПроцессов") 
			И ОбщегоНазначенияУХ.ПравоДоступаКОбъекту("Чтение", "Документы", "ОперативныйПлан") Тогда
			
			ОперативныйПланРеквизит = Новый РеквизитФормы("ОперативныйПлан", Новый ОписаниеТипов("ДинамическийСписок"),, НСтр("ru = 'Оперативный план'"), Ложь);
			
			ДобавляемыеРеквизиты.Очистить();
			ДобавляемыеРеквизиты.Добавить(ОперативныйПланРеквизит);	
			ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ЭтотОбъект.ОперативныйПлан.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                                          |	ЗадачиУниверсальныхПроцессов.Ответственный КАК Ответственный,
			                                          |	ОперативныйПлан.Ссылка КАК Ссылка,
			                                          |	ОперативныйПлан.Номер КАК Номер,
			                                          |	ОперативныйПлан.Дата КАК Дата,
			                                          |	ОперативныйПлан.Организация КАК Организация,
			                                          |	ОперативныйПлан.Контрагент КАК Контрагент,
			                                          |	ОперативныйПлан.ДоговорКонтрагента КАК ДоговорКонтрагента,
			                                          |	ОперативныйПлан.Проект КАК Проект,
			                                          |	ОперативныйПлан.ВалютаДокумента КАК ВалютаДокумента,
			                                          |	ОперативныйПлан.СуммаДокумента КАК СуммаДокумента,
			                                          |	ОперативныйПлан.СуммаДокументаУпр КАК СуммаДокументаУпр,
			                                          |	ОперативныйПлан.ВидБюджета КАК ВидБюджета,
			                                          |	ОперативныйПлан.ВариантНастройки КАК ВариантНастройки,
			                                          |	ОперативныйПлан.ПериодОтчета КАК ПериодОтчета,
			                                          |	ОперативныйПлан.ЦФО КАК ЦФО,
			                                          |	ОперативныйПлан.МестоПоставки КАК МестоПоставки,
			                                          |	ЗадачиУниверсальныхПроцессов.ВидДействия КАК ВидДействия,
			                                          |	ЗадачиУниверсальныхПроцессов.Задача КАК Задача
			                                          |ИЗ
			                                          |	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
			                                          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперативныйПлан КАК ОперативныйПлан
			                                          |		ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ОперативныйПлан.Ссылка
			                                          |ГДЕ
			                                          |	ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
			                                          |	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
			                                          |	И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
			                                          |	И ВЫБОР
			                                          |			КОГДА &ЕстьУточнениеЗамещения
			                                          |				ТОГДА ВЫБОР
			                                          |						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
			                                          |							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
			                                          |						ИНАЧЕ ИСТИНА
			                                          |					КОНЕЦ
			                                          |			ИНАЧЕ ИСТИНА
			                                          |		КОНЕЦ";
			
			ЭтотОбъект.ОперативныйПлан.ОсновнаяТаблица = "РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов";
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ЭтотОбъект.ОперативныйПлан.Отбор, "Ответственный", текПользователи, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
			ГрОперативныйПлан = ЭтотОбъект.Элементы.Добавить("ГрОперативныйПлан", Тип("ГруппаФормы"), ГрЭлементыСогласования);
			ГрОперативныйПлан.Вид  = ВидГруппыФормы.Страница;
			ГрОперативныйПлан.Заголовок = Нстр("ru = 'Оперативный план'");
			ГрОперативныйПлан.Подсказка = Нстр("ru = 'Оперативный план'");
			
			Элементы.Переместить(ГрОперативныйПлан, ГрЭлементыСогласования, Элементы.ГрНастраиваемыйОтчет);
			
			ОперативныйПланТаблицаФормы = ЭтотОбъект.Элементы.Добавить("ОперативныйПлан", Тип("ТаблицаФормы"), ГрОперативныйПлан);	
			ОперативныйПланТаблицаФормы.ПутьКДанным = "ОперативныйПлан";	
			ОперативныйПланТаблицаФормы.ИзменятьСоставСтрок = Ложь;
			ОперативныйПланТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ОперативныйПланТаблицаФормы.Видимость = Ложь;
 #Вставка  
 			Попытка
 #КонецВставки			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланВидБюджета", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.ВидБюджета";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланНомер", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Номер";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланДата", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Дата";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланВидОперативногоПлана", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.ВариантНастройки";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланДоговорКонтрагента", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.ДоговорКонтрагента";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланКонтрагент", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Контрагент";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланОрганизация", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Организация";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланОтветственный", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Ответственный";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланПериодОтчета", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.ПериодОтчета";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланПроект", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Проект";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланМестоПоставки", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.МестоПоставки";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланВалютаДокумента", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.ВалютаДокумента";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланСуммаДокумента", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.СуммаДокумента";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланСуммаДокументаУпр", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.СуммаДокументаУпр";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланЦФО", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.ЦФО";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланСсылка", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеНадписи;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.Ссылка";
			
			ОперативныйПланКолонка = ЭтотОбъект.Элементы.Добавить("ОперативныйПланСтандартнаяКартинка", Тип("ПолеФормы"), ОперативныйПланТаблицаФормы);       
			ОперативныйПланКолонка.Вид = ВидПоляФормы.ПолеКартинки;
			ОперативныйПланКолонка.ПутьКДанным = "ОперативныйПлан.СтандартнаяКартинка";
			ОперативныйПланКолонка.Видимость = Ложь;
			
			ЭтотОбъект.ОперативныйПлан.УстановитьОбязательноеИспользование("ВидДействия", Истина);
			ЭтотОбъект.ОперативныйПлан.УстановитьОбязательноеИспользование("Задача", Истина);
			ЭтотОбъект.ОперативныйПлан.УстановитьОбязательноеИспользование("Ответственный", Истина);
			
			ОперативныйПланТаблицаФормы.УстановитьДействие("Выбор", "ОперативныйПланВыбор");
			ОперативныйПланТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки", "ОперативныйПланПриАктивизацииСтроки");
			
			ДополнительныеУсловияПрочее = ДополнительныеУсловияПрочее + "
			|	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.ОперативныйПлан";
			
			ВыводимыеДинамическиеСписки.Добавить("ОперативныйПлан");
		#Вставка     
			Исключение	
            КонецПопытки;
#КонецВставки	
		КонецЕсли;
		
	КонецЕсли;
		
	Прочее.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект КАК Ссылка,
	                      |	ЗадачиУниверсальныхПроцессов.Ответственный КАК Ответственный,
	                      |	ЗадачиУниверсальныхПроцессов.ВидДействия КАК ВидДействия,
	                      |	ВЫРАЗИТЬ(ЗадачиУниверсальныхПроцессов.ТипКлючевогоОбъекта.Синоним КАК СТРОКА(150)) КАК ТипКлючевогоОбъекта,
	                      |	ЗадачиУниверсальныхПроцессов.Задача КАК Задача
	                      |ИЗ
	                      |	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
	                      |ГДЕ
	                      |	ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
	                      |	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
	                      |	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.РакурсДанных
	                      |	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Справочник.ДоговорыКонтрагентов
	                      |	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.ЗаявкаНаИзменениеНСИ
	                      |	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Справочник.Проекты
	                      |	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.НастраиваемыйОтчет
						  #Вставка
	|	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.АвансовыйОтчет
	|	И НЕ ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект ССЫЛКА Документ.ИИТ_ЗаявкаНаЗакуп
#КонецВставки
	                      |	И ВЫБОР
	                      |			КОГДА &ЕстьУточнениеЗамещения
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
	                      |							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
	                      |						ИНАЧЕ ИСТИНА
	                      |					КОНЕЦ
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ   
	                      |	И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ" + ДополнительныеУсловияПрочее;    
#Вставка
	//+ИИТ_Аксеньюшкин
	Элементы.ГрПрочее.Видимость = Ложь;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	
	ВыводимыеДинамическиеСписки.Добавить("Прочее");
	
	Для Каждого Стр Из ВыводимыеДинамическиеСписки Цикл
	
		Если Стр.Значение <> "ОповещенияОценкиПредложений" Тогда 
			ЭтотОбъект[Стр.Значение].Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
		КонецЕсли;
		ЭтотОбъект[Стр.Значение].Параметры.УстановитьЗначениеПараметра("ЕстьУточнениеЗамещения", ЕстьУточнениеЗамещения);
		ЭтотОбъект[Стр.Значение].Параметры.УстановитьЗначениеПараметра("ЗадачиЗамещаемых", ЗадачиЗамещаемых.ВыгрузитьЗначения());
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
&ИзменениеИКонтроль("ВернутьСтруктуруДоступностиКоманд")
Функция АЛФ_ВернутьСтруктуруДоступностиКоманд(СтруктураКлючейВход, ИмяТекущейТаблицыВход)
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ДоступностьСогласованиеДокумента", Истина);
	РезультатФункции.Вставить("ДоступностьМаршрутСогласования", Истина);
	РезультатФункции.Вставить("ДоступностьИсторияСогласования", Истина);
	РезультатФункции.Вставить("ДоступностьДополнительноеСогласование", Истина);
	Если СтруктураКлючейВход.Количество() > 0 Тогда
		// Вспомогательная логика.
		ТекПользователь = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь");
		ВыбранаЗакладкаОповещений = (ИмяТекущейТаблицыВход = "ТекущиеОповещенияСписок");
		ЭтоЗадачаВыборЭтапа		 = (СтруктураКлючейВход.ТипЗадачи = Справочники.ВидыСобытийОповещений.ТребуетсяВыборЭтапа);
		ЭтоЗадачаСогласование	 = (СтруктураКлючейВход.ТипЗадачи = Справочники.ВидыСобытийОповещений.ТребуетсяСогласование);
		ЭтоЗадачаОбработки		 = (СтруктураКлючейВход.ТипЗадачи = Справочники.ВидыСобытийОповещений.ТребуетсяОбработка);
		РежимСогласования = (ЭтоЗадачаВыборЭтапа) ИЛИ (ЭтоЗадачаСогласование) ИЛИ (ЭтоЗадачаОбработки) ИЛИ (НЕ ВыбранаЗакладкаОповещений);
		НесколькоЗадач = (СтруктураКлючейВход.СписокЗадач.Количество() > 1);
		// Вычисление доступности команд.  
		ДоступностьКомандыЗавершенияЗадачи		 = ОпределитьДоступностьКомандыЗавершенияЗадачи(СтруктураКлючейВход, ИмяТекущейТаблицыВход);
		ДоступностьМаршрутСогласования			 = (РежимСогласования) И (НЕ НесколькоЗадач);
		ДоступностьИсторияСогласования			 = (РежимСогласования) И (НЕ НесколькоЗадач);

		ОбъектСсылкаВход = Неопределено;
		Если СтруктураКлючейВход.СписокСсылок.Количество() = 1 Тогда
			ОбъектСсылкаВход = СтруктураКлючейВход.СписокСсылок[0].Значение;
		КонецЕсли;
		ДоступностьДополнительноеСогласование	 = ОпределитьДоступностьКомандыДополнительногоСогласования(СтруктураКлючейВход.СписокЗадач, ТекПользователь, ОбъектСсылкаВход);
		// Вывод результата в структуру.
		РезультатФункции.Вставить("ДоступностьСогласованиеДокумента", ДоступностьКомандыЗавершенияЗадачи);
		РезультатФункции.Вставить("ДоступностьМаршрутСогласования", ДоступностьМаршрутСогласования);
		РезультатФункции.Вставить("ДоступностьИсторияСогласования", ДоступностьИсторияСогласования);
		РезультатФункции.Вставить("ДоступностьДополнительноеСогласование", ДоступностьДополнительноеСогласование);
	Иначе
		РезультатФункции.Вставить("ДоступностьСогласованиеДокумента", Истина);
		РезультатФункции.Вставить("ДоступностьМаршрутСогласования", Истина);
		РезультатФункции.Вставить("ДоступностьИсторияСогласования", Истина);
		РезультатФункции.Вставить("ДоступностьДополнительноеСогласование", Истина);
	КонецЕсли;  
	#Вставка
	//+ИИТ_Аксеньюшкин
	Если ИмяТекущейТаблицыВход = "ИИТ_ЗаявкиНаЗакуп" Тогда
		РезультатФункции.Вставить("ДоступностьСогласованиеДокумента", Истина);
		РезультатФункции.Вставить("ДоступностьМаршрутСогласования", Истина);
		РезультатФункции.Вставить("ДоступностьИсторияСогласования", Истина);
		РезультатФункции.Вставить("ДоступностьДополнительноеСогласование", Истина);
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	Возврат РезультатФункции;
КонецФункции

