
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ГруппаФормы_АЛФ = Элементы.Добавить("АльфаСтрой_группа", Тип("ГруппаФормы"), Элементы.ГруппаНастройкиПлатежныхПорученийТребований);
	ГруппаФормы_АЛФ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьКодСметыБанка", Тип("ПолеФормы"), ГруппаФормы_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Использовать код сметы банка";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ИспользоватьКодСметыБанка";
	
	ПолеВвода_АЛФ = Элементы.Добавить("Ответственный", Тип("ПолеФормы"), ГруппаФормы_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Ответственный";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.Ответственный";
	
КонецПроцедуры
