
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаФормы_АЛФ = Элементы.Добавить("АльфаСтрой_группа", Тип("ГруппаФормы"), );
	ГруппаФормы_АЛФ.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы_АЛФ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЯвляетсяБригадой", Тип("ПолеФормы"), ГруппаФормы_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Является бригадой";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ЯвляетсяБригадой";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ЯвляетсяБригадойПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Бригадир", Тип("ПолеФормы"), ГруппаФормы_АЛФ);
	ПолеВвода_АЛФ.Заголовок = "Бригадир";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Бригадир";   
	
	УстановитьВидимостьБригады();

КонецПроцедуры

&НаКлиенте
Процедура ИИТ_ЯвляетсяБригадойПриИзменении(Элемент)
	УстановитьВидимостьБригады();
КонецПроцедуры

Процедура УстановитьВидимостьБригады()
	Элементы.ИИТ_Бригадир.Видимость = Объект.ИИТ_ЯвляетсяБригадой;
КонецПроцедуры