
#Область Перенос_Дораблток
 
&НаСервере
Процедура ОбновитьСтрокуВТаблице() Экспорт	

	ЭтотОбъект.Прочее.Очистить();
	НоваяСтрока = ЭтотОбъект.Прочее.Добавить();
	НоваяСтрока.ИИТ_ОбъектСтроительства = ЭтотОбъект.ИИТ_ОбъектСтроительства;
	НоваяСтрока.ИИТ_СтатьяДДС = ЭтотОбъект.ИИТ_СтатьиБбрИлиБддс;
	НоваяСтрока.ИИТ_ЭтапОбъектаСтроительства = ЭтотОбъект.ИИТ_ЭтапыСтроительства;
	НоваяСтрока.Сумма = ЭтотОбъект.ИИТ_СуммаЗаявки;
	НоваяСтрока.ИИТ_АктуальнаяСумма = ЭтотОбъект.ИИТ_СуммаАктуальная;
	НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;;
	НоваяСтрока.Содержание = Строка(ЭтотОбъект.ИИТ_СтатьиБбрИлиБддс);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
                          |	Хозрасчетный.Ссылка КАК Ссылка
                          |ИЗ
                          |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
                          |ГДЕ
                          |	Хозрасчетный.Код = &Код"); 
	Запрос.УстановитьПараметр("Код", "26");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НоваяСтрока.СчетЗатрат =  Выборка.Ссылка;
		НоваяСтрока.СчетЗатратНУ =  Выборка.Ссылка; 
	КонецЕсли;
	
КонецПроцедуры
	
 #КонецОбласти

&ИзменениеИКонтроль("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
#Вставка
	//+ИИТ_Аксеньюшкин
	Если Не ЗначениеЗаполнено(ФизЛицо) И ЗначениеЗаполнено(ИИТ_ОтветственноеЛицо) Тогда
		ФизЛицо = ИИТ_ОтветственноеЛицо.ФизическоеЛицо;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
#КонецВставки

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВозвратнуюТару")
		И ВозвратнаяТара.Количество() > 0 Тогда
		ВозвратнаяТара.Очистить();
	КонецЕсли;

	// Суточные имеют смысл только в авансовом отчете по командировке	
	Если ВидОперации <> Перечисления.ВидыОперацийАвансовыйОтчет.Командировка Тогда
		Суточные.Очистить();
	КонецЕсли; 	

	РаботаСДоговорамиКонтрагентовБП.ЗаполнитьДоговорВТабличнойЧастиПередЗаписью(ВозвратнаяТара, ЭтотОбъект);
	РаботаСДоговорамиКонтрагентовБП.ЗаполнитьДоговорВТабличнойЧастиПередЗаписью(ОплатаПоставщикам, ЭтотОбъект);

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Товары") 
	+ ОплатаПоставщикам.Итог("Сумма") 
	+ УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Прочее")
	+ Суточные.Итог("Сумма");

	Если УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата) Тогда
		НДСВключенВСтоимость = Ложь;
	КонецЕсли;

	ЗаполнитьНередактируемыеРеквизитыДляКомандировки();

	СформироватьСчетаФактуры(Отказ);

	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	СчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ЭтотОбъект, РежимЗаписи);

#Вставка     
	//+ИИТ_Аксеньюшкин
	Если ЗначениеЗаполнено(ИИТ_СуммаАктуальная) Тогда
		СуммаДокумента = ИИТ_СуммаАктуальная;
	ИначеЕсли ЗначениеЗаполнено(ИИТ_СуммаЗаявки) Тогда
		СуммаДокумента = ИИТ_СуммаЗаявки;
	КонецЕсли;

	ИИТ_ПроектСогласования = ИИТ_ОбъектСтроительства;
	//-ИИТ_Аксеньюшкин
#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись
		И НЕ ЭтоНовый()
		И НЕ РучнаяКорректировка Тогда
		ОбновитьСчетаФактуры(РежимЗаписиДокумента.Запись);
	КонецЕсли;

	ОбновитьДокументыПоКассовымЧекамПодотчетныхЛиц();

#Вставка
	//+ИИТ_Аксеньюшкин
	Если ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)
 	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.АвансовыйОтчет.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеТовары(
		ПараметрыПроведения.СтруктураТаблицДокумента.ПоступлениеТоваровТаблица);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеПрочее(
		ПараметрыПроведения.СтруктураТаблицДокумента.ПоступлениеПрочееТаблица);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеТовары(ПараметрыПроведения.ПоступлениеТарыТаблица);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеОплата(
		ПараметрыПроведения.СтруктураТаблицДокумента.ПогашениеЗадолженностиТаблица);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеТовары(ПараметрыПроведения.СтруктураТаблицДокументаНДС.ТоварыНДС);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеПрочее(ПараметрыПроведения.СтруктураТаблицДокументаНДС.УслугиНДС);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеТовары(ПараметрыПроведения.НомераГТД);
	Документы.АвансовыйОтчет.ДобавитьКолонкуСодержаниеБилеты(ПараметрыПроведения.Билеты);
	
	// Таблица валютных авансов
	ВалютныеАвансыПодотчетногоЛица = УчетВзаиморасчетов.ПодготовитьТаблицуВалютныеАвансыПодотчетногоЛица(
		ПараметрыПроведения.ВалютныеАвансыПодотчетногоЛицаТаблицаДокумента,
		ПараметрыПроведения.ТаблицаЗачетАвансов,
		ПараметрыПроведения.ВалютныеАвансыПодотчетногоЛицаРеквизиты,
		Отказ);
	
	// Таблицы документа с корректировкой сумм по курсу авансов
	СтруктураТаблицДокумента = УчетДоходовРасходов.ПодготовитьТаблицыАвансовогоОтчетаПоКурсуАвансов(
		ПараметрыПроведения.СтруктураТаблицДокумента,
		ВалютныеАвансыПодотчетногоЛица,
		ПараметрыПроведения.ВалютныеАвансыПодотчетногоЛицаРеквизиты);
	
	СтруктураТаблицДокументаНДС = УчетДоходовРасходов.ПодготовитьТаблицыАвансовогоОтчетаПоКурсуАвансов(
		ПараметрыПроведения.СтруктураТаблицДокументаНДС,
		ВалютныеАвансыПодотчетногоЛица,
		ПараметрыПроведения.ВалютныеАвансыПодотчетногоЛицаРеквизиты);
	
	ТаблицаВзаиморасчетов     = УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности(
		СтруктураТаблицДокумента.ПогашениеЗадолженностиТаблица, ПараметрыПроведения.ПогашениеЗадолженности, Отказ);
	
	ТаблицаСуммовыхРазниц     = УчетНДС.ПодготовитьТаблицуСуммовыхРазниц(ТаблицаВзаиморасчетов,
		ПараметрыПроведения.Реквизиты, Отказ);
		
	// Учет доходов и расходов ИП
	ТаблицаТоваровИП          = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступленияМПЗ(
		ПараметрыПроведения.ПоступлениеМПЗИПТаблицаТоваров,
		ПараметрыПроведения.Реквизиты);
	
	ТаблицаПрочееИП           = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступленияМПЗ(
		ПараметрыПроведения.ПоступлениеМПЗИПТаблицаПрочее,
		ПараметрыПроведения.Реквизиты);
	
	СтруктураТаблицМПЗ        = Новый Структура("ТаблицаТоваров, ТаблицаПрочее",
		ТаблицаТоваровИП, ТаблицаПрочееИП);
	
	ТаблицыОплатыПоставщикуИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыОплатыПоставщику(
		ТаблицаВзаиморасчетов, ПараметрыПроведения.ПогашениеЗадолженности);
		
	ТаблицаОплатыОСиНМА = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуОплатыОСиНМА(
		ТаблицыОплатыПоставщикуИП, 
		ПараметрыПроведения.ПогашениеЗадолженности);
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	// Алгоритмы формирования проводок этого документа учитывают малоценку
	Движения.Хозрасчетный.ДополнительныеСвойства.Вставить("ДвиженияПоМалоценнымОбъектамСформированы", Истина);
	
	// Поступление товаров
	УчетТоваров.СформироватьДвиженияПоступлениеТоваров(
		СтруктураТаблицДокумента.ПоступлениеТоваровТаблица, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// Поступление возвратной тары
	УчетТоваров.СформироватьДвиженияПоступлениеТарыНесколькоКонтрагентов(
		ПараметрыПроведения.ПоступлениеТарыТаблица, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// Поступление прочее
	УчетДоходовРасходов.СформироватьДвиженияПоступлениеУслуг(
		СтруктураТаблицДокумента.ПоступлениеПрочееТаблица, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	// Суточные
	Документы.АвансовыйОтчет.СформироватьРасходыНаСуточные(ПараметрыПроведения.Реквизиты, Движения);
		
	// Билеты
	Документы.АвансовыйОтчет.СформироватьРасходыПоИспользованнымБилетам(
		ПараметрыПроведения.Билеты, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	//Движения регистра "Рублевые суммы документов в валюте"
	УчетНДСБП.СформироватьДвиженияРублевыеСуммыДокументовВВалютеПоступлениеСобственныхТоваровУслуг(
		СтруктураТаблицДокумента.ПоступлениеТоваровТаблица,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетНДСБП.СформироватьДвиженияРублевыеСуммыДокументовВВалютеБезНДС(СтруктураТаблицДокумента.ПогашениеЗадолженностиТаблица, 
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	//Табличная часть "Прочее"
	УчетНДСБП.СформироватьДвиженияРублевыеСуммыДокументовВВалютеПоступлениеСобственныхТоваровУслуг(
		СтруктураТаблицДокумента.ПоступлениеПрочееТаблица,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// НДС
	УчетНДС.СформироватьДвиженияПоступлениеТоваровУслугОтПодотчетногоЛица(
		СтруктураТаблицДокументаНДС.ТоварыНДС, СтруктураТаблицДокументаНДС.УслугиНДС, ПараметрыПроведения.НомераГТД,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетНДСРаздельный.СформироватьДвиженияПоступлениеТоваровУслугОтПодотчетногоЛица(
		СтруктураТаблицДокументаНДС.ТоварыНДС, СтруктураТаблицДокументаНДС.УслугиНДС,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
				
	УчетНДС.СформироватьДвиженияКурсовыеРазницыНалоговыйАгент(
		ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчетов, Движения, Отказ);
	
	УчетНДСРаздельный.СформироватьДвиженияКурсовыеРазницыНалоговыйАгент(
		ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчетов, Движения, Отказ);
		
	УчетНДС.СформироватьДвиженияИспользованиеБилетов(
		ПараметрыПроведения.Билеты, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	УчетНДСРаздельный.СформироватьДвиженияИспользованиеБилетов(
		ПараметрыПроведения.Билеты, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	// Оплата
	УчетВзаиморасчетов.СформироватьДвиженияПогашениеЗадолженности(ТаблицаВзаиморасчетов,
		ПараметрыПроведения.ПогашениеЗадолженности, Движения, Отказ);
	
	УчетДоходовРасходов.СформироватьДвиженияСуммовыеРазницыРасчетыВУЕ(ТаблицаСуммовыхРазниц,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// УСН
	СуммаСторноРасхода = 0;
	УчетУСН.ПоступлениеРасходовУСН(ПараметрыПроведения.ПоступлениеРасходовУСНТаблицаРасходов, 
		ПараметрыПроведения.ПоступлениеРасходовУСНРеквизиты, СуммаСторноРасхода, Движения, Отказ);
		
	Если НЕ Отказ И Движения.РасходыПриУСН.Количество() > 0 Тогда
		Движения.РасходыПриУСН.Записать(Истина);
		Движения.РасходыПриУСН.Записывать = Ложь;
	КонецЕсли; 
	
	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСН = Новый Структура("ТаблицаРасчетов, ТаблицаБилетов", ТаблицаВзаиморасчетов, ПараметрыПроведения.Билеты);
	
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);
	
	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПоступлениеМПЗ(СтруктураТаблицМПЗ,
		ПараметрыПроведения.ПоступлениеМПЗИПТаблицаВзаиморасчетов,, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияОплатаПоставщику(
		ТаблицыОплатыПоставщикуИП,
		ПараметрыПроведения.ПогашениеЗадолженности, Движения, Отказ);
		
	УчетДоходовИРасходовПредпринимателя.РегистрацияСведенийОбОплатеОСиНМА(
		ТаблицаОплатыОСиНМА, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// Переоценка валютных остатков - после формирования проводок всеми другими механизмами
	ТаблицаПереоценка = УчетДоходовРасходов.ПодготовитьТаблицуПереоценкиДвиженийДокумента(
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовРасходов.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовРасходов.СформироватьДвиженияРасчетПереоценкиВалютныхСредств(ТаблицаПереоценка,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетУСН.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);

	// Отложенные расчеты с контрагентами.
	УчетВзаиморасчетовОтложенноеПроведение.ЗарегистрироватьОтложенныеРасчетыСКонтрагентами(
		ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);
		
	// Регистрация в последовательности
	Документы.АвансовыйОтчет.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
		ЭтотОбъект, ПараметрыПроведения, Отказ);
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
		
	Движения.Записать();
	
	ОбновитьСчетаФактуры(РежимЗаписиДокумента.Проведение);
	
#Вставка
	//+ИИТ_Аксеньюшкин
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
	|ИЗ
	|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект = &Объект) КАК РегистрСостоянийОбъектовСрезПоследних";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Статус = Строка(Выборка.СостояниеОбъекта);
	Иначе
		Статус = "";
	КонецЕсли;
	
	Если Найти(Статус, "Утвержд") > 0 Тогда
		Движение = Движения.ИИТ_ОстаткиДенежныхСредствУПодотчетников.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.ФизическоеЛицо = ИИТ_ОтветственноеЛицо.ФизическоеЛицо;
		Движение.ОбъектСтроительства = ИИТ_ОбъектСтроительства;
		Движение.Сумма = СуммаДокумента;
		Движение.Организация = Организация;
	КонецЕсли;	
	Движения.ИИТ_ОстаткиДенежныхСредствУПодотчетников.Записать();
	
	Движение = Движения.ИИТ_ОборотыПоБДР.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектСтроительства = ИИТ_ОбъектСтроительства;
	Движение.ЭтапСтроительства = ИИТ_ЭтапыСтроительства;
	Движение.ТипРасхода = Перечисления.ИИТ_ТипРасходаБДР.АвансовыеОтчеты;
	Движение.Сумма = СуммаДокумента;
	
	Движения.ИИТ_ОборотыПоБДР.Записать();
	
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.Период = Дата;
	Движение.Сумма = ИИТ_СуммаАктуальная;
	Движение.Организация = Организация;
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("71.01");
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций] = ИИТ_ОтветственноеЛицо.ФизическоеЛицо;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("50");
	Движения.Хозрасчетный.Записать();
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
		НаборЗаписей.Отбор.Ответственный.Установить(ПараметрыСеанса.ТекущийПользователь);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура АЛФ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив();

	Если ПроверяемыеРеквизиты.Найти("Склад") = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("Склад");
	КонецЕсли;

	ОтражатьВНалоговомУчете                = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Организация, Дата);
	ОтражатьВНалоговомУчетеУСН             = УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Организация, Дата);
	ОтражатьВНалоговомУчетеУСНДоходы       = УчетнаяПолитика.ПрименяетсяУСНДоходы(Организация, Дата);
	ОтражатьВНалоговомУчетеПредпринимателя = УчетнаяПолитика.ПлательщикНДФЛ(Организация, Дата);
	РаздельныйУчетНДСНа19Счете			   = УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата);
	ВестиУчетПоДоговорам                   = ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам");

	Если Товары.Количество() = 0 
		И (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВозвратнуюТару") ИЛИ ВозвратнаяТара.Количество() = 0) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Склад");
	КонецЕсли;

	// Проверка табличной части "Товары"
	Если НЕ ОтражатьВНалоговомУчетеУСН Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ОтражениеВУСН");
	КонецЕсли;

	// Нижеперечисленные реквизиты будут проверяться по условиям:
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Поставщик");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаСФ");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.НомерСФ");

	Если КурсРассчитывается Тогда
		СуммаРасходов = Товары.Итог("Сумма") + ОплатаПоставщикам.Итог("Сумма") + Прочее.Итог("Сумма");
		Если Не СуммаВключаетНДС Тогда
			СуммаРасходов = СуммаРасходов + Товары.Итог("СуммаНДС") + Прочее.Итог("СуммаНДС");
		КонецЕсли;
		СуммаЗачтенныхАвансов = ВыданныеАвансы.Итог("СуммаИзрасходованногоАванса");
		Если СуммаЗачтенныхАвансов > СуммаРасходов Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список", "Корректность",,, НСтр("ru = 'Авансы'"),
			НСтр("ru = 'Сумма зачтенных авансов %1 больше суммы расходов по отчету %2'"));
			ТекстСообщения = СтрШаблон(ТекстСообщения, СуммаЗачтенныхАвансов, СуммаРасходов);
			Поле = "ВыданныеАвансы";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;

		Для Каждого Аванс Из ВыданныеАвансы Цикл
			Если ЗначениеЗаполнено(Аванс.ДокументАванса) Тогда
				РеквизитыАванса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Аванс.ДокументАванса, "СуммаДокумента, ВалютаДокумента");
				Если Аванс.СуммаИзрасходованногоАванса > РеквизитыАванса.СуммаДокумента Тогда
					Префикс = "ВыданныеАвансы[" + Формат(Аванс.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
					КолонкаЗачтено = СтрШаблон(НСтр("ru = 'Зачтено (%1)'"), РеквизитыАванса.ВалютаДокумента);
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность", КолонкаЗачтено,
					Аванс.НомерСтроки, НСтр("ru = 'Авансы'"),
					НСтр("ru = 'Сумма зачтенного аванса %1 больше суммы выданного аванса по документу %2'"));
					ТекстСообщения = СтрШаблон(ТекстСообщения, Аванс.СуммаИзрасходованногоАванса, РеквизитыАванса.СуммаДокумента);
					Поле = Префикс + "СуммаИзрасходованногоАванса";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ВыданныеАвансы.СуммаИзрасходованногоАванса");
	КонецЕсли;

	Для каждого СтрокаТаблицы Из Товары Цикл
		Префикс = "Товары[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		ИмяСписка = НСтр("ru = 'Товары'");

		Если СтрокаТаблицы.ПредъявленСФ Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Поставщик) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Поставщик'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка);
				Поле = Префикс + "Поставщик";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаСФ) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Дата счета-фактуры'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка);
				Поле = Префикс + "ДатаСФ";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			Если ПустаяСтрока(СтрокаТаблицы.НомерСФ) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Номер счета-фактуры'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка);
				Поле = Префикс + "НомерСФ";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	// Проверка табличной части "Возвратная тара"

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВозвратнуюТару") Тогда

		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.Номенклатура");
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.Количество");
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.Сумма");
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.ДоговорКонтрагента");

	КонецЕсли;

	Если НЕ ВестиУчетПоДоговорам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.ДоговорКонтрагента");
	КонецЕсли;

	// Проверять надо только по доп.условиям
	МассивНепроверяемыхРеквизитов.Добавить("ОплатаПоставщикам.Сделка"); // доп.условие - СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу

	// Проверка табличной части "Оплата поставщикам"
	Для каждого СтрокаТаблицы Из ОплатаПоставщикам Цикл
		Префикс = "ОплатаПоставщикам[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		ИмяСписка = НСтр("ru = 'Оплата поставщикам'");

		Если СтрокаТаблицы.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Документ расчетов'"),
			СтрокаТаблицы.НомерСтроки, ИмяСписка);
			Поле = Префикс + "Сделка";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
			Поле = Префикс + "ДоговорКонтрагента";
			ТекстСообщения = "";
			ПроведениеВозможно = УчетВзаиморасчетов.ПроверитьВозможностьПроведенияВРеглУчете(
			ЭтотОбъект, СтрокаТаблицы.ДоговорКонтрагента, ТекстСообщения);
			Если НЕ ПроведениеВозможно Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'Договор'"), СтрокаТаблицы.НомерСтроки, ИмяСписка, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ВестиУчетПоДоговорам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОплатаПоставщикам.ДоговорКонтрагента");
	КонецЕсли;

	Если НЕ ОтражатьВНалоговомУчетеУСН Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.ОтражениеВУСН");
	КонецЕсли;

	// Нижеперечисленные реквизиты будут проверяться по условиям:
	МассивНепроверяемыхРеквизитов.Добавить("Прочее.Поставщик");
	МассивНепроверяемыхРеквизитов.Добавить("Прочее.ДатаСФ");
	МассивНепроверяемыхРеквизитов.Добавить("Прочее.НомерСФ");
	МассивНепроверяемыхРеквизитов.Добавить("Прочее.НомерДокументаОплаты");
	МассивНепроверяемыхРеквизитов.Добавить("Прочее.ДатаДокументаОплаты");

	Если ВидОперации = Перечисления.ВидыОперацийАвансовыйОтчет.Командировка Тогда

		Если Не НДСВключенВСтоимость Или РаздельныйУчетНДСНа19Счете Тогда

			ИмяСписка = НСтр("ru = 'Расходы сотрудника'");

			Для Каждого СтрокаТаблицы Из Прочее Цикл

				Поле = "Прочее[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].УчетНДС";

				Если СтрокаТаблицы.ПредъявленСФ И Не ЗначениеЗаполнено(СтрокаТаблицы.Поставщик) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					, 
					?(СтрокаТаблицы.ВидДокументаРасхода = Перечисления.ВидыДокументовПодтверждающихКомандировочныеРасходы.Билет, 
					НСтр("ru = 'Перевозчик'"), 
					НСтр("ru = 'Поставщик'")),
					СтрокаТаблицы.НомерСтроки, 
					ИмяСписка);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, "Объект", Отказ);
				КонецЕсли;

				// Для вычета НДС требуется счет-фактура. Исключение - авиа и ж/д билеты.
				Если СтрокаТаблицы.ПредъявленСФ И ЗначениеЗаполнено(СтрокаТаблицы.ВидДокументаРасхода) 
					И СтрокаТаблицы.ВидДокументаРасхода <> Перечисления.ВидыДокументовПодтверждающихКомандировочныеРасходы.Билет
					И (Не ЗначениеЗаполнено(СтрокаТаблицы.НомерСФ) Или Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаСФ)) Тогда

					ШаблонСообщения = Нстр("ru='Не заполнены реквизиты счета-фактуры в строке %1 списка ""%2""'");
					ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(ШаблонСообщения, СтрокаТаблицы.НомерСтроки, ИмяСписка),
					,
					Поле,
					"Объект",
					Отказ);

				КонецЕсли;

				// Для вычета НДС требуется документ оплаты. Исключение - чек, т.к. сам по себе является таким документом.
				Если СтрокаТаблицы.ПредъявленСФ И ЗначениеЗаполнено(СтрокаТаблицы.ВидДокументаРасхода) 
					И СтрокаТаблицы.ВидДокументаРасхода <> Перечисления.ВидыДокументовПодтверждающихКомандировочныеРасходы.Чек
					И (Не ЗначениеЗаполнено(СтрокаТаблицы.НомерДокументаОплаты) Или Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаДокументаОплаты)) Тогда

					ШаблонСообщения = Нстр("ru='Не заполнены реквизиты документа оплаты (чека) в строке %1 списка ""%2""'");
					ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(ШаблонСообщения, СтрокаТаблицы.НомерСтроки, ИмяСписка),
					,
					Поле,
					"Объект",
					Отказ);

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		Если ЗначениеЗаполнено(Суточные) И ЗначениеЗаполнено(ДатаНачалаКомандировки) И ЗначениеЗаполнено(ДатаОкончанияКомандировки) Тогда

			ТаблицаСуточных = Суточные.Выгрузить(,"ДатаНачала, ДатаОкончания");

			// Проверяем, что минимальная дата начала сегмента командировки не выходит за начало периода командировки
			ТаблицаСуточных.Сортировать("ДатаНачала");
			Если ЗначениеЗаполнено(ТаблицаСуточных[0].ДатаНачала)
				И ТаблицаСуточных[0].ДатаНачала < ДатаНачалаКомандировки Тогда

				ШаблонСообщения = Нстр("ru='Дата отправления в расчете суточных (%1) раньше даты начала командировки (%2)'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(ШаблонСообщения,
				Формат(ТаблицаСуточных[0].ДатаНачала, "ДЛФ=D"),
				Формат(ДатаНачалаКомандировки, "ДЛФ=D")),
				Ссылка,
				"Объект.Суточные.ИтогСумма",
				,
				Отказ);

			КонецЕсли;		

			// Проверяем, что максимальная дата окончания сегмента командировки не выходит за окончание периода командировки
			ТаблицаСуточных.Сортировать("ДатаОкончания Убыв");
			Если ЗначениеЗаполнено(ТаблицаСуточных[0].ДатаОкончания)
				И ТаблицаСуточных[0].ДатаОкончания > ДатаОкончанияКомандировки Тогда

				ШаблонСообщения = Нстр("ru='Дата возвращения в расчете суточных (%1) позже даты окончания командировки (%2)'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(ШаблонСообщения, 
				Формат(ТаблицаСуточных[0].ДатаОкончания, "ДЛФ=D"),
				Формат(ДатаОкончанияКомандировки, "ДЛФ=D")),
				Ссылка,
				"Объект.Суточные.ИтогСумма",
				,
				Отказ);					

			КонецЕсли;			

		КонецЕсли;	

		// Т.к. привязать сообщение об ошибке к полю итога ТЧ нельзя, то СчетЗатрат, "спрятанный" за ссылкой,
		// проверим здесь: в тексте укажем, где нужно заполнить реквизит
		Если ЗначениеЗаполнено(Суточные) 
			И НЕ ЗначениеЗаполнено(СчетЗатрат) 
			И СчетаУчетаВДокументахВызовСервераПовтИсп.ПользовательУправляетСчетамиУчета() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Нстр("ru='В форме суточных не указан счет затрат'"),
			,
			"Объект.Суточные.ИтогСумма",
			,
			Отказ);					
		КонецЕсли;

		МассивНепроверяемыхРеквизитов.Добавить("СчетЗатрат");

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийАвансовыйОтчет.ПокупкаОплатаПрочее Тогда

		Для каждого СтрокаТаблицы Из Прочее Цикл
			Префикс = "Прочее[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
			ИмяСписка = НСтр("ru = 'Прочее'");

			Если СтрокаТаблицы.ПредъявленСФ Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Поставщик) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Поставщик'"),
					СтрокаТаблицы.НомерСтроки, ИмяСписка);
					Поле = Префикс + "Поставщик";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаСФ) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Дата счета-фактуры'"),
					СтрокаТаблицы.НомерСтроки, ИмяСписка);
					Поле = Префикс + "ДатаСФ";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				Если ПустаяСтрока(СтрокаТаблицы.НомерСФ) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Номер счета-фактуры'"),
					СтрокаТаблицы.НомерСтроки, ИмяСписка);
					Поле = Префикс + "НомерСФ";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;	

	Если ВидОперации <> Перечисления.ВидыОперацийАвансовыйОтчет.ПокупкаОплатаПрочее Тогда

		// Реквизиты, скрытые от пользователя.
		// Для вида операции Командировка заполняются перед записью.
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.ОтражениеВУСН");
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.СчетУчетаНДС");

		// Реквизит Содержание скрыт от пользователя
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.Содержание");

		// Вид документа расхода нужен только для настройки учета НДС по командировочным расходам
		Если НДСВключенВСтоимость Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Прочее.ВидДокументаРасхода");
		КонецЕсли;	

	КонецЕсли;	

	Если ВидОперации <> Перечисления.ВидыОперацийАвансовыйОтчет.Командировка Тогда

		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаКомандировки");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияКомандировки");

		// В АО по командировке номер и дата входящего документа используются как номер и дата счет-фактуры 
		// (если вид документа - билет), либо как номер и дата чека (если вид документа - чек). 
		// Поэтому для командировки вид и реквизиты входящего документа обязательные.
		// В ином случае пользователю доступны отдельные колонки даты и номера СФ, поэтому реквизиты входящего документа необязательны.
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.НомерВходящегоДокумента");
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.ДатаВходящегоДокумента");
		МассивНепроверяемыхРеквизитов.Добавить("Прочее.ВидДокументаРасхода");

	КонецЕсли;	

#Вставка
	//+ИИТ_Аксеньюшкин
	Если ИИТ_ДокументОснование <> Неопределено И ТипЗнч(ИИТ_ДокументОснование) = Тип("ДокументСсылка.ИИТ_ТабельУчетаЗаполнениеИзОтчета") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИИТ_ЭтапыСтроительства");
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	РеквизитыЗаСсылками = Документы.АвансовыйОтчет.РеквизитыЗаСсылками(ВидОперации);
	СчетаУчетаВДокументах.ПроверитьЗаполнение(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, РеквизитыЗаСсылками);
	ПроверкаЗаполненияДокументов.ПроверитьРеквизитыЗаСсылками(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, РеквизитыЗаСсылками);

КонецПроцедуры

