
&После("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//+ИИТ_Аксеньюшкин
	Движение = Движения.ИИТ_ПринадлежностьСотрудниковКОбъектам.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектСтроительства = ИИТ_ОбъектСтроительства;
	Движение.Сотрудник = Сотрудник;
	Движения.ИИТ_ПринадлежностьСотрудниковКОбъектам.Записать(Истина);
	
	Движение = Движения.ИИТ_БригадыФизическихЛиц.Добавить();
	Движение.Период = Дата;
	Движение.Физлицо = Сотрудник.ФизическоеЛицо;
	Движение.Бригада = ИИТ_Бригада;
	Движения.ИИТ_БригадыФизическихЛиц.Записать();
	
	Движение = Движения.ИИТ_ОбъектыСтроительстваСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.ОбъектСтроительства = ИИТ_ОбъектСтроительства;
	Движения.ИИТ_ОбъектыСтроительстваСотрудников.Записать();
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&Перед("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СпособРасчетаАванса = Перечисления.СпособыРасчетаАванса.ФиксированнойСуммой;
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура АЛФ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ДатаПриема = ПолучитьДатуПриёмаСотрудника(Сотрудник); 
	Если ЗначениеЗаполнено(ДатаПриема) Тогда 
		Если НачалоДня(ДатаПриема) = НачалоДня(Дата) Тогда 
			ДатаНачала = КонецДня(Дата) + 60;
		КонецЕсли; 
	КонецЕсли;	 
	
КонецПроцедуры

#Область Доработки	

Функция ПолучитьДатуПриёмаСотрудника(Сотрудник) 
	
	ДатаПриема = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковСрезПоследних.Период КАК ДатаПриема
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
		|			&НаДату,
		|			Сотрудник = &Сотрудник
		|				И ВидСобытия = &ВидСобытия) КАК КадроваяИсторияСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидСобытия"	, Перечисления.ВидыКадровыхСобытий.Прием);
	Запрос.УстановитьПараметр("НаДату"		, Дата);
	Запрос.УстановитьПараметр("Сотрудник"	, Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаПриема = ВыборкаДетальныеЗаписи.ДатаПриема; 
	КонецЦикла;
	
	Возврат ДатаПриема;
	
КонецФункции

#КонецОбласти
