


&После("ОбработкаПолученияФормы")
Процедура АЛФ_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	//+ИИТ_Аксеньюшкин
	Если ВыбраннаяФорма = "ФормаДокументаОбщая" Тогда
		ВыбраннаяФорма = "ФормаДокументаТовары";
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
КонецПроцедуры         

#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("НомерВходящегоДокумента");
	Поля.Добавить("ДатаВходящегоДокумента");
	Поля.Добавить("СуммаДокумента");

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Представление = "Поступление товаров и услуг № " + Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy") + 
	" / " + Данные.НомерВходящегоДокумента + " от " + Формат(Данные.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");// + "; " + Формат(Данные.СуммаДокумента, "ЧЦ=15; ЧДЦ=2") + " руб.";

КонецПроцедуры

&ИзменениеИКонтроль("ПечатьМ4")
Функция АЛФ_ПечатьМ4(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_М4";

	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();

	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_М4");

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов"  , МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыМ4();

	Шапка = Запрос.Выполнить().Выгрузить();

	ПервыйДокумент = Истина;

	ОписаниеТиповЧисло15_2 = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);

	ТаблицаПоТоварам = Новый ТаблицаЗначений; 		
	ТаблицаПоТоварам.Колонки.Добавить("НомерСтроки");
	ТаблицаПоТоварам.Колонки.Добавить("Номенклатура");
	ТаблицаПоТоварам.Колонки.Добавить("ТоварНаименование");
	ТаблицаПоТоварам.Колонки.Добавить("ТоварКод");
	ТаблицаПоТоварам.Колонки.Добавить("Количество");
	ТаблицаПоТоварам.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	ТаблицаПоТоварам.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаПоТоварам.Колонки.Добавить("СуммаВключаетНДС");
	ТаблицаПоТоварам.Колонки.Добавить("Цена", 						ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("Сумма", 						ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("СтавкаНДС");
	ТаблицаПоТоварам.Колонки.Добавить("СуммаНДС", 					ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("СуммаНДСВВалютеДокумента", 	ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("СуммаБезНДС", 				ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("СуммаРублевая", 				ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("ID");
	ТаблицаПоТоварам.Колонки.Добавить("ЭтоКомиссия", 				Новый ОписаниеТипов("Булево"));
	ТаблицаПоТоварам.Колонки.Добавить("ВсегоРуб",                   ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("НДСРуб",                     ОписаниеТиповЧисло15_2);
	ТаблицаПоТоварам.Колонки.Добавить("СуммаБезНДСРуб",             ОписаниеТиповЧисло15_2);

	ТаблицаДокументов =  Шапка.Скопировать();
	ТаблицаДокументов.Свернуть("Ссылка");

	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл 
		СтрокаДокумента 		= Шапка.Найти(СтрокаТаблицы.Ссылка, "Ссылка");
		ОтборПоДокументу 		= Новый Структура("Ссылка", СтрокаТаблицы.Ссылка);
		ТаблицаСклады 			= Шапка.Скопировать(ОтборПоДокументу);
		ТаблицаСкладыДокумента 	= ТаблицаСклады.Скопировать();
		ТаблицаСкладыДокумента.Свернуть("МестоПриемки");
		КоличествоСкладовПоДокументу = ТаблицаСкладыДокумента.Количество();
		Для Каждого СтрокаСклад Из ТаблицаСкладыДокумента Цикл

			СуффиксНомера = ТаблицаСкладыДокумента.Индекс(СтрокаСклад) + 1;	

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			ОтборПоСкладу = Новый Структура("МестоПриемки", СтрокаСклад.МестоПриемки);
			ТоварыПоСкладам = ТаблицаСклады.НайтиСтроки(ОтборПоСкладу);

			ПодготовитьТаблицуДокументаДляПечатиМ4(ТоварыПоСкладам, ТаблицаПоТоварам);

			ОбластьМакетаШапка              = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакетаЗаголовокДокумента = Макет.ПолучитьОбласть("ЗаголовокДокумента");
			ОбластьМакетаЗаголовокТаблицы   = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ОбластьМакетаСтрока             = Макет.ПолучитьОбласть("Строка");
			ОбластьМакетаПодвалСтрок        = Макет.ПолучитьОбласть("ПодвалСтрок");
			ОбластьМакетаИтого              = Макет.ПолучитьОбласть("Итого");
			ОбластьМакетаПодвал             = Макет.ПолучитьОбласть("Подвал");

			// Выводим общие реквизиты шапки
			СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СтрокаДокумента.ЮрФизЛицо, СтрокаДокумента.ДатаСоставления);

			ОбластьМакетаШапка.Параметры.Заполнить(СтрокаДокумента);
			ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе);
			ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО        = СведенияОПокупателе.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.НомерДокумента           = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаДокумента.Номер, Истина, Ложь) + ?(КоличествоСкладовПоДокументу > 1, "/" + СуффиксНомера, "");

			ТабличныйДокумент.Вывести(ОбластьМакетаШапка);

			// Выводим заголовок документа
			ОбластьМакетаЗаголовокДокумента.Параметры.Заполнить(СтрокаДокумента);
			ОбластьМакетаЗаголовокДокумента.Параметры.ДатаСоставления = СтрокаДокумента.ДатаСоставления;
			ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СтрокаДокумента.Поставщик, СтрокаДокумента.ДатаСоставления), "НаименованиеДляПечатныхФорм,"); 
			ОбластьМакетаЗаголовокДокумента.Параметры.ПоставщикНаименование = ПредставлениеКонтрагента;
			ОбластьМакетаЗаголовокДокумента.Параметры.СкладНаименование = ?(СтрокаДокумента.Ссылка.СкладВСписке, СтрокаСклад.МестоПриемки.Наименование, СтрокаДокумента.СкладНаименование);

			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокДокумента);
			//
			// Выводим заголовок таблицы
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);

			// Инициализация итогов в документе
			ИтогоКоличествоПринято = 0;
			ИтогоСуммаБезНДС       = 0;
			ИтогоСуммаНДС          = 0;
			ИтогоВсегоСНДС         = 0;
			Ном                    = 0;

			// Инициализация счетчиков страниц и строк
			НомерСтраницы   = 1;
			НомерСтроки     = 0;
			КоличествоСтрок = ТаблицаПоТоварам.Количество();

			// Выводим многострочную часть документа
			Для Каждого ВыборкаСтрок Из ТаблицаПоТоварам Цикл				
				#Вставка     
				СтруктураПоиска = Новый Структура("Номенклатура", ВыборкаСтрок.Номенклатура);
				НайденныеСтроки = Шапка.Ссылка.Товары.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ВыборкаСтрок.Количество 					= НайденныеСтроки[0].КоличествоБух;
					ВыборкаСтрок.Цена 							= НайденныеСтроки[0].ЦенаБух;
					ВыборкаСтрок.Номенклатура 					= НайденныеСтроки[0].НоменклатураБухгалтерская;
					ВыборкаСтрок.ЕдиницаИзмеренияНаименование 	= Строка(НайденныеСтроки[0].ЕдиницаИзмеренияБухаглтерская);
				КонецЕсли;
				#КонецВставки    
				
				НомерСтроки = НомерСтроки + 1;
				
				ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);

				Кратность = ?(СтрокаДокумента.Кратность = 0, 1, СтрокаДокумента.Кратность);
				ВсегоСНДС = (?(ЗначениеЗаполнено(ВыборкаСтрок.Сумма), ВыборкаСтрок.Сумма, 0)
				+ ?(СтрокаДокумента.СуммаВключаетНДС, 0, ?(ЗначениеЗаполнено(ВыборкаСтрок.СуммаНДС), ВыборкаСтрок.СуммаНДС, 0)));

				КоличествоПринято = ?(ЗначениеЗаполнено(ВыборкаСтрок.Количество), ВыборкаСтрок.Количество, 0);
				СуммаНДС          = ?(ЗначениеЗаполнено(ВыборкаСтрок.СуммаНДС), ВыборкаСтрок.СуммаНДС, 0);
				СуммаБезНДС       = ВсегоСНДС - СуммаНДС;

				Если СтрокаДокумента.СуммаВключаетНДС И СуммаНДС <> 0 Тогда
					Цена = ?(КоличествоПринято = 0,
					СуммаБезНДС,
					СуммаБезНДС / КоличествоПринято);

				Иначе

					Цена = ВыборкаСтрок.Цена;

				КонецЕсли;

				ОбластьМакетаСтрока.Параметры.КоличествоПринято = КоличествоПринято;
				ОбластьМакетаСтрока.Параметры.ВсегоСНДС         = ВсегоСНДС;
				ОбластьМакетаСтрока.Параметры.СуммаБезНДС       = СуммаБезНДС;
				ОбластьМакетаСтрока.Параметры.СуммаНДС          = СуммаНДС;
				ОбластьМакетаСтрока.Параметры.Цена              = Цена;
				ОбластьМакетаСтрока.Параметры.ТоварНаименование = СокрЛП(ВыборкаСтрок.ТоварНаименование);

				// Проверим вывод
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(ОбластьМакетаСтрока);
				Если НомерСтроки = КоличествоСтрок Тогда           // если последняя строка, должен
					СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);  // помещаться и подвал документа
					СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
				Иначе                                              // иначе - только подвал строк
					СтрокаСПодвалом.Добавить(ОбластьМакетаПодвалСтрок);
				КонецЕсли;

				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, СтрокаСПодвалом) Тогда

					ТабличныйДокумент.Вывести(ОбластьМакетаПодвалСтрок);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();


					НомерСтраницы = НомерСтраницы + 1;
					ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;

					ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);

				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);

				ИтогоКоличествоПринято = ИтогоКоличествоПринято + КоличествоПринято;
				ИтогоСуммаБезНДС       = ИтогоСуммаБезНДС       + СуммаБезНДС;
				ИтогоСуммаНДС          = ИтогоСуммаНДС          + СуммаНДС;
				ИтогоВсегоСНДС         = ИтогоВсегоСНДС         + ВсегоСНДС;

			КонецЦикла;

			// Выводим итоги по документу
			ОбластьМакетаИтого.Параметры.ИтогоКоличествоПринято = ИтогоКоличествоПринято;
			ОбластьМакетаИтого.Параметры.ИтогоСуммаБезНДС       = ИтогоСуммаБезНДС;
			ОбластьМакетаИтого.Параметры.ИтогоСуммаНДС          = ИтогоСуммаНДС;
			ОбластьМакетаИтого.Параметры.ИтогоВсегоСНДС         = ИтогоВсегоСНДС;
			ТабличныйДокумент.Вывести(ОбластьМакетаИтого);

			// Выводим итоги по документу
			ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
			ДанныеПодвал = Новый Структура;
			Если ЗначениеЗаполнено(СтрокаДокумента.МестоПриемки) Тогда 
				МОЛ = ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(СтрокаДокумента.МестоПриемки, СтрокаДокумента.ДатаСоставления);
				ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(СтрокаДокумента.Организация, МОЛ, СтрокаДокумента.ДатаСоставления);				
				ДанныеПодвал.Вставить("ПринялДолжность", ДанныеФизЛица.Должность);
				ДанныеПодвал.Вставить("ПринялФИО",       ДанныеФизЛица.Представление);
			КонецЕсли;
			ОбластьМакетаПодвал.Параметры.Заполнить(СтрокаДокумента);
			ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеПодвал);
			ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);


		КонецЦикла;
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, СтрокаДокумента.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти
