
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ПолеВвода_АЛФ = Элементы.Добавить("Комментарий", Тип("ПолеФормы"), Элементы.ГруппаФИО);
	ПолеВвода_АЛФ.Заголовок = "Комментарий";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.Комментарий";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Бригада", Тип("ПолеФормы"), Элементы.ГруппаФИО);
	ПолеВвода_АЛФ.Заголовок = "Бригада";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ИИТ_Бригада";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СтавкаВЧас", Тип("ПолеФормы"), Элементы.ГруппаФИО);
	ПолеВвода_АЛФ.Заголовок = "Ставка в час";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_СтавкаВЧас";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОкладВЧас", Тип("ПолеФормы"), Элементы.ГруппаФИО);
	ПолеВвода_АЛФ.Заголовок = "Оклад в час";  
	ПолеВвода_АЛФ.Видимость = Ложь;
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ИИТ_ОкладВЧас";

 	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЯвляетсяМОЛом", Тип("ПолеФормы"), Элементы.КомандыФИО);
	ПолеВвода_АЛФ.Заголовок = "Является МОЛом";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ИИТ_ЯвляетсяМОЛом";
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_СозданАвтоматическиЗУП", Тип("ПолеФормы"), Элементы.КомандыФИО);
	ПолеВвода_АЛФ.Заголовок 			= "Создан автом";
	ПолеВвода_АЛФ.Вид 					= ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода_АЛФ.Доступность           = Ложь;
	ПолеВвода_АЛФ.ПутьКДанным 			= "ФизическоеЛицо.АС_СозданАвтоматическиЗУП";
	
	//
	ПолеВвода_АЛФ = Элементы.Добавить("АС_ФиксированнаяОплатаТруда", Тип("ПолеФормы"), Элементы.КомандыФИО);
	ПолеВвода_АЛФ.Заголовок 			= "Фикс";
	ПолеВвода_АЛФ.Вид 					= ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода_АЛФ.ПутьКДанным 			= "ФизическоеЛицо.АС_ФиксированнаяОплатаТруда";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "АС_ФиксированнаяОплатаТрудаПриИзменении");

	ПолеВвода_АЛФ = Элементы.Добавить("АС_ДатаСоздания", Тип("ПолеФормы"), Элементы.КомандыФИО);
	ПолеВвода_АЛФ.Вид 					= ВидПоляФормы.ПолеНадписи;	
	ПолеВвода_АЛФ.Доступность           = Ложь;
	ПолеВвода_АЛФ.ПутьКДанным 			= "ФизическоеЛицо.АС_ДатаСоздания";

	//Данные в колонках
	Группа_АЛФ_МК = Элементы.Добавить("ГруппаМиграционнаяКарта", Тип("ГруппаФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	Группа_АЛФ_МК.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_МК.Заголовок = "Миграционная карта";
	Группа_АЛФ_МК.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_АЛФ_МК.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа_АЛФ_СН = Элементы.Добавить("ГруппаМиграционнаяКартаСерияНомер", Тип("ГруппаФормы"), Группа_АЛФ_МК);
	Группа_АЛФ_СН.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_СН.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_АЛФ_СН.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_АЛФ_СН.ОтображатьЗаголовок = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("МиграционнаяКартаСерия", Тип("ПолеФормы"), Группа_АЛФ_СН);
	ПолеВвода_АЛФ.Заголовок = "Серия";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МиграционнаяКартаСерия";
	
	ПолеВвода_АЛФ = Элементы.Добавить("МиграционнаяКартаНомер", Тип("ПолеФормы"), Группа_АЛФ_СН);
	ПолеВвода_АЛФ.Заголовок = "Номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МиграционнаяКартаНомер";

	Группа_АЛФ_ПН = Элементы.Добавить("ГруппаМиграционнаяКартаПериод", Тип("ГруппаФормы"), Группа_АЛФ_МК);
	Группа_АЛФ_ПН.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_ПН.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_АЛФ_ПН.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_АЛФ_ПН.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("МиграционнаяКартаДатаНачала", Тип("ПолеФормы"), Группа_АЛФ_ПН);
	ПолеВвода_АЛФ.Заголовок = "С";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МиграционнаяКартаДатаНачала";
	
	ПолеВвода_АЛФ = Элементы.Добавить("МиграционнаяКартаДатаОкончания", Тип("ПолеФормы"), Группа_АЛФ_ПН);
	ПолеВвода_АЛФ.Заголовок = "по";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МиграционнаяКартаДатаОкончания";

	Группа_АЛФ_ДМС = Элементы.Добавить("ГруппаДМС", Тип("ГруппаФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	Группа_АЛФ_ДМС.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_ДМС.Заголовок = "ДМС";
	Группа_АЛФ_ДМС.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_АЛФ_ДМС.Отображение = ОтображениеОбычнойГруппы.Нет;

	ПолеВвода_АЛФ = Элементы.Добавить("НомерДМС", Тип("ПолеФормы"), Группа_АЛФ_ДМС);
	ПолеВвода_АЛФ.Заголовок = "Номер ДМС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.НомерДМС";

	Группа_АЛФ_ДМС_П = Элементы.Добавить("ГруппаПериодДМС", Тип("ГруппаФормы"), Группа_АЛФ_ДМС);
	Группа_АЛФ_ДМС_П.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_ДМС_П.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_АЛФ_ДМС_П.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_АЛФ_ДМС_П.ОтображатьЗаголовок = Ложь;  

	ПолеВвода_АЛФ = Элементы.Добавить("ДатаНачалаДМС", Тип("ПолеФормы"), Группа_АЛФ_ДМС_П);
	ПолеВвода_АЛФ.Заголовок = "С";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ДатаНачалаДМС";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ДатаОкончанияДМС", Тип("ПолеФормы"), Группа_АЛФ_ДМС_П);
	ПолеВвода_АЛФ.Заголовок = "по";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ДатаОкончанияДМС";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ОрганизацияДМС", Тип("ПолеФормы"), Группа_АЛФ_ДМС);
	ПолеВвода_АЛФ.Заголовок = "Организация ДМС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ОрганизацияДМС";
	
	Декорация_АЛФ = Элементы.Добавить("НадписьПропуск", Тип("ДекорацияФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	Декорация_Алф.Вид = ВидДекорацииФормы.Надпись;
	
	ПолеВвода_АЛФ = Элементы.Добавить("БанковскиеРеквизиты", Тип("ПолеФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	ПолеВвода_АЛФ.Заголовок = "Банковские реквизиты";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.БанковскиеРеквизиты";

	Группа_АЛФ_МД = Элементы.Добавить("ГруппаМедосмотр", Тип("ГруппаФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	Группа_АЛФ_МД.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_МД.Заголовок = "Медосмотр";
	Группа_АЛФ_МД.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_АЛФ_МД.Отображение = ОтображениеОбычнойГруппы.Нет;

	Группа_АЛФ_МД_Н = Элементы.Добавить("ГруппаЗапрошеноНомер", Тип("ГруппаФормы"), Группа_АЛФ_МД);
	Группа_АЛФ_МД_Н.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_АЛФ_МД_Н.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_АЛФ_МД_Н.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_АЛФ_МД_Н.ОтображатьЗаголовок = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("МедосмотрЗапрошено", Тип("ПолеФормы"), Группа_АЛФ_МД_Н);
	ПолеВвода_АЛФ.Заголовок = "Запрошено";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МедосмотрЗапрошено";
 	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "МедосмотрЗапрошеноПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("МедосмотрНомерЗаявки", Тип("ПолеФормы"), Группа_АЛФ_МД_Н);
	ПолеВвода_АЛФ.Заголовок = "№ заявки";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МедосмотрНомерЗаявки";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "МедосмотрНомерЗаявкиПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("МедосмотрПолучено", Тип("ПолеФормы"), Группа_АЛФ_МД_Н);
	ПолеВвода_АЛФ.Заголовок = "Получено";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.МедосмотрПолучено";
	
	//Табличная часть
	ТаблицаИЗ = Элементы.Добавить("ИИТ_ИсторияСтавок", Тип("ТаблицаФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	ТаблицаИЗ.ПутьКДанным = "ИИТ_ИсторияСтавок";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_ИсторияСтавокПериод", Тип("ПолеФормы"), ТаблицаИЗ);
	ЭлементТаблицыФормы.Заголовок = "Период";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ИИТ_ИсторияСтавок.Период";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_ИсторияСтавокСтавка", Тип("ПолеФормы"), ТаблицаИЗ);
	ЭлементТаблицыФормы.Заголовок = "Ставка";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ИИТ_ИсторияСтавок.Ставка";
	
	//Табличная часть 2
	ТаблицаИО 				= Элементы.Добавить("АС_ИсторияОкладов", Тип("ТаблицаФормы"), Элементы.ОсновныеДанныеПраваяКолонка);
	ТаблицаИО.ПутьКДанным 	= "АС_ИсторияОкладов";
	
	ЭлементТаблицыФормы 			= Элементы.Добавить("АС_ИсторияОкладовПериод", Тип("ПолеФормы"), ТаблицаИО);
	ЭлементТаблицыФормы.Заголовок 	= "Период";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ИсторияОкладов.Период";
	
	ЭлементТаблицыФормы 			= Элементы.Добавить("АС_ИсторияОкладовТипОклада", Тип("ПолеФормы"), ТаблицаИО);
	ЭлементТаблицыФормы.Заголовок 	= "Тип оклада";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ИсторияОкладов.ТипОклада";
	
	ЭлементТаблицыФормы 			= Элементы.Добавить("АС_ИсторияОкладовОклад", Тип("ПолеФормы"), ТаблицаИО);
	ЭлементТаблицыФормы.Заголовок 	= "Оклад";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ИсторияОкладов.Оклад";

	//Вторая колонка с данными
	Группа_РГ = Элементы.Добавить("ГруппаРегистрация", Тип("ГруппаФормы"), Элементы.ГруппаУдостоверениеЛичности);
	Группа_РГ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_РГ.Заголовок = "Регистрация";
	Группа_РГ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_РГ.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа_РГ_ОТДО = Элементы.Добавить("ГруппаРегистрацияОтДо", Тип("ГруппаФормы"), Группа_РГ);
	Группа_РГ_ОТДО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_РГ_ОТДО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_РГ_ОТДО.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_РГ_ОТДО.ОтображатьЗаголовок = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("РегистрацияДатаВыдачи", Тип("ПолеФормы"), Группа_РГ_ОТДО);
	ПолеВвода_АЛФ.Заголовок = "Дата выдачи";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РегистрацияДатаВыдачи";

	ПолеВвода_АЛФ = Элементы.Добавить("РегистрацияДатаОкончания", Тип("ПолеФормы"), Группа_РГ_ОТДО);
	ПолеВвода_АЛФ.Заголовок = "до";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РегистрацияДатаОкончания";

 	ПолеВвода_АЛФ = Элементы.Добавить("РегистрацияОрганУчета", Тип("ПолеФормы"), Группа_РГ);
	ПолеВвода_АЛФ.Заголовок = "Орган поставивший на учет";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РегистрацияОрганУчета";
 	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "РегистрацияОрганУчетаПриИзменении");	

	
	Группа_РГ_МР = Элементы.Добавить("ГруппаМестоРегистрацииКвартира", Тип("ГруппаФормы"), Группа_РГ);
	Группа_РГ_МР.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_РГ_МР.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_РГ_МР.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_РГ_МР.ОтображатьЗаголовок = Ложь;  

	ПолеВвода_АЛФ = Элементы.Добавить("РегистрацияМесто", Тип("ПолеФормы"), Группа_РГ_МР);
	ПолеВвода_АЛФ.Заголовок = "Место регистрации";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РегистрацияМесто";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Квартира", Тип("ПолеФормы"), Группа_РГ_МР);
	ПолеВвода_АЛФ.Заголовок = "Квартира";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ИИТ_Квартира";

 	ПолеВвода_АЛФ = Элементы.Добавить("РегистрацияАдресОргана", Тип("ПолеФормы"), Группа_РГ);
	ПолеВвода_АЛФ.Заголовок = "Адрес органа поставившего на учет";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РегистрацияАдресОргана";
    ПолеВвода_АЛФ.Видимость = Ложь;
	
 	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ТипРезиденства", Тип("ПолеФормы"), Элементы.ГруппаУдостоверениеЛичности);
	ПолеВвода_АЛФ.Заголовок = "Тип резиденства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ИИТ_ТипРезиденства";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ТипРезиденстваПриИзменении");	
	
	Группа_ТР = Элементы.Добавить("ГруппаСтраницыТипРезиденства", Тип("ГруппаФормы"), Элементы.ГруппаУдостоверениеЛичности);
	Группа_ТР.Вид = ВидГруппыФормы.Страницы;
	Группа_ТР.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Группа_С_1 = Элементы.Добавить("СтраницаПатент", Тип("ГруппаФормы"), Группа_ТР);
	Группа_С_1.Вид = ВидГруппыФормы.Страница;
	Группа_С_1.Заголовок =  "Патент";
	Группа_С_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	Группа_С_1_1 = Элементы.Добавить("ГруппаПатентСерияНомер", Тип("ГруппаФормы"), Группа_С_1);
	Группа_С_1_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_С_1_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_С_1_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_С_1_1.ОтображатьЗаголовок = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("ПатентСерия", Тип("ПолеФормы"), Группа_С_1_1);
	ПолеВвода_АЛФ.Заголовок = "Серия";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентСерия";

	ПолеВвода_АЛФ = Элементы.Добавить("ПатентНомер", Тип("ПолеФормы"), Группа_С_1_1);
	ПолеВвода_АЛФ.Заголовок = "номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентНомер";

	ПолеВвода_АЛФ = Элементы.Добавить("ПатентДатаВыдачи", Тип("ПолеФормы"), Группа_С_1);
	ПолеВвода_АЛФ.Заголовок = "Дата выдачи";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентДатаВыдачи";

	ПолеВвода_АЛФ = Элементы.Добавить("ПатентСрокДействия", Тип("ПолеФормы"), Группа_С_1);
	ПолеВвода_АЛФ.Заголовок = "Срок действия";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентСрокДействия";

	ПолеВвода_АЛФ = Элементы.Добавить("ПатентДатаДоКоторойОплачен", Тип("ПолеФормы"), Группа_С_1);
	ПолеВвода_АЛФ.Заголовок = "Оплачено до";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентДатаДоКоторойОплачен";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ПатентДатаДоКоторойОплаченПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ПатентОрганВыдачи", Тип("ПолеФормы"), Группа_С_1);
	ПолеВвода_АЛФ.Заголовок = "Кем выдан";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентОрганВыдачи";

	ПолеВвода_АЛФ = Элементы.Добавить("ПатентОрганВыдачиСокращенно", Тип("ПолеФормы"), Группа_С_1);
	ПолеВвода_АЛФ.Заголовок = "Кем выдан сокр";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентОрганВыдачиСокращенно";

	ПолеВвода_АЛФ = Элементы.Добавить("ПатентСпособОплаты", Тип("ПолеФормы"), Группа_С_1);
	ПолеВвода_АЛФ.Заголовок = "Способ оплаты";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ПатентСпособОплаты";

	Группа_С_2 = Элементы.Добавить("СтраницаРВП", Тип("ГруппаФормы"), Группа_ТР);
	Группа_С_2.Вид = ВидГруппыФормы.Страница;
	Группа_С_2.Заголовок =  "РВП";
	Группа_С_2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	Группа_С_2_1 = Элементы.Добавить("ГруппаСерияНомерРВП", Тип("ГруппаФормы"), Группа_С_1);
	Группа_С_2_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_С_2_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_С_2_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_С_2_1.ОтображатьЗаголовок = Ложь;  

	ПолеВвода_АЛФ = Элементы.Добавить("РВПСерия", Тип("ПолеФормы"), Группа_С_2_1);
	ПолеВвода_АЛФ.Заголовок = "Серия";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	    
	ПолеВвода_АЛФ.Видимость = Ложь;
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РВПСерия";

	ПолеВвода_АЛФ = Элементы.Добавить("РВПНомер", Тип("ПолеФормы"), Группа_С_2_1);
	ПолеВвода_АЛФ.Заголовок = "Номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РВПНомер";

	ПолеВвода_АЛФ = Элементы.Добавить("РВПСрокДействия", Тип("ПолеФормы"), Группа_С_2);
	ПолеВвода_АЛФ.Заголовок = "Срок действия до";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РВПСрокДействия";

	ПолеВвода_АЛФ = Элементы.Добавить("РВПДата", Тип("ПолеФормы"), Группа_С_2);
	ПолеВвода_АЛФ.Заголовок = "Дата";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РВПДата";

	ПолеВвода_АЛФ = Элементы.Добавить("РВПКемВыдан", Тип("ПолеФормы"), Группа_С_2);
	ПолеВвода_АЛФ.Заголовок = "Кем выдан";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.РВПКемВыдан";

	Группа_С_3 = Элементы.Добавить("СтраницаВНЖ", Тип("ГруппаФормы"), Группа_ТР);
	Группа_С_3.Вид = ВидГруппыФормы.Страница;
	Группа_С_3.Заголовок =  "ВНЖ";
	Группа_С_3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	Группа_С_3_1 = Элементы.Добавить("ГруппаСерияНомерВНЖ", Тип("ГруппаФормы"), Группа_С_1);
	Группа_С_3_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_С_3_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_С_3_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_С_3_1.ОтображатьЗаголовок = Ложь;  

	ПолеВвода_АЛФ = Элементы.Добавить("ВНЖСерия", Тип("ПолеФормы"), Группа_С_3_1);
	ПолеВвода_АЛФ.Заголовок = "Серия";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	    
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ВНЖСерия";

	ПолеВвода_АЛФ = Элементы.Добавить("ВНЖНомер", Тип("ПолеФормы"), Группа_С_3_1);
	ПолеВвода_АЛФ.Заголовок = "Номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ВНЖНомер";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ВНЖСрокДействия", Тип("ПолеФормы"), Группа_С_3);
	ПолеВвода_АЛФ.Заголовок = "Срок действия до";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ВНЖСрокДействия";

	ПолеВвода_АЛФ = Элементы.Добавить("ВНЖДата", Тип("ПолеФормы"), Группа_С_3);
	ПолеВвода_АЛФ.Заголовок = "Дата";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ВНЖДата";

	ПолеВвода_АЛФ = Элементы.Добавить("ВНЖКемВыдан", Тип("ПолеФормы"), Группа_С_3);
	ПолеВвода_АЛФ.Заголовок = "Кем выдан";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ВНЖКемВыдан";

	Группа_С_4 = Элементы.Добавить("СтраницаЕАЭС", Тип("ГруппаФормы"), Группа_ТР);
	Группа_С_4.Вид = ВидГруппыФормы.Страница;
	Группа_С_4.Заголовок =  "ЕАЭС";
	Группа_С_4.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	Группа_ТР = Элементы.Добавить("ГруппаДактокарта", Тип("ГруппаФормы"), Элементы.ГруппаУдостоверениеЛичности);
	Группа_ТР.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_ТР.Заголовок = "Дактокарта";
	Группа_ТР.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа_ТР.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа_ТР_1 = Элементы.Добавить("ГруппаДактокартаСерияНомер", Тип("ГруппаФормы"), Группа_ТР);
	Группа_ТР_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_ТР_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_ТР_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа_ТР_1.ОтображатьЗаголовок = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("ДактокартаСерия", Тип("ПолеФормы"), Группа_ТР_1);
	ПолеВвода_АЛФ.Заголовок = "Серия";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ДактокартаСерия";

	ПолеВвода_АЛФ = Элементы.Добавить("ДактокартаНомер", Тип("ПолеФормы"), Группа_ТР_1);
	ПолеВвода_АЛФ.Заголовок = "Номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ДактокартаНомер";

	ПолеВвода_АЛФ = Элементы.Добавить("ДактокартаДатаВыдачи", Тип("ПолеФормы"), Группа_ТР);
	ПолеВвода_АЛФ.Заголовок = "Номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ФизическоеЛицо.ДактокартаДатаВыдачи";

	//+ИИТ_Аксеньюшкин
	Элементы.ГруппаИстория.Видимость = РольДоступна("ПолныеПрава"); 
	УстановитьВидимость(); 
	УстановитьТекущуюСтавку();
	УстановитьОтборРегистраСтавок(); 
	УстановитьОтборРегистраОкладов();

КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)

	//+ИИТ_Аксеньюшкин
	ИИТ_ТипРезиденстваПриИзменении(Неопределено);
	РегистрацияОрганУчетаПриИзмененииНаСервере();
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаСервере
Процедура АЛФ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)

	//+ИИТ_Аксеньюшкин
	ЗаписатьИсториюСтавок();
	УстановитьОтборРегистраСтавок();
	//-ИИТ_Аксеньюшкин
	
	ЗаписатьИсториюОкладов();
	УстановитьОтборРегистраОкладов();
	
КонецПроцедуры

#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ПатентДатаДоКоторойОплаченПриИзменении(Элемент)
	ЗаписатьДатуДоКоторойОплачен();
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаписатьДатуДоКоторойОплачен()

	НоваяЗапись = РегистрыСведений.ИИТ_ОплатыПатентов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ФизическоеЛицо = ФизическоеЛицо.Ссылка;
	НоваяЗапись.ДатаОплаты = ФизическоеЛицо.ПатентДатаДоКоторойОплачен;
	НоваяЗапись.Записать(Истина);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура МедосмотрЗапрошеноПриИзменении()
	УстановитьВидимостьРеквизитовМедосмотра();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура МедосмотрНомерЗаявкиПриИзменении(Элемент)
	УстановитьВидимостьРеквизитовМедосмотра();
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УстановитьВидимостьРеквизитовМедосмотра()
	Элементы.МедосмотрНомерЗаявки.Доступность = (ФизическоеЛицо.МедосмотрЗапрошено = ПредопределенноеЗначение("Перечисление.ИИТ_ЗапрошеноНезапрошено.Запрошено"));
	Элементы.МедосмотрПолучено.Доступность = (ФизическоеЛицо.МедосмотрЗапрошено = ПредопределенноеЗначение("Перечисление.ИИТ_ЗапрошеноНезапрошено.Запрошено") 
								И ЗначениеЗаполнено(ФизическоеЛицо.МедосмотрНомерЗаявки));
КонецПроцедуры
  
Процедура УстановитьВидимость() 
	УстановитьВидимостьРеквизитовМедосмотра();	
	УстановитьВидимостьСтавкииОклада();
КонецПроцедуры

Процедура УстановитьВидимостьСтавкииОклада() 
	Если ФизическоеЛицо.АС_ФиксированнаяОплатаТруда Тогда  
		Элементы.ИИТ_ИсторияСтавок.Видимость = Ложь;
		Элементы.АС_ИсторияОкладов.Видимость = Истина;
	Иначе	
		Элементы.ИИТ_ИсторияСтавок.Видимость = Истина; 
		Элементы.АС_ИсторияОкладов.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ТипРезиденстваПриИзменении(Элемент)

	Если ФизическоеЛицо.ИИТ_ТипРезиденства = ПредопределенноеЗначение("Перечисление.ИИТ_ТипыРезиденства.Патент") ИЛИ 
	ФизическоеЛицо.ИИТ_ТипРезиденства = ПредопределенноеЗначение("Перечисление.ИИТ_ТипыРезиденства.ПустаяСсылка") Тогда
		Элементы.ГруппаСтраницыТипРезиденства.ТекущаяСтраница = Элементы.ГруппаСтраницыТипРезиденства.ПодчиненныеЭлементы.СтраницаПатент;	
	ИначеЕсли ФизическоеЛицо.ИИТ_ТипРезиденства = ПредопределенноеЗначение("Перечисление.ИИТ_ТипыРезиденства.РВП") Тогда
		Элементы.ГруппаСтраницыТипРезиденства.ТекущаяСтраница = Элементы.ГруппаСтраницыТипРезиденства.ПодчиненныеЭлементы.СтраницаРВП;	
	ИначеЕсли ФизическоеЛицо.ИИТ_ТипРезиденства = ПредопределенноеЗначение("Перечисление.ИИТ_ТипыРезиденства.ВНЖ") Тогда
		Элементы.ГруппаСтраницыТипРезиденства.ТекущаяСтраница = Элементы.ГруппаСтраницыТипРезиденства.ПодчиненныеЭлементы.СтраницаВНЖ;	
	ИначеЕсли ФизическоеЛицо.ИИТ_ТипРезиденства = ПредопределенноеЗначение("Перечисление.ИИТ_ТипыРезиденства.ЕАЭС") Тогда
		Элементы.ГруппаСтраницыТипРезиденства.ТекущаяСтраница = Элементы.ГруппаСтраницыТипРезиденства.ПодчиненныеЭлементы.СтраницаЕАЭС;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АС_ФиксированнаяОплатаТрудаПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура РегистрацияОрганУчетаПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(ФизическоеЛицо.РегистрацияОрганУчета) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИИТ_АдресаОбщежитий.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИИТ_АдресаОбщежитий КАК ИИТ_АдресаОбщежитий
		|ГДЕ
		|	ИИТ_АдресаОбщежитий.ОрганПоставившийНаУчет = &ОрганПоставившийНаУчет";
		Запрос.УстановитьПараметр("ОрганПоставившийНаУчет", ФизическоеЛицо.РегистрацияОрганУчета);
		МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Элементы.РегистрацияМесто.СписокВыбора.ЗагрузитьЗначения(МассивСсылок);
		
		Если МассивСсылок.Количество() = 1 Тогда
			ФизическоеЛицо.РегистрацияМесто = МассивСсылок[0];
		КонецЕсли;
		
		Для Каждого СтрокаКИ Из ФизическоеЛицо.РегистрацияОрганУчета.КонтактнаяИнформация Цикл
			Если СтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") И ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
				ФизическоеЛицо.РегистрацияАдресОргана = СтрокаКИ.Представление;
			КонецЕсли;
		КонецЦикла;

	Иначе

		Элементы.РегистрацияМесто.СписокВыбора.Очистить();
	
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура РегистрацияОрганУчетаПриИзменении(Элемент)
	РегистрацияОрганУчетаПриИзмененииНаСервере();
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УстановитьТекущуюСтавку()

	ИИТ_СтавкаВЧас = ИИТ_ВспомогательныеФункцииСервер.ПолучитьСтавкуСотрудника(ФизическоеЛицо.Ссылка);

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УстановитьОтборРегистраСтавок()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ИсторияИзмененияСтавок.Период КАК Период,
	|	ИИТ_ИсторияИзмененияСтавок.Ставка КАК Ставка
	|ИЗ
	|	РегистрСведений.ИИТ_ИсторияИзмененияСтавок КАК ИИТ_ИсторияИзмененияСтавок
	|ГДЕ
	|	ИИТ_ИсторияИзмененияСтавок.ФизЛицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ФизЛицо", ФизическоеЛицо.Ссылка);
	
	ИИТ_ИсторияСтавок.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаписатьИсториюСтавок()
	
	НаборЗаписей = РегистрыСведений.ИИТ_ИсторияИзмененияСтавок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизЛицо.Установить(ФизическоеЛицо.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
	СправочникОбъект = ФизическоеЛицо.Ссылка.ПолучитьОбъект();

	Для Каждого СтрокаИстории Из ИИТ_ИсторияСтавок Цикл
		НоваяЗапись = РегистрыСведений.ИИТ_ИсторияИзмененияСтавок.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = СтрокаИстории.Период;
		НоваяЗапись.Ставка = СтрокаИстории.Ставка;
		НоваяЗапись.ФизЛицо = ФизическоеЛицо.Ссылка;
		НоваяЗапись.Записать(Истина);
		
		СправочникОбъект.ИИТ_ОкладВЧас = СтрокаИстории.Ставка;
	КонецЦикла;
	
	СправочникОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаписатьИсториюОкладов()
	
	НаборЗаписей = РегистрыСведений.АС_ИсторияИзмененияОклада.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизЛицо.Установить(ФизическоеЛицо.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
	Для Каждого СтрокаИстории Из АС_ИсторияОкладов Цикл
		НоваяЗапись = РегистрыСведений.АС_ИсторияИзмененияОклада.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период 		= СтрокаИстории.Период;
		НоваяЗапись.Оклад 		= СтрокаИстории.Оклад;
		НоваяЗапись.ТипОклада 	= СтрокаИстории.ТипОклада;
		НоваяЗапись.ФизЛицо 	= ФизическоеЛицо.Ссылка;
		НоваяЗапись.Записать(Истина);
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьОтборРегистраОкладов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АС_ИсторияИзмененияОклада.Период КАК Период,
	|	АС_ИсторияИзмененияОклада.ФизЛицо КАК ФизЛицо,
	|	АС_ИсторияИзмененияОклада.ТипОклада КАК ТипОклада,
	|	АС_ИсторияИзмененияОклада.Оклад КАК Оклад
	|ИЗ
	|	РегистрСведений.АС_ИсторияИзмененияОклада КАК АС_ИсторияИзмененияОклада
	|ГДЕ
	|	АС_ИсторияИзмененияОклада.ФизЛицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ФизЛицо", ФизическоеЛицо.Ссылка);
	
	АС_ИсторияОкладов.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	//Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.Серия) 
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.Номер)
		Или НЕ ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.ДатаВыдачи)Тогда 
				
		//Элементы.ДокументыФизическихЛицСерия.ОтметкаНезаполненного 			= Не ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.Серия);  
		Элементы.ДокументыФизическихЛицНомер.ОтметкаНезаполненного 			= Не ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.Номер);
		Элементы.ДокументыФизическихЛицДатаВыдачи.ОтметкаНезаполненного 	= НЕ ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.ДатаВыдачи);
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.Номер) Тогда 
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = "Заполните номер документа для записи физического лица"; 
			 Сообщение.Сообщить();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДокументыФизическихЛиц.ДатаВыдачи) Тогда 
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = "Заполните Дату выдачи документа для записи физического лица"; 
			 Сообщение.Сообщить();
		 КонецЕсли;
		 
		Отказ = Истина; 
	КонецЕсли; 		

КонецПроцедуры
	
#КонецОбласти
