
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	//Элементы формы
	ИИТ_ГруппаПериодВыполненияРабот = Элементы.Добавить("ИИТ_ГруппаПериодВыполненияРабот", Тип("ГруппаФормы"), Элементы.ГруппаШапкаПравая);
	ИИТ_ГруппаПериодВыполненияРабот.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ИИТ_ГруппаПериодВыполненияРабот.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ИИТ_ГруппаПериодВыполненияРабот.Отображение = ОтображениеОбычнойГруппы.Нет;
	ИИТ_ГруппаПериодВыполненияРабот.ОтображатьЗаголовок = Ложь;  	

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДатаНачала", Тип("ПолеФормы"), ИИТ_ГруппаПериодВыполненияРабот);
	ПолеВвода_АЛФ.Заголовок = "С";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДатаНачала";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДатаОкончания", Тип("ПолеФормы"), ИИТ_ГруппаПериодВыполненияРабот);
	ПолеВвода_АЛФ.Заголовок = "по";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ДатаОкончания";

	ЭлементТаблицыФормы = Элементы.Вставить("УслугиИИТ_Этап", Тип("ПолеФормы"), Элементы.Услуги, Элементы.ГруппаУслугиНоменклатура);
	ЭлементТаблицыФормы.Заголовок = "Этап"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.ИИТ_Этап";
	
КонецПроцедуры
