
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АЛФ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
#Вставка
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ФизЛицо", Тип("ПолеФормы"), Элементы.ГруппаКонтрагент);
	ПолеВвода_АЛФ.Заголовок = "МОЛ";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ФизЛицо";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ФизЛицоПриИзменении");
#КонецВставки
	ПриходныйКассовыйОрдерФормы.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

	#Область УХ_Казначейство
	ДенежныеСредстваВстраиваниеФормыУХ.СоздатьЭлементВидОперацииУХ(ЭтотОбъект);
	УстановитьПараметрыВыбора();
	ЗарегистрироватьСтатьиБюджетаИАналитики();
	// ограничения видов операций 
	ЗаявкиНаОперацииКлиентСервер.УстановитьОграничениеВидыОпераций(ЭтотОбъект, "ВидОперацииУХ");
	#КонецОбласти
	
#Вставка
	//+ИИТ_Аксеньюшкин
	Если ЗначениеЗаполнено(Объект.ПринятоОт) Тогда
		ИИТ_ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(Объект.ПринятоОт, Истина);
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
#КонецВставки

КонецПроцедуры

&НаСервере
Процедура АЛФ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//+ИИТ_Аксеньюшкин
	Если Не ЗначениеЗаполнено(ИИТ_ФизЛицо) Тогда
		Сообщить("Не заполнено значение реквизита ""МОЛ""");
		Отказ = Истина;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("КонтрагентПриИзмененииСервер")
Процедура АЛФ_КонтрагентПриИзмененииСервер()
	
#Вставка
	//+ИИТ_Аксеньюшкин
	ТЗРасшифровка = Объект.РасшифровкаПлатежа.Выгрузить();
	//-ИИТ_Аксеньюшкин
#КонецВставки
	ПриходныйКассовыйОрдерФормы.КонтрагентПриИзмененииСервер(ЭтотОбъект);

#Вставка
	//+ИИТ_Аксеньюшкин
	Объект.РасшифровкаПлатежа.Загрузить(ТЗРасшифровка);
	Для Каждого СтрокаРасшифровки Из Объект.РасшифровкаПлатежа Цикл
		СтрокаРасшифровки.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЦикла;
	//-ИИТ_Аксеньюшкин
#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("КонтрагентЮрФизЛицоПриИзменении")
Процедура АЛФ_КонтрагентЮрФизЛицоПриИзменении(Элемент)

#Вставка
	//+ИИТ_Аксеньюшкин
	ТЗРасшифровка = Объект.РасшифровкаПлатежа.Выгрузить();
#КонецВставки
	ПриходныйКассовыйОрдерФормыКлиентСервер.УстановитьОграничениеТипаКонтрагента(ЭтотОбъект);
#Вставка
	Объект.РасшифровкаПлатежа.Загрузить(ТЗРасшифровка);
	Для Каждого СтрокаРасшифровки Из Объект.РасшифровкаПлатежа Цикл
		СтрокаРасшифровки.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЦикла;
	//-ИИТ_Аксеньюшкин
#КонецВставки

КонецПроцедуры

#Область Перенос_доработок

//ИИТ_Аксеньюшкин
&НаКлиенте  

Процедура ИИТ_ФизЛицоПриИзменении(Элемент)
	Объект.ПринятоОт = Строка(ИИТ_ФизЛицо);
КонецПроцедуры
	
#КонецОбласти