
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ
			|	РегистрСведенийОсновныеСотрудникиФизическихЛиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РегистрСведенийОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Сотрудники_ДатыПриема.ДатаПриема КАК ДатаНачала,
			|	Сотрдуники_ДатыУвольнения.ДатаУвольнения КАК ДатаОкончания,
			|	РегистрСведенийОсновныеСотрудникиФизическихЛиц.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.ОсновныеСотрудникиФизическихЛиц КАК РегистрСведенийОсновныеСотрудникиФизическихЛиц
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПриемНаРаботу.Сотрудник КАК Сотрудник,
			|			МИНИМУМ(ПриемНаРаботу.ДатаПриема) КАК ДатаПриема
			|		ИЗ
			|			Документ.ПриемНаРаботу КАК ПриемНаРаботу
			|		ГДЕ
			|			ПриемНаРаботу.Проведен
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ПриемНаРаботу.Сотрудник) КАК Сотрудники_ДатыПриема
			|		ПО РегистрСведенийОсновныеСотрудникиФизическихЛиц.Сотрудник = Сотрудники_ДатыПриема.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			Увольнение.Сотрудник КАК Сотрудник,
			|			МАКСИМУМ(Увольнение.ДатаУвольнения) КАК ДатаУвольнения
			|		ИЗ
			|			Документ.Увольнение КАК Увольнение
			|		ГДЕ
			|			Увольнение.Проведен
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Увольнение.Сотрудник) КАК Сотрдуники_ДатыУвольнения
			|		ПО РегистрСведенийОсновныеСотрудникиФизическихЛиц.Сотрудник = Сотрдуники_ДатыУвольнения.Сотрудник";

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "РегистрСведений.ОсновныеСотрудникиФизическихЛиц";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);   

КонецПроцедуры
