
&ИзменениеИКонтроль("ВидимостьГруппыСтраниц")
Функция АЛФ_ВидимостьГруппыСтраниц(ВидОперации)

#Вставка
	Возврат Истина;
#КонецВставки

	Возврат ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеПодотчетномуЛицу
	И ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога
	И ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ЛичныеСредстваПредпринимателя
	И ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВыдачаЗаймаРаботнику
	И ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.КомиссияБанка;

КонецФункции
