
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//ТЧ Товары + 1 Группа
	ГруппаКолонок_НГ3 = Элементы.Вставить("ТоварыГруппа1", Тип("ГруппаФормы"), Элементы.Товары, Элементы.ТоварыКоличествоМест); 
	ГруппаКолонок_НГ3.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_НГ3.Группировка = ГруппировкаКолонок.Вертикальная;
	ГруппаКолонок_НГ3.ОтображатьВШапке = Ложь;  
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыИнвентарныйНомер", Тип("ПолеФормы"), ГруппаКолонок_НГ3);
	ЭлементТаблицыФормы.Заголовок = "Инвентарный номер"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ИнвентарныйНомер";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыСерийныйНомер", Тип("ПолеФормы"), ГруппаКолонок_НГ3);
	ЭлементТаблицыФормы.Заголовок = "Серийный номер"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.СерийныйНомер";
	
КонецПроцедуры
