
&ИзменениеИКонтроль("ОбработатьДокументыКомплекта")
Процедура АЛФ_ОбработатьДокументыКомплекта(Форма, ПараметрыСоздания, ОповещениеНаКлиенте)

	БылоЗапрещеноРедактировать = Ложь;
	ТипыДокументовДляИзмененияДаты = Новый Массив;

	Для Каждого ДанныеСозданного Из ПараметрыСоздания.СозданныеДокументы Цикл

		ПодходящиеТипы = ПодходящиеТипыРаспознанногоДокумента(ДанныеСозданного.Ключ);
		Для Каждого ТипРаспознанного Из ПодходящиеТипы Цикл
			Если ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного] <> Неопределено Тогда
				Если ТипЗнч(ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного]) = Тип("Структура") Тогда
					Если ЗначениеЗаполнено(ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного].ПараметрыЗаполнения) Тогда
						// Для данного ТипРаспознанного уже заполнены ПараметрыЗаполнения
						Прервать;
					Иначе
						ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного] = ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного].Ссылка;
					КонецЕсли;
				КонецЕсли;
				ДанныеРаспознанного = Новый Структура("Ссылка, ПараметрыЗаполнения", ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного], Неопределено);
				Если ДанныеСозданного.Значение.СоздатьДокумент Тогда

					ДанныеРаспознанного.ПараметрыЗаполнения = РаспознаваниеДокументовКомплектыВызовСервера.ПараметрыЗаполненияДляСозданияДокумента(
					ДанныеРаспознанного.Ссылка,
					ТипРаспознанного,
					ДанныеСозданного.Ключ,
					ПараметрыСоздания.ПараметрыОперации
					);

					#Если Не Сервер И Не ВнешнееСоединение Тогда
						// Проверка на запрет редактирования
						РедактированиеЗапрещено = РаспознаваниеДокументовКомплектыВызовСервера.ЗапрещеноСозданиеДокументаВЗакрытомПериоде(
						ДанныеРаспознанного.ПараметрыЗаполнения.ТипДокументаСтрокой,
						ДанныеРаспознанного.ПараметрыЗаполнения.Дата
						);

						Если РедактированиеЗапрещено Тогда
							Если Не БылоЗапрещеноРедактировать Тогда
								БылоЗапрещеноРедактировать = Истина;
							КонецЕсли;
							ТипыДокументовДляИзмененияДаты.Добавить(ТипРаспознанного);
						КонецЕсли;
					#Иначе
						// Ничего делать не нужно: при попытке проведения будет получен отказ, а сообщение об ошибке будет показано пользователю в отчете
					#КонецЕсли
				КонецЕсли;
				ПараметрыСоздания.РаспознанныеДокументыПоТипам[ТипРаспознанного] = ДанныеРаспознанного;
			КонецЕсли;
		КонецЦикла;

	КонецЦикла;

	#Если Не Сервер И Не ВнешнееСоединение Тогда
		Если БылоЗапрещеноРедактировать Тогда

			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", Форма);
			ДополнительныеПараметры.Вставить("ПараметрыСоздания", ПараметрыСоздания);
			ДополнительныеПараметры.Вставить("ОповещениеНаКлиенте", ОповещениеНаКлиенте);
			ДополнительныеПараметры.Вставить("ТипыДокументовДляИзмененияДаты", ТипыДокументовДляИзмененияДаты);

			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаСменыДаты", ЭтотОбъект, ДополнительныеПараметры);

			ТекстВопроса = НСтр("ru = 'Дата документа находится в закрытом периоде.
			|Изменить дату документа на текущую?'");

#Вставка
		//+ИИТ_Аксеньюшкин
		Возврат;
		//-ИИТ_Аксеньюшкин
#КонецВставки
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
			Возврат;
		КонецЕсли;
	#КонецЕсли

	СоздатьДокументыКомплекта(Форма, ПараметрыСоздания, ОповещениеНаКлиенте);

КонецПроцедуры
