
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ВидМаршрута", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Вид маршрута";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ВидМаршрута";

КонецПроцедуры

&НаСервере
Процедура АЛФ_ПриЧтенииНаСервереВместо(ТекущийОбъект)
	Если ЗначениеЗаполнено(ТекущийОбъект.ИмяПредопределенныхДанных) Тогда
		//ТВН++ Модификация стандартного кода для доступа к собственному реквизиту
		//ЭтотОбъект.ТолькоПросмотр = Истина;		
    	Элементы.СтраницыРеквизитов.ТолькоПросмотр = Истина;		
	КонецЕсли; 
КонецПроцедуры


