
&ИзменениеИКонтроль("МожноЛиЗанятьФайл")
Функция АЛФ_МожноЛиЗанятьФайл(ДанныеФайла, ТекстСообщения)

	Если ДанныеФайла.ПометкаУдаления Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Невозможно отредактировать файл ""%1"",
		|т.к. он помечен на удаление.'"),
		Строка(ДанныеФайла.Ссылка));
		Возврат Ложь;
	КонецЕсли;

	Если ДанныеФайла.Служебный Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Невозможно отредактировать служебный файл ""%1"".'"),
		Строка(ДанныеФайла.Ссылка));
		Возврат Ложь;
	КонецЕсли;

	Результат = Не ЗначениеЗаполнено(ДанныеФайла.Редактирует) Или ДанныеФайла.ФайлРедактируетТекущийПользователь;  
	Если Не Результат Тогда
#Удаление		
		Если ЗначениеЗаполнено(ДанныеФайла.ДатаЗаема) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл ""%1""
			|уже занят для редактирования пользователем ""%2"" с %3.'"),
			Строка(ДанныеФайла.Ссылка), Строка(ДанныеФайла.Редактирует), Формат(ДанныеФайла.ДатаЗаема, "ДЛФ=ДВ"));
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл ""%1""
			|уже занят для редактирования пользователем
			|""%2"".'"),
			Строка(ДанныеФайла.Ссылка), Строка(ДанныеФайла.Редактирует));
		КонецЕсли;
#КонецУдаления		
	КонецЕсли;

	Возврат Результат;

КонецФункции
