#Область Перенос_доработок

//ИИТ_Аксеньюшкин
Функция ДокументИмеетТипАвансовыйОтчет(ВладелецФайла_)
	Возврат (ТипЗнч(ВладелецФайла_) = Тип("ДокументСсылка.АвансовыйОтчет"));
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ДоступнаПометкаНаУдаление()
	Возврат Истина;// РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_Снабжение") ИЛИ РольДоступна("ИИТ_РуководительСнабжения"); 
КонецФункции

//ИИТ_Аксеньюшкин
Функция ДоступныПолныеПрава()
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция НаименованиеФайла(ФайлСсылка)
	Возврат ФайлСсылка.Наименование;
КонецФункции

//ИИТ_Аксеньюшкин
&НаКлиенте
Функция ПолучитьМассивВыделенныхФайлов()
	
	МассивФайлов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		МассивФайлов.Добавить(ДанныеСтроки.Ссылка);
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервере
Функция ПолучитьМассивФайлов()

	Запрос = Новый Запрос;
	Запрос.Текст = Список.ТекстЗапроса;
	Для Каждого Параметр Из Список.Параметры.Элементы Цикл
		Запрос.УстановитьПараметр(Строка(Параметр.Параметр), Параметр.Значение);
	КонецЦикла;
	ТЗФайлы = Запрос.Выполнить().Выгрузить();

	Возврат ТЗФайлы.ВыгрузитьКолонку("Ссылка");

КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПомеченНаУдаление(ФайлСсылка)
	Возврат ФайлСсылка.ПометкаУдаления;
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция РасширениеФайла(ФайлСсылка)
	Возврат ФайлСсылка.Расширение;
КонецФункции

//ИИТ_Аксеньюшкин
Функция ТипЕжедневныйТабель()
	Возврат (ТипЗнч(ВладелецФайла) = Тип("ДокументСсылка.ИИТ_ЕжедневныйТабельУчета"));
КонецФункции

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_СкачатьВыделенныеФайлы(Команда)

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяКаталога = ДиалогВыбора.Каталог;
	Иначе
		Возврат;
	КонецЕсли;
	
	МассивФайлов = ПолучитьМассивВыделенныхФайлов();
	МассивИменФайлов = Новый Массив;
	
	Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		
		Если ПомеченНаУдаление(ПрисоединенныйФайл) Тогда
			Продолжить;
		КонецЕсли;

		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(ПрисоединенныйФайл,, Новый УникальныйИдентификатор);
		ПутьКФайлу = ИмяКаталога + "\" + НаименованиеФайла(ПрисоединенныйФайл) + "." + РасширениеФайла(ПрисоединенныйФайл);
		АдресФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		
		ПередаваемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(ПутьКФайлу, АдресФайла);
		ПередаваемыеФайлы.Добавить(Описание);
		
		// Сохраним Файл из БД на диск.
		Если ПолучитьФайлы(ПередаваемыеФайлы,, ИмяКаталога + "\", Ложь) Тогда
			Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
				УдалитьИзВременногоХранилища(АдресФайла);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Сообщить("Загрузка завершена");

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура СкачатьФайлы(Команда)

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Расширение = "zip";
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяАрхива = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
	МассивФайлов = ПолучитьМассивФайлов();
	МассивИменФайлов = Новый Массив;
	
	Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		
		Если ПомеченНаУдаление(ПрисоединенныйФайл) Тогда
			Продолжить;
		КонецЕсли;

		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(ПрисоединенныйФайл,, Новый УникальныйИдентификатор);
		ПутьКФайлу = КаталогВременныхФайлов() + НаименованиеФайла(ПрисоединенныйФайл) + "." + РасширениеФайла(ПрисоединенныйФайл);
		АдресФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		
		ПередаваемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(ПутьКФайлу, АдресФайла);
		ПередаваемыеФайлы.Добавить(Описание);
		
		// Сохраним Файл из БД на диск.
		Если ПолучитьФайлы(ПередаваемыеФайлы,, КаталогВременныхФайлов(), Ложь) Тогда
			Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
				УдалитьИзВременногоХранилища(АдресФайла);
			КонецЕсли;
		КонецЕсли;
		
		//РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, Неопределено);
		МассивИменФайлов.Добавить(ПутьКФайлу);

	КонецЦикла;

	ЗаписьZIP = Новый ЗаписьZipФайла(ИмяАрхива);
	Для Каждого ИмяФайла Из МассивИменФайлов Цикл
		ЗаписьZIP.Добавить(ИмяФайла);
	КонецЦикла;
	ЗаписьZIP.Записать();	
	
КонецПроцедуры

#КонецОбласти    

&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)  
	
	////+ИИТ_Аксеньюшкин
	//Если ТипЕжедневныйТабель() Тогда
	//	ТабельЗаблокирован = ИИТ_ВспомогательныеФункцииСервер.ТабельВключенВТУЗО(ВладелецФайла);
	//	Если ТабельЗаблокирован Тогда
	//		Элементы.Добавить.Видимость = Ложь;
	//		Элементы.ПодменюДобавить.Видимость = Ложь;
	//		Элементы.ДобавитьИзФайлаНаДиске.Видимость = Ложь;
	//		Элементы.ДобавитьФайлПоШаблону.Видимость = Ложь;
	//		Элементы.ДобавитьФайлСоСканера.Видимость = Ложь;
	//		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.Добавить.Видимость = Ложь;
	//		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюДобавить.Видимость = Ложь;
	//		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюДобавить.ПодчиненныеЭлементы.ДобавитьИзФайлаНаДиске.Видимость = Ложь;
	//		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюДобавить.ПодчиненныеЭлементы.ДобавитьФайлПоШаблону.Видимость = Ложь;
	//		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюДобавить.ПодчиненныеЭлементы.ДобавитьФайлСоСканера.Видимость = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	////-ИИТ_Аксеньюшкин  
	
КонецПроцедуры

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	КомандаФормы = Команды.Добавить("ИИТ_СкачатьВыделенныеФайлы");  
	КомандаФормы.Заголовок = "Скачать выделенные файлы";
	КомандаФормы.Действие  = "ИИТ_СкачатьВыделенныеФайлы"; 
	КомандаФормы.Картинка  = БиблиотекаКартинок.Папки;
	
	КнопкаФормы = Элементы.Вставить("ФормаИИТ_СкачатьВыделенныеФайлы", Тип("КнопкаФормы"),  Элементы.ФормаКоманднаяПанель, Элементы.ПодменюСоздатьНаОсновании);
	КнопкаФормы.Заголовок 	= "Скачать выделенные файлы";
	КнопкаФормы.ИмяКоманды 	= "ИИТ_СкачатьВыделенныеФайлы";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаФормы.Картинка 	 = БиблиотекаКартинок.СохранитьЗначения;
	КнопкаФормы.РасширеннаяПодсказка.Заголовок 	= "Скачать выделенные файлы";

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьПометкуУдаленияЗавершение")
Процедура АЛФ_УстановитьПометкуУдаленияЗавершение(Результат, ДополнительныеПараметры)

	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСнятьПометкуУдаления(ДополнительныеПараметры.Файлы);
		ПараметрыОповещенияЗаписиФайла = РаботаСФайламиСлужебныйКлиент.ПараметрыОповещенияЗаписиФайла("ДанныеФайлаИзменены");
		Оповестить("Запись_Файл", ПараметрыОповещенияЗаписиФайла, Элементы.Список.ВыделенныеСтроки);
		Элементы.Список.Обновить(); 
		#Вставка
		   УдалитьФайлИзВсеФайлы(ДополнительныеПараметры.Файлы);
		#КонецВставки
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура УдалитьФайлИзВсеФайлы(МассивФайлов) 
	Для Каждого Стр Из МассивФайлов Цикл 
		 НаборЗаписей = РегистрыСведений.АС_ПрисоединенныеФайлы.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ПрисоединенныйФайл.Установить(Стр);  
		 НаборЗаписей.Записать();
	КонецЦикла;	
КонецПроцедуры	
