
&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)

	Если Найти(Заголовок, "Выберите счет для замены") > 0 Тогда
		ПозицияСимвола = Найти(Заголовок, ":");
		УстановитьОтборПоОрганизацииПриЗаменеСчета(Прав(Заголовок, СтрДлина(Заголовок) - ПозицияСимвола));
		Заголовок = "Выберите счет для замены";
	КонецЕсли;                          
	
   	УдалитьОтборПоВалютеПриЗаменеСчета();
	
КонецПроцедуры

Процедура УстановитьОтборПоОрганизацииПриЗаменеСчета(ОргНаименование)
	
	ОргСсылка = Справочники.Организации.НайтиПоНаименованию(СокрЛП(ОргНаименование), Истина);
	
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ОргСсылка;
	
КонецПроцедуры

Процедура УдалитьОтборПоВалютеПриЗаменеСчета()
	Для каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл 
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = 	"ВалютаДенежныхСредств" Тогда 
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	ПоискПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("", );
КонецПроцедуры
