
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЭлементТаблицыФормы = Элементы.Вставить("ВидНоменклатуры", Тип("ПолеФормы"), Элементы.Список, Элементы.ЕдиницаИзмерения);
	ЭлементТаблицыФормы.Заголовок = "Вид номенклатуры";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ВидНоменклатуры";

	ЭлементТаблицыФормы = Элементы.Вставить("ИИТ_Автор", Тип("ПолеФормы"), Элементы.Список, Элементы.Ссылка);
	ЭлементТаблицыФормы.Заголовок = "Автор";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ИИТ_Автор";
	
КонецПроцедуры
