
&ИзменениеИКонтроль("УправлениеФормой_ВерсияСоглашенияКоммерческийДоговор")
Процедура АЛФ_УправлениеФормой_ВерсияСоглашенияКоммерческийДоговор(Форма)

     УправлениеФормой_ОбщееДляДоговоров(Форма);
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	ВалютаРегламентированногоУчета = Форма.ВалютаРегламентированногоУчета;
	
	Элементы.ГруппаЕстьПретензия.Видимость = ЗначениеЗаполнено(Объект.Претензия);
	
	ЭтоРамочноеСоглашение 		= (Объект.ВидСоглашения 
									= ПредопределенноеЗначение("Перечисление.ВидыСоглашений.РамочныйДоговор"));
	
	ЭтоДоговорФинансовогоИнструмента = УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорФинансовогоИнструмента(Объект.ВидДоговораУХ);
	
	ЭтоФиксированныйКурс		= (Объект.СпособОпределенияКурсаПлатежа 
									= ПредопределенноеЗначение("Перечисление.СпособыОпределенияКурсаПлатежа.ФиксированныйКурс"));
	ЭтоКурсНаДатуПлатежа 		= (Объект.СпособОпределенияКурсаПлатежа 
									= ПредопределенноеЗначение("Перечисление.СпособыОпределенияКурсаПлатежа.КурсНаДатуПлатежа"));								
	ЭтоКурсНаФиксированнуюДату 	= (Объект.СпособОпределенияКурсаПлатежа 
									= ПредопределенноеЗначение("Перечисление.СпособыОпределенияКурсаПлатежа.КурсНаФиксированнуюДату"));	 
	ОпределяетсяВЗаявке		 	= (Объект.СпособОпределенияКурсаПлатежа 
									= ПредопределенноеЗначение("Перечисление.СпособыОпределенияКурсаПлатежа.ОпределяетсяВЗаявке")); 
	ЭтоДоговорССамозанятым		= Объект.НалогообложениеКонтрагента
									= ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.НалогНаПрофессиональныйДоход"); 
																		
	ИспользоватьГрафикПоставок = Объект.ГрафикДоговора = ПредопределенноеЗначение("Перечисление.ГрафикиДоговора.ГрафикПоставок");
		
	ВыполнятьКонтрольСуммыРасходаПоДоговору = Форма.ВыполнятьКонтрольСуммыРасходаПоДоговору;
									
	ДоговорыКонтрагентовВстраиваниеУХКлиентСервер.УправлениеФормой_ВерсияСоглашенияКоммерческийДоговор(Форма);	
	
	УправлениеФормой_ПараметрыУчетаФИ(Форма);
	
	// Реквизиты валютного контроля.	
	УправлениеФормой_ВалютныйКонтроль(Форма);
	
	// Курс пересчета
	РазличаютсяВалютыВзаиморасчетовИПлатежа = (Объект.ВалютаВзаиморасчетов <> Объект.ОсновнаяВалютаПлатежей);

	Элементы.ГруппаНДС.Видимость = Не ЭтоДоговорССамозанятым;	
	Элементы.ГруппаКурсПлатежа.Видимость 				= РазличаютсяВалютыВзаиморасчетовИПлатежа;  
	
	Если ЭтоФиксированныйКурс Тогда  
		// Для фикс. курса: "Курс оплаты: фиксированный XXX ВалютаОплаты за YYY ВалютаВзаиморасчетов"
		Элементы.ГруппаКурсПлатежа.ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = 'Курс оплаты: фиксированный %1 %2 за %3 %4'"),
																Объект.КурсПлатежа,
																Объект.ОсновнаяВалютаПлатежей,
																Объект.КратностьПлатежа,
																Объект.ВалютаВзаиморасчетов);
	ИначеЕсли ЭтоКурсНаДатуПлатежа И Объект.СдвигДатыФиксацииКурсаПлатежа = 0 Тогда 												
		// Для курса на дату оплаты: "Курс оплаты: на дату оплаты"
		Элементы.ГруппаКурсПлатежа.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Курс оплаты: на дату оплаты'");	                                        
	ИначеЕсли ЭтоКурсНаДатуПлатежа Тогда 			
		// Для курса на дату оплаты со сдвигом: "Курс оплаты: за X дней до даты оплаты"
		ОписаниеДлительности = НСтр("ru = ';%1 день;;%1 дня;%1 дней;'");
		Элементы.ГруппаКурсПлатежа.ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = 'Курс оплаты: за %1 до даты оплаты'"),
																СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ОписаниеДлительности, Объект.СдвигДатыФиксацииКурсаПлатежа));
	ИначеЕсли ЭтоКурсНаФиксированнуюДату Тогда	
		// На указанную дату: "Курс оплаты: на дату УказаннаяДата"   
		Элементы.ГруппаКурсПлатежа.ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = 'Курс оплаты: на дату %1'"),
																Формат(Объект.ДатаФиксацииКурсаПлатежа, "ДЛФ=D"));
	ИначеЕсли ОпределяетсяВЗаявке Тогда                                                                                                                           
		Элементы.ГруппаКурсПлатежа.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Курс оплаты: определяется в заявке'");																	
	Иначе
		Элементы.ГруппаКурсПлатежа.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Курс оплаты'");															
	КонецЕсли;
	
	Элементы.ГруппаФиксированныйКурс.Видимость			= ЭтоФиксированныйКурс;
	Элементы.ГруппаКурсНаДатуПлатежа.Видимость			= ЭтоКурсНаДатуПлатежа;		
	Элементы.ГруппаКурсНаФиксированнуюДату.Видимость	= ЭтоКурсНаФиксированнуюДату;  
				
	Элементы.ГруппаКоридор.Видимость = (НЕ ЭтоФиксированныйКурс	И НЕ ОпределяетсяВЗаявке И РазличаютсяВалютыВзаиморасчетовИПлатежа);
		
	Элементы.ЗапретПлатежаВПрочихВалютах.ТолькоПросмотр = 
		(РазличаютсяВалютыВзаиморасчетовИПлатежа И ЭтоФиксированныйКурс);
		
	// Режимы контроля по договору
	Элементы.ОграничиватьСуммуЗадолженности.Видимость 	= Ложь;
	Элементы.КонтролироватьПревышениеСуммы.Видимость 	= Ложь;
	
	Элементы.ИдентификаторПлатежа.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ГосударственныйКонтракт);
		
	Элементы.ОсновнойПроект.Видимость 	= НЕ ИспользоватьГрафикПоставок;
	Элементы.ОсновнойЦФО.Видимость 		= НЕ ИспользоватьГрафикПоставок;
	
	Элементы.ГруппаСтатьяДДС.Видимость	= НЕ ИспользоватьГрафикПоставок;
	Элементы.ГруппаСтатьяБДР.Видимость 	= НЕ ИспользоватьГрафикПоставок;
											
	Элементы.ИсточникЛимитовБДДС.Видимость 			= НЕ ИспользоватьГрафикПоставок;
	Элементы.ИсточникЛимитовИсполнение.Видимость 	= НЕ ИспользоватьГрафикПоставок;
	
	// Формирование платежей.
	ПорядокРасчетов_ПоДоговорам = (Объект.ПорядокРасчетов = 
		ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"));		
		
	Элементы.ГрафикРасчетовОбновитьФактическиеДанные.Видимость 	= ПорядокРасчетов_ПоДоговорам;
	Элементы.ГрафикРасчетовПеренестиФакт.Видимость 				= ПорядокРасчетов_ПоДоговорам;   
	Элементы.ГрафикРасчетовПоказатьФактВГрафике.Видимость 		= ПорядокРасчетов_ПоДоговорам;
	
	Элементы.ГрафикРасчетовПоказатьФактВГрафике.Видимость 		= ПорядокРасчетов_ПоДоговорам;
	Элементы.ГрафикРасчетовЗаполнитьПлатежи.Видимость 			= НЕ ИспользоватьГрафикПоставок; 

	Элементы.РежимАктуализацииЗаявок.Видимость  	= РежимАктуализацииЗаявокВидимость(Объект);
	
	//Видимость группы рекомендуемого условия оплаты
	ЕстьРекомендуемоеУсловиеОплаты 			= ЗначениеЗаполнено(Форма.РекомендуемоеУсловиеОплаты);
	ЕстьЗамечанияПоРекомендуемомуУсловию 	= ЗначениеЗаполнено(Форма.СравнениеРекомендуемоеУсловиеОплаты);
	Элементы.РекомендуемоеУсловиеОплаты.Видимость 			= (ЕстьРекомендуемоеУсловиеОплаты) ;
	Элементы.ДекорацияПредупреждениеУсловиеОплаты.Видимость = (ЕстьРекомендуемоеУсловиеОплаты) И (ЕстьЗамечанияПоРекомендуемомуУсловию);
	
	
	Элементы.СтраницаПериодическиеОперации.Видимость = (Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.УниверсальноеПривлечение")
														ИЛИ Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.УниверсальноеРазмещение"));
	
	УправлениеФормой_ФиксированныеСчета(Форма);
	
	УправлениеФормой_Обеспечение(Форма);
	
	УправлениеФормой_ВнутригрупповыеДоговоры(Форма);
#Удаление	
	Если ВыполнятьКонтрольСуммыРасходаПоДоговору Тогда
		Форма.ФиксированнаяСуммаДоговора 					= Истина;
		Элементы.ФиксированнаяСуммаДоговора.ТолькоПросмотр 	= Истина;
	КонецЕсли;
#КонецУдаления	
	// Дополнительная видимость по видам договоров
	ЭтоСПоставщиком				 = УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорСПоставщиком(Объект.ВидДоговораУХ);
	ЭтоСПокупателем				 = УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорСПокупателем(Объект.ВидДоговораУХ);
	
	ЭтоСКомиссионером			 = УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорСКомиссионером(Объект.ВидДоговораУХ);
	ЭтоСКомитентом				 = УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорСКомитентом(Объект.ВидДоговораУХ);
		
	ЭтоЗалоги			 = (Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.ЗалогиИПоручительстваВходящие")
							ИЛИ Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.ЗалогиИПоручительстваИсходящие"));
	ЭтоСтрахование		 = (Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.Страхование"));
	
	// Установим видимость элементов.
	Элементы.УсловиеОплаты.Видимость = ЭтоСПоставщиком ИЛИ ЭтоСПокупателем ИЛИ ЭтоСКомиссионером ИЛИ ЭтоСКомитентом ИЛИ ЭтоСтрахование;
	
	Элементы.УсловияПоставкиИнкотермс.Видимость							= ЭтоСПоставщиком ИЛИ ЭтоСПокупателем;
	
	Элементы.ГруппаСтрахование.Видимость								= ЭтоСтрахование;
	Элементы.ГруппаОбъектыЗалога.Видимость								= ЭтоЗалоги;
	Элементы.ГруппаСведенияОбОбеспечении.Видимость 						= Не ЭтоЗалоги И Не ЭтоСтрахование;
	
	Элементы.ОсновноеОбязательство.Видимость = ДоступноОсновноеОбязательство(Объект.ВидДоговораУХ);
	
	Элементы.ГрафикРасчетовОбновитьЗаявки.Видимость						= ПорядокРасчетов_ПоДоговорам;
	Элементы.ГрафикРасчетовОбновитьЗаявкиПоВыделеннымСтрокам.Видимость	= ПорядокРасчетов_ПоДоговорам;
	Элементы.ГрафикРасчетовЛинейныйОбновитьЗаявкиПоВыделеннымСтрокамЛинейный.Видимость	= ПорядокРасчетов_ПоДоговорам;
	
	// Переопределим видимость группы "Только просмотр".
	Элементы.ГруппаТолькоПросмотр.Видимость = Элементы.ГруппаТолькоПросмотр.Видимость 
				И НЕ ЗначениеЗаполнено(Объект.Претензия);
	
	УправлениеФормой_ГрафикРасчетовКоммерческийДоговор(Форма);
	
	Элементы.УполномоченныйБанк.Видимость = (Объект.ТребуетсяПостановкаНаУчетВалютногоКонтроля Или Форма.ЭтоГосударственныйКонтракт);
	 #Удаление
	Элементы.ФиксированнаяСуммаДоговора.ТолькоПросмотр = НЕ Форма.РежимРедактирования Или ВыполнятьКонтрольСуммыРасходаПоДоговору; 
	#КонецУдаления
#Вставка
	Элементы.ФиксированнаяСуммаДоговора.ТолькоПросмотр = НЕ Форма.РежимРедактирования;
#КонецВставки
	Элементы.ГруппаСумма.ТолькоПросмотр 		= НЕ (Форма.РежимРедактирования И Форма.ФиксированнаяСуммаДоговора);  
	Элементы.СуммаВключаетНДС.ТолькоПросмотр 	= НЕ (Форма.РежимРедактирования И Форма.ФиксированнаяСуммаДоговора);  
	Элементы.СуммаНДС.ТолькоПросмотр 			= НЕ (Форма.РежимРедактирования И Форма.ФиксированнаяСуммаДоговора);  
		
	Элементы.СуммаДоговора.АвтоотметкаНезаполненного = (Форма.ВыполнятьКонтрольСуммыРасходаПоДоговору);
	
	Если ПорядокРасчетов_ПоДоговорам Тогда   
		Элементы.СтраницаПланЗакупок.Заголовок = НСтр("ru = 'График поставок'");
		Элементы.ГруппаГрафик.Заголовок = НСтр("ru = 'График расчетов'");
	Иначе       
		Элементы.СтраницаПланЗакупок.Заголовок = НСтр("ru = 'График поставок (предварительный)'");
		Элементы.ГруппаГрафик.Заголовок = НСтр("ru = 'График расчетов (предварительный)'");
	КонецЕсли;
	
	Если ЭтоСПоставщиком Тогда  
		Элементы.ГруппаИспользованиеГрафикаРасчетов.Заголовок = НСтр("ru = 'Использование графика поставок и графика расчетов'");
	Иначе
		Элементы.ГруппаИспользованиеГрафикаРасчетов.Заголовок = НСтр("ru = 'Использование графика расчетов'");
	КонецЕсли;
	
	Элементы.ГруппаПроверкаДублей.Видимость = Форма.ИспользоватьНумерациюДоговоровСПокупателями
		И ЗначениеЗаполнено(Форма.ПояснениеПроверкиДублей);
		
	ТекстЗаголовкаРасчеты = "";
	Если ЗначениеЗаполнено(Объект.Сумма) Тогда
		ТекстЗаголовкаРасчеты = Формат(Объект.Сумма, "ЧДЦ=2");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Сумма) Или Объект.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета Тогда
		Если Не ПустаяСтрока(ТекстЗаголовкаРасчеты) Тогда
			ТекстЗаголовкаРасчеты = СтрШаблон(НСтр("ru= '%1 '"), ТекстЗаголовкаРасчеты);
		КонецЕсли;
		ТекстЗаголовкаРасчеты = СтрШаблон(НСтр("ru= '%1%2'"), ТекстЗаголовкаРасчеты, Объект.ВалютаВзаиморасчетов);
	КонецЕсли;
	Если Объект.РасчетыВУсловныхЕдиницах Тогда
		Если Не ПустаяСтрока(ТекстЗаголовкаРасчеты) Тогда
			ТекстЗаголовкаРасчеты = СтрШаблон(НСтр("ru= '%1 '"), ТекстЗаголовкаРасчеты);
		КонецЕсли;
		ТекстЗаголовкаРасчеты = СтрШаблон(НСтр("ru= '%1(оплата в руб.)'"), ТекстЗаголовкаРасчеты);
	КонецЕсли;
	Если ПустаяСтрока(ТекстЗаголовкаРасчеты) Тогда
		ТекстЗаголовкаРасчеты = НСтр("ru= 'Расчеты'");
	Иначе
		ТекстЗаголовкаРасчеты = СтрШаблон(НСтр("ru= 'Расчеты: %1'"), ТекстЗаголовкаРасчеты);
	КонецЕсли;
	
	Элементы.СуммаНДС.Видимость = Не (Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
		Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
	
	Элементы["ГруппаРасчетыДоговора"].ЗаголовокСвернутогоОтображения = ТекстЗаголовкаРасчеты;
	
	Элементы.ВидДоходаИностранногоКонтрагента.Видимость = Форма.ЭтоДоговорИностранца;
	
	УправлениеФормой_РежимПланирования(Форма);
	
	ЕстьУсловиеОплаты = ЗначениеЗаполнено(Объект.УсловиеОплаты);
	
	Элементы.ПодменюПересчитатьГрафик.Доступность = ЕстьУсловиеОплаты;
	
	Элементы.ГруппаПустоеУсловиеОплаты.Видимость = Не ЕстьУсловиеОплаты;  
	Элементы.ДатаПервойОперации.ТолькоПросмотр = Не ЕстьУсловиеОплаты;  
	
	Элементы.ГруппаСуммаНДС.Видимость = Не ЭтоДоговорССамозанятым;
	Элементы.СуммаВключаетНДС.Видимость = Не ЭтоДоговорССамозанятым; 
	Элементы.Всего.Видимость = Не ЭтоДоговорССамозанятым;

	Если Форма.КодОшибкиПроверкиКонтракта <> 0 Тогда 
		Элементы.ОшибочныйНомерОтступ.Видимость = Истина;
		Элементы.ОшибочныйНомерУНК.Видимость = Истина;
		Элементы.ОшибочныйНомерУНК.Заголовок = ПояснениеКОшибкеВНомереУНК(Форма.КодОшибкиПроверкиКонтракта);
	Иначе
		Элементы.ОшибочныйНомерОтступ.Видимость = Ложь;
		Элементы.ОшибочныйНомерУНК.Видимость = Ложь;
	КонецЕсли;
	
	
	Если Элементы.ВидДоходаИностранногоКонтрагента.Видимость Тогда
		Элементы.ОшибочныйНомерОтступ.Ширина = 24;
	Иначе
		Элементы.ОшибочныйНомерОтступ.Ширина = 14;
	КонецЕсли;
	
	СтатусСамозанятого = Форма.СтатусСамозанятого;
	Если СтатусСамозанятого <> Неопределено Тогда
		ОформлениеСтатусаНПД =
			ИнтеграцияСтатусСамозанятогоФормыБПКлиентСервер.ДанныеДляОформленияСтатусаСамозанятогоНаФорме(
				СтатусСамозанятого.ПлательщикНПД, СтатусСамозанятого.Описание, СтатусСамозанятого.ТекстОшибки);
		Элементы.ГруппаНалогообложениеКонтрагента.ЦветФона = ОформлениеСтатусаНПД.ЦветФона;
		Элементы.НалогообложениеКонтрагентаРасширеннаяПодсказка.Заголовок = ОформлениеСтатусаНПД.ЗаголовокПодсказки;
	Иначе
		Элементы.ГруппаНалогообложениеКонтрагента.ЦветФона = Новый Цвет;
		Элементы.НалогообложениеКонтрагентаРасширеннаяПодсказка.Заголовок = "";
	КонецЕсли;	
	
	Если ЭтоДоговорССамозанятым И Не РаботаСДоговорамиКонтрагентовБПВызовСервера.ВестиУчетПоДоговорам() Тогда
		Элементы.ГруппаНалогообложениеКонтрагента.ЦветФона = Новый Цвет;
		Элементы.НалогообложениеКонтрагентаРасширеннаяПодсказка.Заголовок =
			РаботаСДоговорамиКонтрагентовБПКлиентСервер.ЗаголовокПодсказкиСамозанятыйНеВключеныДоговоры();
		КонецЕсли;
		
	ВидимостьПояснениеКВидуДохода = Форма.ЭтоДоговорИностранца И Форма.ТекущаяДатаПользователя < Дата(2025,4,1)
		И (Объект.ВидДоходаИностранногоКонтрагента = 
		ПредопределенноеЗначение("Перечисление.ВидыДоходовИностранныхОрганизаций.ДоходыУслугиВзаимозависимым")
		ИЛИ Объект.ВидДоходаИностранногоКонтрагента = 
		ПредопределенноеЗначение("Перечисление.ВидыДоходовИностранныхОрганизаций.ДоходПриравненныйДивидендам"));
	
	Элементы.ГруппаПояснениеКВидуДохода.Видимость = ВидимостьПояснениеКВидуДохода;	 
	
	Элементы.ГруппаТарифныйПлан.Видимость = (Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.РасчетноКассовоеОбслуживание")
											ИЛИ Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.Прочее"));
	
	ЭтоСКомиссионеромНаЗакупку = (Объект.ВидДоговораУХ = ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.СКомиссионеромНаЗакупку"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ГруппаРазрешенныеВалюты", "Видимость", ЭтоСКомиссионеромНаЗакупку);  
				
				
				
	Если Не РазличаютсяВалютыВзаиморасчетовИПлатежа Тогда    
					
		Если Объект.ЗапретПлатежаВПрочихВалютах Тогда 
			Элементы.ИсточникКурса.Видимость = Ложь;	
			Элементы.ГруппаКурсПлатежа.Видимость = Ложь;
			Элементы.ГруппаНастройкиКурса.Видимость = Ложь;  
		Иначе
			Элементы.ИсточникКурса.Видимость = Истина;	
			Элементы.ГруппаКурсПлатежа.Видимость = Истина;
			Элементы.ГруппаНастройкиКурса.Видимость = Ложь;  
		КонецЕсли;
	Иначе
		Элементы.ИсточникКурса.Видимость = Истина;
		Элементы.ГруппаНастройкиКурса.Видимость = Истина;
	КонецЕсли;  

КонецПроцедуры

