
&НаКлиенте
&ИзменениеИКонтроль("СписокВыбор")
Процедура АЛФ_СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.ПредставлениеСостояния Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;

	#Область УХ_
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ВыбраннаяСтрока.Ключ) Тогда
			ПоказатьЗначение(, ВыбраннаяСтрока.Ключ);
		КонецЕсли;
#Удаление		
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВерсияСоглашения) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ВерсияСоглашения);
#КонецУдаления		
	КонецЕсли;
	#КонецОбласти
КонецПроцедуры
