
&ИзменениеИКонтроль("НомерСчетаКорректен")
Функция АЛФ_НомерСчетаКорректен(НомерСчета, КодБанка, ЯвляетсяБанкомРФ, ТекстСообщения)

	Если ПропуститьПроверкуРеквизитовСчета(НомерСчета, КодБанка, ЯвляетсяБанкомРФ) Тогда
		Возврат Истина;
	КонецЕсли;

#Вставка
	Возврат Истина;
#КонецВставки
	ТекстСообщения = "";

	НомерСчетаКорректен = Ложь;

	Если ЯвляетсяБанкомРФ Тогда

		Если Не БанковскиеПравила.ПроверитьДлинуНомераСчета(НомерСчета) Тогда
			ТекстСообщения = НСтр("ru = 'Номер счета должен состоять из 20 знаков'");
		ИначеЕсли Не БанковскиеПравила.СтрокаСоответствуетФорматуБанковскогоСчета(НомерСчета) Тогда
			ТекстСообщения = НСтр("ru = 'Номер счета не соответствует формату ЦБ РФ'");
		ИначеЕсли Не ПустаяСтрока(КодБанка) И Не ПроверитьКонтрольныйКлючВНомереБанковскогоСчета(НомерСчета, КодБанка) Тогда
			ТекстСообщения = НСтр("ru = 'Номер счета или банк введен некорректно'");
		Иначе
			НомерСчетаКорректен = Истина;
		КонецЕсли;

	Иначе

		Если Не БанковскиеПравила.ПроверитьРазрешенныеСимволыСчета(НомерСчета) Тогда
			ТекстСообщения = НСтр("ru = 'Разрешены только буквы от A до Z и цифры'");
		Иначе

			КодСтраныВСчете = БанковскиеПравила.КодСтраныIBAN(НомерСчета);
			КодСтраныВБанке = БанковскиеПравила.КодСтраныSWIFT(КодБанка);

			Если БанковскиеПравила.СтранаПрименяетФорматIBAN(КодСтраныВСчете) Тогда
				Если Не БанковскиеПравила.ПроверитьКонтрольныйКлючIBAN(НомерСчета) Тогда
					ТекстСообщения = НСтр("ru = 'Номер счета введен некорректно'");
				ИначеЕсли ЗначениеЗаполнено(КодСтраныВБанке) И КодСтраныВСчете <> КодСтраныВБанке Тогда
					ТекстСообщения = НСтр("ru = 'IBAN должен соответствовать банку'");
				Иначе
					НомерСчетаКорректен = Истина;
				КонецЕсли;
			Иначе
				НомерСчетаКорректен = Истина;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат НомерСчетаКорректен;

КонецФункции
