
&После("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+ИИТ_Аксеньюшкин
	Если РасшифровкаПлатежа.Количество() > 0 Тогда
		Проект_ = РасшифровкаПлатежа[0].Проект; 
	Иначе
		Проект_ = Проект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проект_.Родитель) Тогда
		Проект_ = Проект_.Родитель;
	КонецЕсли;
	Если ЗначениеЗаполнено(Проект_.Родитель) Тогда
		Проект_ = Проект_.Родитель;
	КонецЕсли;
	ИИТ_ОбъектСтроительства = Проект_;
	
	Если Не ЗначениеЗаполнено(ИИТ_ОбъектСтроительства) Тогда
		ИИТ_ОбъектСтроительства = Проект;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)     
	
	//+ИИТ_Аксеньюшкин
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу И ИИТ_ПодтвержденаПередачаПодотчетнику Тогда

		Движение = Движения.ИИТ_ОстаткиДенежныхСредствУПодотчетников.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сумма = СуммаДокумента;
		Движение.ФизическоеЛицо = Контрагент;
		Движение.ОбъектСтроительства = Проект;
		Движение.Организация = Организация;
		Движения.ИИТ_ОстаткиДенежныхСредствУПодотчетников.Записать(Истина);
		
	КонецЕсли;

	Движение = Движения.ИИТ_КассаВРазрезеОбъектов.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Касса = КассаОрганизации;
	Движение.Организация = Организация;
	Движение.ОбъектСтроительства = Проект;
	Движение.Сумма = СуммаДокумента;

	Движения.ИИТ_КассаВРазрезеОбъектов.Записать(Истина);

	Если Найти(Основание, "патент") > 0 Тогда

		МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Основание);
		ПатентСерия = МассивСлов[6];
		ПатентНомер = МассивСлов[7];
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.ПатентСерия = &ПатентСерия
		|	И ФизическиеЛица.ПатентНомер = &ПатентНомер";
		Запрос.УстановитьПараметр("ПатентСерия", ПатентСерия);
		Запрос.УстановитьПараметр("ПатентНомер", ПатентНомер);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			НачальнаяДатаОплаченоДо = ИИТ_ВспомогательныеФункцииСервер.ПолучитьНачальнуюДатуОплаченоДоПатента(Выборка.Ссылка);
			Если Дата > НачальнаяДатаОплаченоДо Тогда

				Движение = РегистрыСведений.ИИТ_ОплатыПатентов.СоздатьМенеджерЗаписи();
				Движение.ФизическоеЛицо = Выборка.Ссылка;
				Движение.ДокументОплаты = Ссылка;
				Движение.ДатаОплаты = ДобавитьМесяц(ИИТ_ВспомогательныеФункцииСервер.ПолучитьДатуОплаты(Выборка.Ссылка, Ссылка), 1);
				Движение.Записать(Истина);
				
				ИИТ_ВспомогательныеФункцииСервер.УстановитьДатуОплатыПатента(Выборка.Ссылка, Движение.ДатаОплаты);

			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры
