
&После("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+ИИТ_Аксеньюшкин
	Проект_ = РасшифровкаПлатежа[0].Проект;
	Если ЗначениеЗаполнено(Проект_.Родитель) Тогда
		Проект_ = Проект_.Родитель;
	КонецЕсли;
	Если ЗначениеЗаполнено(Проект_.Родитель) Тогда
		Проект_ = Проект_.Родитель;
	КонецЕсли;
	ИИТ_ОбъектСтроительства = Проект_;
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, Режим)  
	
	//+ИИТ_Аксеньюшкин
	Движение = Движения.ИИТ_КассаВРазрезеОбъектов.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Касса = КассаОрганизации;
	Движение.Организация = Организация;
	Движение.ОбъектСтроительства = Проект;
	Движение.Сумма = СуммаДокумента;

	Движения.ИИТ_КассаВРазрезеОбъектов.Записать(Истина);

    Для Каждого СтрокаРасшифровки ИЗ РасшифровкаПлатежа Цикл
		Движение = Движения.ИИТ_ОстаткиДенежныхСредствУПодотчетников.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.ФизическоеЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(ПринятоОт, Истина);
		Движение.ОбъектСтроительства = СтрокаРасшифровки.Проект;
		Движение.Сумма = СтрокаРасшифровки.СуммаВзаиморасчетов;
		Движение.Организация = Организация;
	КонецЦикла;

	Движения.ИИТ_ОстаткиДенежныхСредствУПодотчетников.Записать(Истина);
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры
