
&Вместо("ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию")
Процедура АЛФ_ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры)

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Справочник.ВерсииФайлов";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();

	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ВерсииФайлов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВерсииФайлов КАК ВерсииФайлов
	|ГДЕ
	|	ВерсииФайлов.Ссылка > &Ссылка
	|	И ВерсииФайлов.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВТомахНаДиске)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ПустаяСсылка());
    Результат = Запрос.Выполнить().Выгрузить();
	Пока Результат.Количество() > 0 Цикл
        ВерсииДляОбработки = Результат.ВыгрузитьКолонку("Ссылка");
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ВерсииДляОбработки);
		Запрос.УстановитьПараметр("Ссылка", ВерсииДляОбработки[ВерсииДляОбработки.ВГраница()]);
		//@skip-check query-in-loop - Порционная регистрация данных для обработки
    	Результат = Запрос.Выполнить().Выгрузить();
	КонецЦикла;

КонецПроцедуры
