
&ИзменениеИКонтроль("ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента")
Процедура АЛФ_ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

#Вставка
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураПолученный")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ИИТ_ЗаявкаНаЗакуп")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ИИТ_ПеремещениеМеждуБригадами") Тогда
		Возврат;
	КонецЕсли;
#КонецВставки

	ПроверитьДатыЗапретаИзмененияДанных(Источник, Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей")
Процедура АЛФ_ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(Источник, Отказ, Замещение)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

#Вставка
	Если Источник.Отбор.Найти("Регистратор") <> Неопределено Тогда
		Если ТипЗнч(Источник.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
			ИЛИ ТипЗнч(Источник.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ИИТ_ЗаявкаНаЗакуп")	
			ИЛИ ТипЗнч(Источник.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ ТипЗнч(Источник.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
#КонецВставки

	Источник.ДополнительныеСвойства.Вставить("Замещение", Замещение);

	ПроверитьДатыЗапретаИзмененияДанных(Источник, Отказ, Истина, Замещение);

КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписейРегистраБухгалтерии")
Процедура АЛФ_ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписейРегистраБухгалтерии(Источник, Отказ, Замещение)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

#Вставка
	ДокРегистратор = Источник.Отбор.Регистратор.Значение;
	Если ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") И ДокРегистратор.ИИТ_ПодтвержденаПередачаПодотчетнику ИЛИ
		ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") ИЛИ ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.СчетФактураПолученный") 
		ИЛИ ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.ИИТ_ЗаявкаНаЗакуп") Тогда
		Возврат;
	КонецЕсли;
#КонецВставки

	Источник.ДополнительныеСвойства.Вставить("Замещение", Замещение);

	ПроверитьДатыЗапретаИзмененияДанных(Источник, Отказ, Истина);

КонецПроцедуры
