
//&ИзменениеИКонтроль("ПолучитьТаблицуСчетФактураВыданный")
Функция АЛФ_ПолучитьТаблицуСчетФактураВыданный(ДокументСсылка, Ошибка)

	Перем ТаблицаПоДокументамОснованиям, ТаблицаПоДокументуОснования;

	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
	ДокументСсылка, "ВидСчетаФактуры, СтавкаНДС, ДокументОснование, Сумма, СуммаНДС");

	Если РеквизитыДокумента.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда

		Для каждого СтрокаТаблицы Из ДокументСсылка.ДокументыОснования Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументОснование) Тогда
				ДокументОснованиеСсылка = СтрокаТаблицы.ДокументОснование;
				ТаблицаПоДокументуОснования = ПолучитьТаблицуДокументаНДС(ДокументОснованиеСсылка, Ошибка);
				Если ТаблицаПоДокументуОснования <> Неопределено Тогда
					Если ТаблицаПоДокументамОснованиям = Неопределено Тогда
						ТаблицаПоДокументамОснованиям = ТаблицаПоДокументуОснования.Скопировать();
					Иначе
						ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаПоДокументуОснования, ТаблицаПоДокументамОснованиям);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Возврат ТаблицаПоДокументамОснованиям;

	КонецЕсли;

	ТаблицаДокумента = Новый ТаблицаЗначений;
	ТаблицаДокумента.Колонки.Добавить("ВидЦенности");
	ТаблицаДокумента.Колонки.Добавить("СчетФактура");
	ТаблицаДокумента.Колонки.Добавить("Сумма");
	ТаблицаДокумента.Колонки.Добавить("СтавкаНДС");
	ТаблицаДокумента.Колонки.Добавить("НДС");
	ТаблицаДокумента.Колонки.Добавить("СчетУчетаНДС");
	ТаблицаДокумента.Колонки.Добавить("Событие");
	ТаблицаДокумента.Колонки.Добавить("ЭтоКомиссия", Новый ОписаниеТипов("Булево"));

	СоответствиеСтавок = Новый Соответствие();
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10, Перечисления.СтавкиНДС.НДС10_110);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18, Перечисления.СтавкиНДС.НДС18_118);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС20_120);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС5, Перечисления.СтавкиНДС.НДС5_105);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС7, Перечисления.СтавкиНДС.НДС7_107);

	НоваяСтрока = ТаблицаДокумента.Добавить();
	Если РеквизитыДокумента.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс Тогда
		НоваяСтрока.ВидЦенности = Перечисления.ВидыЦенностей.АвансыПолученные;
		Если СоответствиеСтавок[РеквизитыДокумента.СтавкаНДС] = Неопределено Тогда
			НоваяСтрока.СтавкаНДС = РеквизитыДокумента.СтавкаНДС;
		Иначе
			НоваяСтрока.СтавкаНДС = СоответствиеСтавок[РеквизитыДокумента.СтавкаНДС];
		КонецЕсли;
	Иначе
		НоваяСтрока.ВидЦенности = Перечисления.ВидыЦенностей.СуммыСвязанныеСРасчетамиПоОплате;
		НоваяСтрока.СтавкаНДС   = РеквизитыДокумента.СтавкаНДС;
	КонецЕсли;

	НоваяСтрока.СчетФактура  = РеквизитыДокумента.ДокументОснование;
	НоваяСтрока.Сумма        = РеквизитыДокумента.Сумма - РеквизитыДокумента.СуммаНДС;
	НоваяСтрока.НДС          = РеквизитыДокумента.СуммаНДС;
	НоваяСтрока.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам;
	НоваяСтрока.Событие      = Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету;
	НоваяСтрока.ЭтоКомиссия  = Истина;

	Возврат ТаблицаДокумента;

КонецФункции
