
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	0 КАК ИндексКартинки
			|ИЗ
			|	РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов КАК СвязанныеОбъектыРаспознаниеДокументов
			|ГДЕ
			|	НЕ СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат
			|	И СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект ССЫЛКА Документ.ПоступлениеТоваровУслуг";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "РегистрСведений.ОсновныеСотрудникиФизическихЛиц";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);   

   //Поля списка
	ЭлементСпискаФормы = Элементы.Добавить("СсылкаНаОбъектОрганизация", Тип("ПолеФормы"));
	ЭлементСпискаФормы.Заголовок = "Организация"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.СсылкаНаОбъект.Организация";
	
	ЭлементСпискаФормы = Элементы.Добавить("СсылкаНаОбъектНомер", Тип("ПолеФормы"));
	ЭлементСпискаФормы.Заголовок = "Номер"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.СсылкаНаОбъект.Номер";
		
	ЭлементСпискаФормы = Элементы.Добавить("СсылкаНаОбъектДата", Тип("ПолеФормы"));
	ЭлементСпискаФормы.Заголовок = "Дата"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.СсылкаНаОбъект.Дата";

	ЭлементСпискаФормы = Элементы.Добавить("СсылкаНаОбъектКонтрагент", Тип("ПолеФормы"));
	ЭлементСпискаФормы.Заголовок = "Контрагент"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.СсылкаНаОбъект.Контрагент";
	
	ЭлементСпискаФормы = Элементы.Добавить("СсылкаНаОбъектНомерВходящегоДокумента", Тип("ПолеФормы"));
	ЭлементСпискаФормы.Заголовок = "Входящий номер"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.СсылкаНаОбъект.НомерВходящегоДокумента";

	ЭлементСпискаФормы = Элементы.Добавить("СсылкаНаОбъектДатаВходящегоДокумента", Тип("ПолеФормы"));
	ЭлементСпискаФормы.Заголовок = "Дата входящего документа"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.СсылкаНаОбъект.ДатаВходящегоДокумента";

КонецПроцедуры
