
#Область Перенос_доработок

//ИИТ_Аксеньюшкин
Функция ВернутьРС(ОбъектСтроительства)

	Если ОбъектСтроительства.ИИТ_ОсновнойБанковскийСчет.Владелец = Объект.Организация Тогда
		Возврат ОбъектСтроительства.ИИТ_ОсновнойБанковскийСчет;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ЗаявкаДосрочноСогласована()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ДосрочноеСогласование.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	|ИЗ
	|	РегистрСведений.ИИТ_ДосрочноеСогласование КАК ИИТ_ДосрочноеСогласование
	|ГДЕ
	|	ИИТ_ДосрочноеСогласование.ЗаявкаНаОплату = &ЗаявкаНаОплату";
	Запрос.УстановитьПараметр("ЗаявкаНаОплату", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьОбъектСтроительства(Проект)

	ТекОбъектСтроительства = Проект;
	Пока НЕ ТекОбъектСтроительства.Проект И ТекОбъектСтроительства <> Справочники.Проекты.ПустаяСсылка() Цикл
		ТекОбъектСтроительства = ТекОбъектСтроительства.Родитель;
	КонецЦикла;

	Возврат ТекОбъектСтроительства;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьПроектПоНаименованию(НаименованиеПроекта)
	Возврат Справочники.Проекты.НайтиПоНаименованию(НаименованиеПроекта);
КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьТекПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПолучитьЭкземплярПроцесса(ЗаявкаНаОплату)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭкземплярПроцесса.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭкземплярПроцесса КАК ЭкземплярПроцесса
	|ГДЕ
	|	ЭкземплярПроцесса.КлючевойОбъектПроцесса = &Заявка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭкземплярПроцесса.Дата УБЫВ";
	Запрос.УстановитьПараметр("Заявка", ЗаявкаНаОплату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ЭкземплярПроцесса.ПустаяСсылка();
	КонецЕсли;

КонецФункции

Функция ПользователиЗаменяютДругДруга(Пользователь1, Пользователь2)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	|	Заместители.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	(Заместители.ЗамещаемыйПользователь = &Пользователь1
	|				И Заместители.Заместитель = &Пользователь2
	|			ИЛИ Заместители.ЗамещаемыйПользователь = &Пользователь2
	|				И Заместители.Заместитель = &Пользователь1)";
	Запрос.УстановитьПараметр("Пользователь1", Пользователь1);
	Запрос.УстановитьПараметр("Пользователь2", Пользователь2);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПользователиЯвляеютсяЗаместителями(Пользователь1, Пользователь2)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	|	Заместители.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	(Заместители.ЗамещаемыйПользователь = &Пользователь1
	|				И Заместители.Заместитель = &Пользователь2
	|			ИЛИ Заместители.ЗамещаемыйПользователь = &Пользователь2
	|				И Заместители.Заместитель = &Пользователь1)";
	Запрос.УстановитьПараметр("Пользователь1", Пользователь1);
	Запрос.УстановитьПараметр("Пользователь2", Пользователь2);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Количество() > 0);

КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПользовательЗамещает(ТекущийСогласующий, ТекущийПользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	|	Заместители.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	Заместители.ЗамещаемыйПользователь = &ТекущийСогласующий
	|	И Заместители.Заместитель = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийСогласующий", ТекущийСогласующий);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
Функция РольДоступна_(ИмяРоли)
	Возврат РольДоступна(ИмяРоли);
КонецФункции

//ИИТ_Аксеньюшкин
Функция ТекПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ТекПользовательЗамещает(Ответственный)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	|	Заместители.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	Заместители.ЗамещаемыйПользователь = &Ответственный
	|	И Заместители.Заместитель = &ТекПользователь";
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//ИИТ_Аксеньюшкин
Процедура ВывестиМОРСПроекта()
	
	Если НЕ ЗначениеЗаполнено(Объект.ИИТ_ОбъектСписания) Тогда  
		Если Объект.ДвиженияОперации.Количество() = 0 ИЛИ (Объект.ДвиженияОперации.Количество() > 0
		И НЕ ЗначениеЗаполнено(Объект.ДвиженияОперации[0].Проект)) Тогда
			Сумма = 0;
			Элементы.НадписьМОРС.Заголовок = "МОРС: " + Формат(Сумма, "ЧЦ=15; ЧДЦ=2") + " руб.";
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Проект = Объект.ДвиженияОперации[0].Проект;
	Если ЗначениеЗаполнено(Объект.ИИТ_ОбъектСписания) Тогда
		Проект = Объект.ИИТ_ОбъектСписания;
	КонецЕсли;

	Если Проект.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект;
	ИначеЕсли Проект.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель.Родитель.Родитель;
	КонецЕсли;
	
	СчетСписания = Объект.ИИТ_СчетОрганизации;
	Если ЗначениеЗаполнено(Объект.ИИТ_ОбъектСписания) Тогда
		СчетСписания = Объект.СчетКассаОрганизации;
	КонецЕсли;
	
	ЖелДата = ?(ЗначениеЗаполнено(Объект.ЖелательнаяДатаПлатежа), Объект.ЖелательнаяДатаПлатежа, НачалоДня(ТекущаяДата()));

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ИИТ_ДенежныеСредстваОбъектовСтроительстваОстатки.СуммаБДДСОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ИИТ_ДенежныеСредстваОбъектовСтроительства.Остатки(
	|			&ТекДата,
	|			(ОбъектСтроительства = &ОбъектСтроительства
	|				ИЛИ ОбъектСтроительства В ИЕРАРХИИ (&ОбъектСтроительства))
	|				И БанковскийСчет = &БанковскийСчет) КАК ИИТ_ДенежныеСредстваОбъектовСтроительстваОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-ИИТ_РезервыДенежныхСредствОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ИИТ_РезервыДенежныхСредств.Остатки(
	|			&ТекДата,
	|			(ОбъектСтроительства = &ОбъектСтроительства
	|				ИЛИ ОбъектСтроительства В ИЕРАРХИИ (&ОбъектСтроительства))
	|				И БанковскийСчет = &БанковскийСчет) КАК ИИТ_РезервыДенежныхСредствОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("ОбъектСтроительства", ИИТ_ПроектМОРС);
	Запрос.УстановитьПараметр("БанковскийСчет", СчетСписания);
	//Запрос.УстановитьПараметр("ТекДата", КонецДня(Мин(ЖелДата, ТекущаяДата())));
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сумма = ?(ЗначениеЗаполнено(Выборка.СуммаОстаток), Выборка.СуммаОстаток, 0);
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	Элементы.НадписьМОРС.Заголовок = "МОРС: " + Формат(Сумма, "ЧЦ=15; ЧДЦ=2") + " руб.";
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ВывестиОбъектСтроительства(СЗаполнением = Истина)
	ТекСтрока = Элементы.ТаблицаДвижений.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекСтрока.Проект) Тогда
			Возврат;
		КонецЕсли;
		ОбъектСтроительства = ПолучитьОбъектСтроительства(ТекСтрока.Проект);
		Если СЗаполнением Тогда
			ЗаполнитьПоУмолчаниюПОПроекту();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаполнитьДокументПоТабелю()

	Если Объект.ДвиженияОперации.Количество() > 0 Тогда 
		СтрокаТЗ = Объект.ДвиженияОперации[0];
	Иначе
		СтрокаТЗ = Объект.ДвиженияОперации.Добавить();
	КонецЕсли;
	СтрокаТЗ.Проект = Объект.ИИТ_ТабельУчета.ЭтапСтроительства;
	СтрокаТЗ.Сумма = Объект.ИИТ_ТабельУчета.РабочееВремя.Итог("Всего");
	Объект.СуммаДокумента = Объект.ИИТ_ТабельУчета.РабочееВремя.Итог("Всего");
	СтрокаТЗ.ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаполнитьКодСметы()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_КодыСметыБанка.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИИТ_КодыСметыБанка КАК ИИТ_КодыСметыБанка
	|ГДЕ
	|	ИИТ_КодыСметыБанка.ЭтапСтроительства = &ЭтапСтроительства
	|	И ИИТ_КодыСметыБанка.Владелец = &ОбъектСтроительства
	|	И ИИТ_КодыСметыБанка.БанковскийСчет = &БанковскийСчет";
	Запрос.УстановитьПараметр("ЭтапСтроительства", Объект.ДвиженияОперации[0].Проект);
	Запрос.УстановитьПараметр("ОбъектСтроительства", ?(ЗначениеЗаполнено(ОбъектСтроительства), ОбъектСтроительства, Объект.ДвиженияОперации[0].Проект.Родитель));
	Запрос.УстановитьПараметр("БанковскийСчет", Объект.ИИТ_СчетОрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ИИТ_КодСметыБанка = Выборка.Ссылка;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаполнитьПоУмолчаниюПОПроекту()
	Если ЗначениеЗаполнено(ОбъектСтроительства.Организация) Тогда
		Объект.Организация = ОбъектСтроительства.Организация;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектСтроительства.ИИТ_ОсновнойБанковскийСчет) Тогда
		ОБъект.ИИТ_СчетОрганизации = ОбъектСтроительства.ИИТ_ОсновнойБанковскийСчет;
	КонецЕсли;
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаполнитьСчетПоУмолчанию()
	
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		Объект.ИИТ_СчетОрганизации = ИИТ_ВспомогательныеФункцииСервер.ПолучитьСчетПоУмолчаниюОбъектаСтроительства(ОбъектСтроительства, Объект.Организация);
	Иначе
		Объект.ИИТ_СчетОрганизации = Объект.Организация.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИИТ_СчетОрганизации) И Объект.ИИТ_СчетОрганизации.Владелец <> Объект.Организация Тогда
		Объект.ИИТ_СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ЗаполнитьТекущегоСогласующего()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|			ТОГДА СогласующиеЗаявок.ТекущийСогласующий
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТекущийСогласующий
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств) КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО (РегистрСостоянийОбъектовСрезПоследних.Объект = Документ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса КАК Заявка,
	|			МАКСИМУМ(ОтложеннаяОбработкаЭтаповПроцессов.Ответственный) КАК ТекущийСогласующий
	|		ИЗ
	|			РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ОтложеннаяОбработкаЭтаповПроцессов
	|		ГДЕ
	|			НЕ ОтложеннаяОбработкаЭтаповПроцессов.Выполнено
	|			И ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|			И ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса = &ТекЗаявка
	|			И НЕ ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.ПометкаУдаления
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса) КАК СогласующиеЗаявок
	|		ПО Документ.Ссылка = СогласующиеЗаявок.Заявка
	|ГДЕ
	|	Документ.Ссылка = &ТекЗаявка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|			ТОГДА СогласующиеЗаявок.ТекущийСогласующий
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("ТекЗаявка", Объект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущийСогласующий = Выборка.ТекущийСогласующий;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИзменитьРасчетныйСчет(Команда)

	НовыйСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	ВвестиЗначение(НовыйСчет, "Выберите счет для замены по организации: " + Строка(Объект.Организация));
	
	Если Не ЗначениеЗаполнено(НовыйСчет) Тогда
		Возврат;
	КонецЕсли;

	Объект.ИИТ_ЗаменыСчетов.Очистить();
	НоваяСтрока = Объект.ИИТ_ЗаменыСчетов.Добавить();
	НоваяСтрока.Счет 		= Объект.ИИТ_СчетОрганизации;
	НоваяСтрока.НовыйСчет 	= НовыйСчет;
	НоваяСтрока.Период 		= ТекущаяДата();

	ИИТ_ИзменитьРасчетныйСчетНаСервере(НовыйСчет); 
	
   	Записать();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_ИзменитьРасчетныйСчетНаСервере(НовыйСчет)
	
	Если ЗначениеЗаполнено(Объект.ИИТ_СчетПередачаДругойОрганизации) Тогда
		Объект.ИИТ_ПредыдущийСчет = Объект.СчетКассаОрганизации;
		Объект.СчетКассаОрганизации = НовыйСчет;
		Объект.ИИТ_СчетОрганизации = НовыйСчет;
	Иначе		
		Объект.ИИТ_ПредыдущийСчет = Объект.ИИТ_СчетОрганизации;
		Объект.ИИТ_СчетОрганизации = НовыйСчет;
	КонецЕсли;
	
	Для Н = 1 По 15 Цикл
		Если ЗначениеЗаполнено(Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)]) Тогда
			НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заявка = Объект.Ссылка;
			НоваяЗапись.ДатаСоздания = ТекущаяДата();
			НоваяЗапись.Ответственный = Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)];
			НоваяЗапись.Пояснение = Строка(ПараметрыСеанса.ТекущийПользователь) + " оплатил заявку с р/с: " + Строка(НовыйСчет);
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОбъектСписанияПриИзменении(Элемент)
	ВывестиМОРСПроекта();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОплатилиДругуюСумму(Команда)

	НоваяСумма = 0;
	ВвестиЗначение(НоваяСумма, "Введите новую сумму");

	Если ЗначениеЗаполнено(НоваяСумма) Тогда
		СохранитьДоЗамены();
		ИИТ_ОплатилиДругуюСуммуНаСервере(НоваяСумма);
		ПриИзмененииСуммыДокумента();
		Записать();
		ВывестиМОРСПроекта();
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_ОплатилиДругуюСуммуНаСервере(НоваяСумма)  
	
	Объект.СуммаДокумента = НоваяСумма;

	Для Н = 1 По 15 Цикл
		Если ЗначениеЗаполнено(Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)]) Тогда
			НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заявка = Объект.Ссылка;
			НоваяЗапись.ДатаСоздания = ТекущаяДата();
			НоваяЗапись.Ответственный = Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)];
			НоваяЗапись.Пояснение = Строка(ПараметрыСеанса.ТекущийПользователь) + " оплатил заявку " + Объект.Номер + " по контрагенту "
			+ ?(ЗначениеЗаполнено(Объект.Контрагент), Объект.Контрагент.Наименование, Строка(Объект.ИИТ_КонтрагентПередачаДругойОрганизации)) + " другую сумму: " + Строка(Объект.СуммаДокумента) + " руб.";
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_СогласоватьДосрочно(Команда)
	ИИТ_СогласоватьДосрочноНаСервере();
	Закрыть();
КонецПроцедуры  

 &НаКлиенте
 Процедура АС_ВсеФайлы(Команда)  
	 
	 Если Объект.Ссылка.Пустая() Тогда 
		  Записать();
	 КонецЕсли;
	 
	ПараметрыОткрытияФормы 	= Новый Структура;
    Отбор 					= Новый Структура; 
	Отбор.Вставить("ЗаявкаНаОплату", Объект.Ссылка); 
	ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
    ОткрытьФорму("РегистрСведений.АС_ПрисоединенныеФайлы.ФормаСписка", ПараметрыОткрытияФормы);
	
 КонецПроцедуры
 
//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_СогласоватьДосрочноНаСервере()
	
	Если Модифицированность Тогда
		Сообщить("Перед согласованием документ необходимо записать.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийСогласующий) Тогда
		Сообщить("Документ еще не отправлен на согласование.");
		Возврат;
	КонецЕсли;
	
	Объект.ИИТ_МОРС_Пройден = Истина;
	Записать();
	
	//Сейчас согласовываем до бухгалтера
	Если ЗначениеЗаполнено(ТекущийСогласующий) Тогда
		
		Если Строка(Объект.ИИТ_ВидМаршрута) = "По списку согласующих казначейство" Тогда

			МассивИндексовДляАдресации = Новый Массив;
			ИндексТекущегоСогласующего = 0;
			КоличествоСогласующих = 0;

			Для Н = 1 По 16 Цикл
				Если Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)] = ТекущийСогласующий Тогда
					ИндексТекущегоСогласующего = Н;
				КонецЕсли;
			КонецЦикла;

			Для Н = ИндексТекущегоСогласующего По 16 Цикл
				Если Строка(Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)]) = "Бухгалтер" Тогда
					Прервать;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)]) Тогда
					КоличествоСогласующих = КоличествоСогласующих + 1;
					МассивИндексовДляАдресации.Добавить(Н);
				КонецЕсли;
			КонецЦикла;

			Для Н = 1 По КоличествоСогласующих Цикл
				
				СогласующийПользователь = Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(МассивИндексовДляАдресации[Н-1])];

				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", Справочники.ЭтапыУниверсальныхПроцессов.НайтиПоНаименованию(СтрЗаменить("Этап согласования 1 (по списку согл-х казн-во)", "1", Строка(МассивИндексовДляАдресации[Н-1]))));
				ТекущийЭтап_.Вставить("ДокументСогласования", ПолучитьЭкземплярПроцесса(Объект.Ссылка));
				ТекущийЭтап_.Вставить("Организация", Объект.Организация);
				ТекущийЭтап_.Вставить("Комментарий", "Оплачено без утверждения управленческом учете");
				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, Объект.Ссылка, СогласующийПользователь, Ложь, Новый УникальныйИдентификатор);
				
				НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
				НоваяЗапись.Заявка = Объект.Ссылка;
				НоваяЗапись.Ответственный = СогласующийПользователь;
				НоваяЗапись.ДатаСоздания = ТекущаяДата();
				НоваяЗапись.Пояснение = "Заявка №" + Объект.Номер + ", контрагент: " + Строка(Объект.Контрагент) + " на сумму: " + Строка(Объект.СуммаДокумента) + " отправлена бухгалтеру без утверждения.";
				НоваяЗапись.Записать(Истина);

			КонецЦикла;
			
		ИначеЕсли Строка(Объект.ИИТ_ВидМаршрута) = "Рыжкова, Кабанов, Кузнецов, Бухглатер" Тогда
			
			МассивИндексовДляАдресации = Новый Массив;
			МассивИндексовДляАдресации.Добавить(Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить());
			МассивИндексовДляАдресации.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Кабанов"));
			МассивИндексовДляАдресации.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Кузнецов Иван"));
			МассивИндексовДляАдресации.Добавить(Справочники.Пользователи.НайтиПоНаименованию(Объект.ИИТ_СчетОрганизации.Ответственный));
			
			Для Н = 0 По 3 Цикл
				Если МассивИндексовДляАдресации[Н] = ТекущийСогласующий Тогда
					ИндексТекущегоСогласующего = Н;
				КонецЕсли;
			КонецЦикла;

			КоличествоСогласующих = 3 - ИндексТекущегоСогласующего;

			Для Н = 1 По КоличествоСогласующих Цикл
				
				СогласующийПользователь = МассивИндексовДляАдресации[ИндексТекущегоСогласующего + Н - 1];

				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", Справочники.ЭтапыУниверсальныхПроцессов.НайтиПоНаименованию(СтрЗаменить("Этап согласования 1 (Рыжкова, Кабанов, Кузнецов)", "1", Строка(ИндексТекущегоСогласующего + Н))));
				ТекущийЭтап_.Вставить("ДокументСогласования", ПолучитьЭкземплярПроцесса(Объект.Ссылка));
				ТекущийЭтап_.Вставить("Организация", Объект.Организация);
				ТекущийЭтап_.Вставить("Комментарий", "Оплачено без утверждения управленческом учете");
				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, Объект.Ссылка, СогласующийПользователь, Ложь, Новый УникальныйИдентификатор);
				
				НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
				НоваяЗапись.Заявка = Объект.Ссылка;
				НоваяЗапись.Ответственный = СогласующийПользователь;
				НоваяЗапись.ДатаСоздания = ТекущаяДата();
				НоваяЗапись.Пояснение = "Заявка №" + Объект.Номер + ", контрагент: " + Строка(Объект.Контрагент) + " на сумму: " + Строка(Объект.СуммаДокумента) + " отправлена бухгалтеру без утверждения.";
				НоваяЗапись.Записать(Истина);

			КонецЦикла;

		ИначеЕсли Строка(Объект.ИИТ_ВидМаршрута) = "Финансовый вид деятельности" Тогда
			
			МассивИндексовДляАдресации = Новый Массив;
			МассивИндексовДляАдресации.Добавить(Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить());
			МассивИндексовДляАдресации.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Кабанов"));
			МассивИндексовДляАдресации.Добавить(Справочники.Пользователи.НайтиПоНаименованию(Объект.ИИТ_СчетОрганизации.Ответственный));
			
			Для Н = 0 По 2 Цикл
				Если МассивИндексовДляАдресации[Н] = ТекущийСогласующий Тогда
					ИндексТекущегоСогласующего = Н;
				КонецЕсли;
			КонецЦикла;

			КоличествоСогласующих = 2 - ИндексТекущегоСогласующего;

			Для Н = 1 По КоличествоСогласующих Цикл
				
				СогласующийПользователь = МассивИндексовДляАдресации[ИндексТекущегоСогласующего + Н - 1];

				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", Справочники.ЭтапыУниверсальныхПроцессов.НайтиПоНаименованию(СтрЗаменить("Этап согласования 1 (Фин. вид деятельности)", "1", Строка(ИндексТекущегоСогласующего + Н))));
				ТекущийЭтап_.Вставить("ДокументСогласования", ПолучитьЭкземплярПроцесса(Объект.Ссылка));
				ТекущийЭтап_.Вставить("Организация", Объект.Организация);
				ТекущийЭтап_.Вставить("Комментарий", "Оплачено без утверждения управленческом учете");
				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, Объект.Ссылка, СогласующийПользователь, Ложь, Новый УникальныйИдентификатор);
				
				НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
				НоваяЗапись.Заявка = Объект.Ссылка;
				НоваяЗапись.Ответственный = СогласующийПользователь;
				НоваяЗапись.ДатаСоздания = ТекущаяДата();
				НоваяЗапись.Пояснение = "Заявка №" + Объект.Номер + ", контрагент: " + Строка(Объект.Контрагент) + " на сумму: " + Строка(Объект.СуммаДокумента) + " отправлена бухгалтеру без утверждения.";
				НоваяЗапись.Записать(Истина);

			КонецЦикла;

		ИначеЕсли Строка(Объект.ИИТ_ВидМаршрута) = "Внутренний с бухгалтером" Тогда
			
			МассивИндексовДляАдресации = Новый Массив;
			МассивИндексовДляАдресации.Добавить(Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить());
			МассивИндексовДляАдресации.Добавить(Справочники.Пользователи.НайтиПоНаименованию(Объект.ИИТ_СчетОрганизации.Ответственный));
			
			Для Н = 0 По 1 Цикл
				Если МассивИндексовДляАдресации[Н] = ТекущийСогласующий Тогда
					ИндексТекущегоСогласующего = Н;
				КонецЕсли;
			КонецЦикла;

			КоличествоСогласующих = 1 - ИндексТекущегоСогласующего;

			Для Н = 1 По КоличествоСогласующих Цикл
				
				СогласующийПользователь = МассивИндексовДляАдресации[ИндексТекущегоСогласующего + Н - 1];

				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", Справочники.ЭтапыУниверсальныхПроцессов.НайтиПоНаименованию(СтрЗаменить("Этап согласования 1 (Внутр. с бухгалтером)", "1", Строка(ИндексТекущегоСогласующего + Н))));
				ТекущийЭтап_.Вставить("ДокументСогласования", ПолучитьЭкземплярПроцесса(Объект.Ссылка));
				ТекущийЭтап_.Вставить("Организация", Объект.Организация);
				ТекущийЭтап_.Вставить("Комментарий", "Оплачено без утверждения управленческом учете");
				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, Объект.Ссылка, СогласующийПользователь, Ложь, Новый УникальныйИдентификатор);
				
				НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
				НоваяЗапись.Заявка = Объект.Ссылка;
				НоваяЗапись.Ответственный = СогласующийПользователь;
				НоваяЗапись.ДатаСоздания = ТекущаяДата();
				НоваяЗапись.Пояснение = "Заявка №" + Объект.Номер + ", контрагент: " + Строка(Объект.Контрагент) + " на сумму: " + Строка(Объект.СуммаДокумента) + " отправлена бухгалтеру без утверждения.";
				НоваяЗапись.Записать(Истина);

			КонецЦикла;
			
		КонецЕсли;
		
		НоваяЗаписьДС = РегистрыСведений.ИИТ_ДосрочноеСогласование.СоздатьМенеджерЗаписи();
		НоваяЗаписьДС.ЗаявкаНаОплату = Объект.Ссылка;
		НоваяЗаписьДС.Записать(Истина);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИИТ_СчетОрганизацииПриИзменении(Элемент)
	ВывестиМОРСПроекта();
	ЗаполнитьКодСметы();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ТабельУчетаПриИзменении(Элемент)
	ЗаполнитьДокументПоТабелю();
	ВывестиМОРСПроекта();
	ВывестиОбъектСтроительства();
КонецПроцедуры
 
//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ТипПлатежа1ПриИзменении(Элемент)
	ОтобразитьТипПлатежа();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ЭтапСписанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.ИИТ_ОбъектСписания) Тогда
		
		СтандартнаяОбработка = Ложь;

		фиксНастройки = Новый НастройкиКомпоновкиДанных;
		 
		эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		эОтбор.ПравоеЗначение = Объект.ИИТ_ОбъектСписания;
		эОтбор.Использование = Истина;
		 
		эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
		 
		ОткрытьФорму("Справочник.Проекты.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ИИТ_ЭтапСписания);

	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ОбновитьСуммуНДС()
	ИИТ_СуммаНДС = Объект.ДвиженияОперации.Итог("СуммаНДС");
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОбъектСтроительстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	 
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	эОтбор.ПравоеЗначение = Истина;
	эОтбор.Использование = Истина;
	 
	эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
	ПараметрыФормы.Вставить("ОтображениеСписка", ОтображениеТаблицы.Дерево);
	 
	ОткрытьФорму("Справочник.Проекты.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ОбъектСтроительства);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОбъектСтроительстваОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Элементы.ТаблицаДвиженийПроект1.Доступность = (ЗначениеЗаполнено(ВыбранноеЗначение));
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)

	Если Строка(ОбъектСтроительства) = "МОД (общ.)" Тогда
		ОбъектСтроительства = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		Сообщить("Данный объект строительства нельзя использовать в заявках на оплату!");
		Возврат;
	КонецЕсли;
	ОбъектСтроительстваПриИзмененииНаСервере();
	Элементы.ТаблицаДвиженийПроект1.Доступность = (ЗначениеЗаполнено(ОбъектСтроительства));
	ЗаполнитьКодСметы();
	ЗаполнитьСчетПоУмолчанию();
	
	Модифицированность = Истина;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ОбъектСтроительстваПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(ОбъектСтроительства.Организация) И НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбъектСтроительства.Организация;
	КонецЕсли;
	Если Объект.ИИТ_СчетОрганизации <> Неопределено И Объект.ИИТ_СчетОрганизации.Владелец = Объект.Организация Тогда
		Объект.ИИТ_СчетОрганизации = ОбъектСтроительства.ИИТ_ОсновнойБанковскийСчет;
	ИначеЕсли Объект.ИИТ_СчетОрганизации = Неопределено Тогда
		Объект.ИИТ_СчетОрганизации = ОбъектСтроительства.ИИТ_ОсновнойБанковскийСчет;
	КонецЕсли;
	Объект.ДвиженияОперации[0].Проект = Справочники.Проекты.ПустаяСсылка();
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ОтобразитьТипПлатежа()
	Элементы.ИИТ_ТипПлатежа1.Видимость = (Объект.ДвиженияОперации.Количество() > 0 И НЕ Объект.ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств.ЭтоГруппа
	И Строка(Объект.ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств.Родитель) = "Прямые расходы");
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура СохранитьДоЗамены()
	
	Для Каждого СтрокаДанных Из Объект.ДвиженияОперации Цикл
		НоваяСтрока = Объект.ДвиженияОперацииДоЗамены.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.Дата = Объект.Дата;
	КонецЦикла;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ТаблицаДвиженийПроект1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		СтандартнаяОбработка = Истина;
	Иначе
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ИИТ_ВспомогательныеФункцииСервер.ПолучитьСЗЭтапов(Текст, ОбъектСтроительства);
		ДанныеВыбора.Добавить(ОбъектСтроительства, Строка(ОбъектСтроительства));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДвиженийПроект1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		
		СтандартнаяОбработка = Ложь;

		фиксНастройки = Новый НастройкиКомпоновкиДанных;
		
		//Отбор по принадлежности к объекту стриотельства
		эГруппаОбъект = фиксНастройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		эГруппаОбъект.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		эГруппаОбъект.Использование = Истина;
		 
		эОтбор = эГруппаОбъект.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		эОтбор.ПравоеЗначение = ОбъектСтроительства;
		эОтбор.Использование = Истина;		
		эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Если Строка(ОбъектСтроительства) = "ЦО ГП" Тогда

			эОтбор = эГруппаОбъект.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			эОтбор.ПравоеЗначение = ОбъектСтроительства;
			эОтбор.Использование = Истина;
			эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

		КонецЕсли;
		
		//Отбор по признаку "Проект"
		эГруппаПроект = фиксНастройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		эГруппаПроект.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		эГруппаПроект.Использование = Истина;
		
		эОтбор = эГруппаПроект.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
		эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		эОтбор.ПравоеЗначение = Ложь;
		эОтбор.Использование = Истина;		 
		эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Если Строка(ОбъектСтроительства) = "ЦО ГП" Тогда

			эОтбор = эГруппаПроект.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			эОтбор.ПравоеЗначение = ОбъектСтроительства;
			эОтбор.Использование = Истина;
			эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

		КонецЕсли;
		 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
		ПараметрыФормы.Вставить("ОтображениеСписка", ОтображениеТаблицы.Список);
		 
		ОткрытьФорму("Справочник.Проекты.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ТаблицаДвиженийПроект1);

	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ТаблицаДвиженийПроект1ПриИзменении(Элемент)

	ВывестиМОРСПроекта();
	ВывестиОбъектСтроительства(Ложь);
	Объект.Проект = ПолучитьПроектПоНаименованию(Элемент.ТекстРедактирования);
	ЗаполнитьКодСметы();
	ЗаполнитьСчетПоУмолчанию();

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ТаблицаДвиженийСтатьяДвиженияДенежныхСредств1ПриИзменении(Элемент)
	ОтобразитьТипПлатежа();
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УстановитьВидМаршрута()
	Объект.ИИТ_ВидМаршрута = Объект.ВидОперацииУХ.ИИТ_ВидМаршрута;
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УстановитьДоступностьПоТекущемуСогласующему()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	|	Заместители.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	Заместители.ЗамещаемыйПользователь = &ТекущийСогласующий
	|	И Заместители.Заместитель = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийСогласующий", ТекущийСогласующий);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаОткрытаЗаместителем = Истина;
	Иначе
		ЗаявкаОткрытаЗаместителем = Ложь;
	КонецЕсли;
	
	//Вычисляем позицию текущего согласующего
	ИндексСогласующего = 0;
	Если ЗначениеЗаполнено(ТекущийСогласующий) Тогда
		Для Н = 1 По 16 Цикл
			Если Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)] = ТекущийСогласующий Тогда
				ИндексСогласующего = Н;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Если вид операции Рыжкова, Кабанов, Кузнецов, Бухгалтер
	Если Строка(Объект.ИИТ_ВидМаршрута) = "Рыжкова, Кабанов, Кузнецов, Бухглатер" Тогда
		Если ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь И ТекущийСогласующий = Справочники.Пользователи.НайтиПоНаименованию("Кабанов") Тогда
			ИндексСогласующего = 9;
		КонецЕсли;
		Если ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь И ТекущийСогласующий = Справочники.Пользователи.НайтиПоНаименованию("Кузнецов Иван") Тогда
			ИндексСогласующего = 10;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ИИТ_СчетОрганизации) И ТипЗнч(Объект.ИИТ_СчетОрганизации) = ТИп("СправочникСсылка.БанковскиеСчета") Тогда
		Если Объект.ИИТ_СчетОрганизации.Ответственный = ТекущийСогласующий Тогда
			ИндексСогласующего = 16;
		КонецЕсли;
	КонецЕсли;
	
	//Вычисляем позицию первого согласующего
	ИндексПервогоСогласующего = 0;
	Для Н = 1 По 16 Цикл
		Если ЗначениеЗаполнено(Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)]) Тогда
			ИндексПервогоСогласующего = Н;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	//Вычисляем позицию первого согласующего
	ИндексСогласующегоБухгалтера = 0;
	Для Н = 1 По 16 Цикл
		Если Строка(Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)]) = "Бухгалтер" Тогда
			ИндексСогласующегоБухгалтера = Н;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	//Определяем доступность элементов формы в зависимости от ситуации
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Этаформа.ТолькоПросмотр = Ложь;
		Для Каждого Элемент Из Элементы Цикл
			Попытка
				Элемент.ТолькоПросмотр = Ложь;
			Исключение
			КонецПопытки;
		КонецЦикла;		
		
	Иначе
		
		//Заявка уже записана, проверяем доступность по дате
		ДатаЗапрета = Дата(1,1,1);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Пользователь = &ТекПользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)";
		Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаЗапрета = Выборка.ДатаЗапрета;
		КонецЕсли;
		
		Если ДатаЗапрета > Объект.Дата Тогда
			
			Этаформа.ТолькоПросмотр = Истина;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		//ИначеЕсли РольДоступна("ИИТ_Бухгалтер") И ИндексСогласующего <= ИндексСогласующегоБухгалтера  Тогда

			//Для Каждого Элемент Из Элементы Цикл
			//	Попытка
			//		Элемент.ТолькоПросмотр = Истина;
			//	Исключение
			//	КонецПопытки;
			//КонецЦикла;
			//
			//ЭтаФорма.ТолькоПросмотр = Ложь;
			//
			//Элементы.ВалютаВзаиморасчетов.ТолькоПросмотр = Ложь;
			//Элементы.СуммаДокумента.ТолькоПросмотр = Ложь;
			//Элементы.ГруппаСуммаОперации.ТолькоПросмотр = Ложь;
			//Элементы.ГруппаДатаСуммаОперации.ТолькоПросмотр = Ложь;
			//Элементы.ГруппаПараметрыОперации.ТолькоПросмотр = Ложь;
			//Элементы.ГруппаПараметрыОперацииВертикальная.ТолькоПросмотр = Ложь;
			//Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
			//Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
			//Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;

			//Элементы.ВалютаВзаиморасчетов.Доступность = Истина;
			//Элементы.СуммаДокумента.Доступность = Истина;
			//Элементы.ГруппаСуммаОперации.Доступность = Истина;
			//Элементы.ГруппаДатаСуммаОперации.Доступность = Истина;
			//Элементы.ГруппаПараметрыОперации.Доступность = Истина;
			//Элементы.ГруппаПараметрыОперацииВертикальная.Доступность = Истина;
			//Элементы.ГруппаОсновноеРеквизиты.Доступность = Истина;
			//Элементы.ГруппаОсновное.Доступность = Истина;
			//Элементы.ОсновнаяПанель.Доступность = Истина;			

		ИначеЕсли Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь И ЭтаФорма.СтатусОбъекта = Перечисления.СостоянияСогласования.Черновик
		ИЛИ ЭтаФорма.СтатусОбъекта = Перечисления.СостоянияСогласования.Возвращена Тогда
			
			Этаформа.ТолькоПросмотр = Ложь;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Ложь;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		ИначеЕсли Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь И ЭтаФорма.СтатусОбъекта = Перечисления.СостоянияСогласования.ПустаяСсылка() Тогда
			
			Этаформа.ТолькоПросмотр = Ложь;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Ложь;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		ИначеЕсли ЗначениеЗаполнено(ИндексПервогоСогласующего) И Объект.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(ИндексПервогоСогласующего)] = ПараметрыСеанса.ТекущийПользователь Тогда
			
			Этаформа.ТолькоПросмотр = Ложь;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Ложь;
				Исключение
				КонецПопытки;
			КонецЦикла;			
			
		ИначеЕсли РольДоступна("ПолныеПрава") 
			ИЛИ РольДоступна("АС_СтаршийФинансист") 
			И ПараметрыСеанса.ТекущийПользователь <> Справочники.Пользователи.НайтиПоНаименованию("Кабанов")
		И ПараметрыСеанса.ТекущийПользователь <> Справочники.Пользователи.НайтиПоНаименованию("Кузнецов Иван") Тогда
			
			Этаформа.ТолькоПросмотр = Ложь;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Ложь;
				Исключение
				КонецПопытки;
			КонецЦикла;			
		
		ИначеЕсли РольДоступна("ИИТ_БюджетныйКонтроллер") И ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь Тогда
			
			Этаформа.ТолькоПросмотр = Ложь;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Ложь;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		ИначеЕсли ИндексСогласующего <= 4 И ИндексСогласующего <> 0 Тогда

			Этаформа.ТолькоПросмотр = Ложь;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Ложь;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		ИначеЕсли ИндексСогласующего > 4 И ИндексСогласующего <= 8 Тогда

			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
			Элементы.ИИТ_СчетОрганизации.ТолькоПросмотр = Ложь;
			Элементы.ТаблицаДвиженийПроект1.ТолькоПросмотр = Ложь;
			Элементы.ЛеваяЧасть.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперации.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперацииВертикальная.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;
			
		ИначеЕсли РольДоступна("ИИТ_ИнженерПТО") И ИндексСогласующего = 8 И ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь Тогда
			
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
			Элементы.ИИТ_СчетОрганизации.ТолькоПросмотр = Ложь;
			Элементы.ТаблицаДвиженийПроект1.ТолькоПросмотр = Ложь;
			Элементы.ЛеваяЧасть.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперации.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперацииВертикальная.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;			
			
		ИначеЕсли ИндексСогласующего > 8 ИЛИ ИндексСогласующего = 0 Тогда
			
			Этаформа.ТолькоПросмотр = Истина;
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		ИначеЕсли ИндексСогласующего = 8 И ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь Тогда
			
			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
			Элементы.ИИТ_СчетОрганизации.ТолькоПросмотр = Ложь;
			Элементы.ЛеваяЧасть.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперации.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперацииВертикальная.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;
			
		ИначеЕсли РольДоступна("ИИТ_ИнженерПТО") И ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь Тогда

			Для Каждого Элемент Из Элементы Цикл
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЦикла;

			Элементы.ЛеваяЧасть.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперации.ТолькоПросмотр = Ложь;
			Элементы.ГруппаСтороныОперацииВертикальная.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
			Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;

		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.ЗаказыПоставщику.ТолькоПросмотр = Ложь;
	Элементы.ГруппаКомментарийОтветственныйЗаказы.ТолькоПросмотр = Ложь;
	Элементы.ЗаказыПоставщикуНомерСтроки.ТолькоПросмотр = Ложь;
	Элементы.ЗаказыПоставщикуЗаказПоставщику.ТолькоПросмотр = Ложь;
	Элементы.ЗаказыПоставщику.КоманднаяПанель.ТолькоПросмотр = Ложь;
	
	Элементы.ЗаказыПоставщику.Доступность = Истина;
	Элементы.ГруппаКомментарийОтветственныйЗаказы.Доступность = Истина;
	Элементы.ЗаказыПоставщикуНомерСтроки.Доступность = Истина;
	Элементы.ЗаказыПоставщикуЗаказПоставщику.Доступность = Истина;
	Элементы.ЗаказыПоставщику.КоманднаяПанель.Доступность = Истина;

	Если ТекущийСогласующий = ПараметрыСеанса.ТекущийПользователь ИЛИ ПользователиЯвляеютсяЗаместителями(ТекущийСогласующий, ПараметрыСеанса.ТекущийПользователь) Тогда

		Элементы.ТаблицаДвиженийПроект1.ТолькоПросмотр = Ложь;
		Элементы.ЛеваяЧасть.ТолькоПросмотр = Ложь;
		Элементы.ГруппаСтороныОперации.ТолькоПросмотр = Ложь;
		Элементы.ГруппаСтороныОперацииВертикальная.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
		Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;

		Элементы.ТаблицаДвиженийПроект1.Доступность = Истина;
		Элементы.ЛеваяЧасть.Доступность = Истина;
		Элементы.ГруппаСтороныОперации.Доступность = Истина;
		Элементы.ГруппаСтороныОперацииВертикальная.Доступность = Истина;
		Элементы.ГруппаОсновноеРеквизиты.Доступность = Истина;
		Элементы.ГруппаОсновное.Доступность = Истина;
		Элементы.ОсновнаяПанель.Доступность = Истина;

		Элементы.ИИТ_КодСметыБанка.ТолькоПросмотр = Ложь;
		Элементы.ОплатаКонтрагенту.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПараметрыОперации.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПараметрыОперацииВертикальная.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
		Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;

		Элементы.ИИТ_КодСметыБанка.Доступность = Истина;
		Элементы.ОплатаКонтрагенту.Доступность = Истина;
		Элементы.ГруппаПараметрыОперации.Доступность = Истина;
		Элементы.ГруппаПараметрыОперацииВертикальная.Доступность = Истина;
		Элементы.ГруппаОсновноеРеквизиты.Доступность = Истина;
		Элементы.ГруппаОсновное.Доступность = Истина;
		Элементы.ОсновнаяПанель.Доступность = Истина;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийСогласующий) Тогда
		Элементы.ИИТ_ВидМаршрута.Доступность = Ложь;
	КонецЕсли;
	
	//Для всех пользователей на всех этапах устанавливаем доступность к смене типа платежа
	Если Элементы.ИИТ_ТипПлатежа1.Видимость Тогда
		
		Элементы.ИИТ_ТипПлатежа1.Доступность = Истина;
		Элементы.ИИТ_ГруппаДанныеОднойСтрокой.Доступность = Истина;
		Элементы.ГруппаДатаСуммаОперации.Доступность = Истина;
		Элементы.ГруппаПараметрыОперации.Доступность = Истина;
		Элементы.ГруппаПараметрыОперацииВертикальная.Доступность = Истина;
		Элементы.ГруппаОсновноеРеквизиты.Доступность = Истина;
		Элементы.ГруппаОсновное.Доступность = Истина;
		Элементы.ОсновнаяПанель.Доступность = Истина;

		Элементы.ИИТ_ТипПлатежа1.ТолькоПросмотр = Ложь;
		Элементы.ИИТ_ГруппаДанныеОднойСтрокой.ТолькоПросмотр = Ложь;
		Элементы.ГруппаДатаСуммаОперации.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПараметрыОперации.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПараметрыОперацииВертикальная.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОсновноеРеквизиты.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОсновное.ТолькоПросмотр = Ложь;
		Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
&ИзменениеИКонтроль("ВидОперацииПриИзменении")
Процедура АЛФ_ВидОперацииПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ВидОперацииУХ) Тогда

		ВидОперацииПриИзмененииСервер();

		УведомитьПользователяПлатежиВБюджет();

		УстановитьСуммуДокумента();
#Вставка     
		//+ИИТ_Аксеньюшкин
		УстановитьВидМаршрута();
		//-ИИТ_Аксеньюшкин
#КонецВставки
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ДатаПриИзмененииПосле(Элемент)
	//+ИИТ_Аксеньюшкин
	ВывестиМОРСПроекта();
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ЖелательнаяДатаПлатежаПриИзмененииПосле(Элемент)
	//+ИИТ_Аксеньюшкин
	ВывестиМОРСПроекта();
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаОповещения")
Процедура АЛФ_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

		#Область УХ_Согласование
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта();
		#Вставка     
	ИначеЕсли ИмяСобытия = "ПеречитатьФорму" Тогда
		ЭтаФорма.Прочитать();
	ИначеЕсли ИмяСобытия = "ИИТ_ЗакрытьФормуПриСогласовании" И Объект.Ссылка = Параметр.Заявка Тогда
		ЭтаФорма.Закрыть();
#КонецВставки
	КонецЕсли;
	#КонецОбласти 
	
	Если ИмяСобытия = "Запись_РасходныйКассовыйОрдер"
			ИЛИ ИмяСобытия = "Запись_ПлатежноеПоручение"
			ИЛИ ИмяСобытия = "Запись_СписаниеСРасчетногоСчета" Тогда
		ОбновитьПредставлениеПлатежнойПозиции();    
		ЗаполнитьДанныеОбОплатеЗаявки();
		
	ИначеЕсли ИмяСобытия = "Запись_ВедомостьНаВыплатуЗарплатыВБанк" Тогда
		УстановитьСуммуДокумента();
	// ОПК
	ИначеЕсли ИмяСобытия = "ЗаписанаКорректировкаПланов" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("КорректируемыйДокумент") И Параметр.КорректируемыйДокумент = Объект.Ссылка Тогда
			ПриОжиданииВыполнитьКонтрольДокумента();
		КонецЕсли;
	// ОПК Конец
	КонецЕсли;
	
	#Область УХ_ПодтверждающиеДокументы
	ПодтверждающиеДокументыУХКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ДобавляетсяФайлПодтверждающегоДокумента);
	Если  ИмяСобытия = "Запись_Файл" Тогда
		ПодтверждающиеДокументыЕстьНеИспользуемыеФайлы();
		Модифицированность = Истина;
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;	
	
	#КонецОбласти

КонецПроцедуры

&НаСервере
&После("ОпределитьСостояниеОбъекта")
Процедура АЛФ_ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход)
	//+ИИТ_Аксеньюшкин
	ЗаполнитьТекущегоСогласующего();

	Если Элементы.Найти("СогласоватьДокумент") <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущийСогласующий) И ТекущийСогласующий <> ПараметрыСеанса.ТекущийПользователь И Не РольДоступна("ПолныеПрава") 
		И Не ПользовательЗамещает(ТекущийСогласующий, ПараметрыСеанса.ТекущийПользователь) Тогда
			Элементы.СогласоватьДокумент.Доступность = Ложь;
			Элементы.ОтменитьСогласование.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ОрганизацияПриИзмененииПосле(Элемент)

	//+ИИТ_Аксеньюшкин
	Этаформа.ТолькоПросмотр = Ложь;
	Для Каждого Элемент Из Элементы Цикл
		Попытка
			Элемент.ТолькоПросмотр = Ложь;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЗаполнитьСчетПоУмолчанию();
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ПослеЗаписиПосле(ПараметрыЗаписи)
	//+ИИТ_Аксеньюшкин
	ОпределитьСостояниеОбъекта();
	УстановитьДоступностьПоТекущемуСогласующему();
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаСервере
&После("ПриИзмененииСуммыДокумента")
Процедура АЛФ_ПриИзмененииСуммыДокумента()
	//+ИИТ_Аксеньюшкин
	ОбновитьСуммуНДС();
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаСервере
Функция АС_ДоговорУчета(ДоговорКонтрагента)	
	Возврат ДоговорКонтрагента.ИИТ_ДоговорУчета;
КонецФункции	

&НаСервере
Функция  КонтрольБР(ДоговорКонтрагента)  
	Структура = Новый Структура;
	Структура.Вставить("ЛимитПревышен", Ложь); 
	Структура.Вставить("Ошибка", "");
		  
	ОС_Проект 		= ИИТ_ВспомогательныеФункцииСервер.МаксимальныйУровеньСправочника(Объект.Проект);
	таб 			= ИИТ_ВспомогательныеФункцииСервер.ПолучитьДанныеАналитикиПоОбъектамСтроительства(ДоговорКонтрагента);
	ТекСтрока 		= таб.Найти(Объект.Проект, "ЭтапСтроительства");
	
	Если таб.количество()>0  Тогда
		Если ТекСтрока = Неопределено Тогда 
			Структура.Вставить("Ошибка", "Этап отсутствует в договоре");
		КонецЕсли;	
	Иначе 	
		Структура.Вставить("Ошибка", "Этапы отсутствуют в договоре");	
	КонецЕсли;
	
	Если ОС_Проект.АС_КонтрольБР Тогда 
		Если Не ТекСтрока = Неопределено Тогда  
			СуммаПроверки = ТекСтрока.Бюджет - ТекСтрока.Сумма; 
			Если СуммаПроверки <=  Объект.СуммаДокумента Тогда 
				Структура.Вставить("ЛимитПревышен", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Структура;

КонецФункции

&НаСервере
Функция ТекущийСогласующийМОРС(ТекущийСогласующий) 
	
	ОС_Проект 		= ИИТ_ВспомогательныеФункцииСервер.МаксимальныйУровеньСправочника(Объект.Проект);
 
	Возврат ТекущийСогласующий = ОС_Проект.ИИТ_Согласующий8;
	 
КонецФункции	

&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)    
	
	//+ИИТ_Аксеньюшкин
	ВывестиОбъектСтроительства(Ложь);
	
	Элементы.ДокументПланирования.Видимость = Ложь;
	Элементы.ИдентификаторПлатежа.Видимость = Ложь;
	Элементы.КодПлательщикаБанковскойКомиссии.Видимость = Ложь;
	Элементы.ТаблицаДвиженийПроект.Видимость = Истина;
	Элементы.СчетКонтрагента.Видимость = Ложь;
	Элементы.СчетКассаОрганизации.Видимость = Ложь;
	Элементы.ИИТ_КодСметыБанка.Видимость = Истина;
	
	ТекПользователь = ПолучитьТекПользователя();
	
	//Устанавливаем права на редактирование по номеру согласующего
	УстановитьДоступностьПоТекущемуСогласующему();
	
	Попытка
		Элементы.СогласоватьДокумент.Заголовок = "СОГЛАСОВАТЬ";
		Элементы.СогласоватьДокумент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Исключение
	КонецПопытки;
	
	Элементы.ТекущийСогласующий.Доступность = Ложь;
	Элементы.ТекущийСогласующий.ТолькоПросмотр = Истина;
	
	Элементы.ТаблицаДвиженийПроект1.Доступность = (ЗначениеЗаполнено(ОбъектСтроительства));
	//-ИИТ_Аксеньюшкин
		
КонецПроцедуры

&НаСервере
&После("ТаблицаДвиженийПриИзмененииНаСервере")
Процедура АЛФ_ТаблицаДвиженийПриИзмененииНаСервере()
	//+ИИТ_Аксеньюшкин
	ОбновитьСуммуНДС();
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТаблицаДвиженийСтавкаНДСПриИзменении")
Процедура АЛФ_ТаблицаДвиженийСтавкаНДСПриИзменении(Элемент)  

#Удаление	
	ОперативноеПланированиеФормыУХКлиентСервер.ПересчитатьСуммуНДС(Элементы.ТаблицаДвижений.ТекущиеДанные);
#КонецУдаления
#Вставка
	//+ИИТ_Аксеньюшкин
	Для Каждого СтрокаДвижений ИЗ Объект.ДвиженияОперации Цикл
		СтрокаДвижений.СтавкаНДС = Элементы.ТаблицаДвижений.ТекущиеДанные.СтавкаНДС;
		ОперативноеПланированиеФормыУХКлиентСервер.ПересчитатьСуммуНДС(СтрокаДвижений);
	КонецЦикла;
	ОбновитьСуммуНДС();
	//-ИИТ_Аксеньюшкин
#КонецВставки
	СформироватьНазначениеПлатежаНаСервере(Истина);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура АЛФ_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

#Вставка     
	Если Объект.ДвиженияОперации.Количество() > 0 И ЗначениеЗаполнено(Объект.ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств) Тогда
		Статья = Объект.ДвиженияОперации[0].СтатьяДвиженияДенежныхСредств;
		Если Не ЗначениеЗаполнено(Объект.ИИТ_ТипПлатежа) И (Статья.Родитель.Наименование = "Прямые расходы") И Объект.Дата >= Дата(2024,4,5) Тогда
			Сообщить("Для данной статьи ДДС: " + Строка(Статья) + " должен быть заполнен тип платежа.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
#КонецВставки
	ЗаявкиНаОперации.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&После("УправлениеФормой")
Процедура АЛФ_УправлениеФормой(Форма)
	Объект 		= Форма.Объект;
	Элементы 	= Форма.Элементы;
	РеквизитыДокумента = Форма.РеквизитыДокумента;

	//+ИИТ_Аксеньюшкин
	Элементы.ЦФООднойСтрокой.Видимость = Ложь;
	Элементы.ИИТ_ОбъектСписания.Видимость = (Строка(Объект.ВидОперацииУХ) = "Перевод на другой счет" ИЛИ Строка(Объект.ВидОперацииУХ) = "Перевод внутри счета" ИЛИ Строка(Объект.ВидОперацииУХ) = "Перевод на счет другой организации");
	Элементы.ИИТ_ОбъектЗачисления.Видимость = (Строка(Объект.ВидОперацииУХ) = "Перевод на другой счет" ИЛИ Строка(Объект.ВидОперацииУХ) = "Перевод внутри счета" ИЛИ Строка(Объект.ВидОперацииУХ) = "Перевод на счет другой организации");
	Элементы.ОбъектСтроительства.Видимость = (Строка(Объект.ВидОперацииУХ) <> "Перевод на другой счет" И Строка(Объект.ВидОперацииУХ) <> "Перевод внутри счета" И Строка(Объект.ВидОперацииУХ) <> "Перевод на счет другой организации");
	Элементы.ТаблицаДвиженийПроект1.Видимость = (Строка(Объект.ВидОперацииУХ) <> "Перевод на другой счет" И Строка(Объект.ВидОперацииУХ) <> "Перевод внутри счета" И Строка(Объект.ВидОперацииУХ) <> "Перевод на счет другой организации");
	
	Если Строка(Объект.ВидОперацииУХ) = "Перевод на счет другой организации" Тогда
		Элементы.СчетПолучателяПереводСобственныхСредств.Видимость = Ложь;
		Элементы.ИИТ_СчетПередачаДругойОрганизации.Видимость = Истина;
		Элементы.ИИТ_КонтрагентПередачаДругойОрганизации.Видимость = Истина;
	Иначе
		Элементы.ИИТ_СчетПередачаДругойОрганизации.Видимость = Ложь;
		Элементы.ИИТ_КонтрагентПередачаДругойОрганизации.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ИИТ_ТабельУчета.Видимость = (Строка(Объект.ВидОперацииУХ) = "Перечисление заработной платы по ведомостям");
	
	Элементы.ДокументПланирования.Видимость = Ложь;
	Элементы.ИдентификаторПлатежа.Видимость = Ложь;
	Элементы.КодПлательщикаБанковскойКомиссии.Видимость = Ложь;
	Элементы.ТаблицаДвиженийПроект.Видимость = Истина;
	Элементы.СчетКонтрагента.Видимость = Ложь;
	Элементы.СчетКассаОрганизации.Видимость = Ложь;
	Элементы.ИИТ_КодСметыБанка.Видимость = Истина;
	//-ИИТ_Аксеньюшкин
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("УстановитьОграничениеТипаБанковскийСчетКасса")
Процедура АЛФ_УстановитьОграничениеТипаБанковскийСчетКасса(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЗаявкиНаОперацииКлиентСервер.УстановитьОграничениеТипаБанковскийСчетКасса(Элементы.СчетКассаОрганизации, Объект.ФормаОплаты);
#Удаление	
	Если ВидыОперацийУХКлиентСерверПовтИсп.ЭтоПеремещениеСобственныхСредств(Объект.ВидОперацииУХ) Тогда
#КонецУдаления
#Вставка
	Если ВидыОперацийУХКлиентСерверПовтИсп.ЭтоПеремещениеСобственныхСредств(Объект.ВидОперацииУХ)
	И Строка(Объект.ВидОперацииУХ) <> "Перевод внутри счета" И Строка(Объект.ВидОперацииУХ) <> "Перевод на счет другой организации" Тогда
#КонецВставки		
		ЗаявкиНаОперацииКлиентСервер.УстановитьОграничениеТипаБанковскийСчетКасса(Элементы.БанковскийСчетКассаПереводСобственныхСредств, Объект.ФормаОплаты);
		Если Форма.ПлатежнаяПозиция.Количество() > 1 Тогда
			ФормаОплатыВстречная = Форма.ПлатежнаяПозиция[1].ФормаОплаты;
		Иначе	
			ФормаОплатыВстречная = Объект.ФормаОплаты;
		КонецЕсли;	
		ЗаявкиНаОперацииКлиентСервер.УстановитьОграничениеТипаБанковскийСчетКасса(Элементы.СчетПолучателяПереводСобственныхСредств, ФормаОплатыВстречная);
		
	КонецЕсли;	

	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоКонвертацияВалюты(Объект.ВидОперацииУХ) Тогда
		
		ФормаОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.Безналичная");
		ЗаявкиНаОперацииКлиентСервер.УстановитьОграничениеТипаБанковскийСчетКасса(Элементы.БанковскийСчетКассаКонвертация, ФормаОплаты);
		ЗаявкиНаОперацииКлиентСервер.УстановитьОграничениеТипаБанковскийСчетКасса(Элементы.СчетПолучателяКонвертация, ФормаОплаты);
					
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АЛФ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	ЦветФонаВедущейСуммы = ЦветаСтиля.ФонУправляющегоПоля;
	
	ЗаполнитьСписокОчередностьПлатежа();
	
	Если Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			УстановитьОчередностьПлатежа();
			ОбновитьПодсказкуОчередностьПлатежа(ЭтотОбъект);
		КонецЕсли;

		ПодготовитьФормуНаСервере();
		КодВидаДоходаПоУмолчанию(ЭтотОбъект); 
	КонецЕсли;
	
	// Уведомим об изменениях в правилах платежей в бюджет
	НомерСчетаПолучателя 	= Объект.СчетКонтрагента.НомерСчета;
	ВидОперации 			= ВидОперацииДДС(Объект.ВидОперацииУХ);
	// Если платежка не соответствует правилам платежей в бюджет,
	// то предложим пользователю варианты выхода из случая
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если НЕ Объект.ПеречислениеВБюджет
			И (ПлатежиВБюджетКлиентСервер.ЭтоСчетПлатежаВБюджет(НомерСчетаПолучателя, Объект.Дата)
			ИЛИ УчетДенежныхСредствБП.ПлатежГосОргану(ВидОперации, Объект.Контрагент)) Тогда
			ИзменитьПеречислениеВБюджет();
		Иначе
			ЗаявкиНаОперации.НайтиОшибкиПлатежаВБюджет(ЭтотОбъект, Параметры.ЗначениеКопирования.Дата);
		КонецЕсли;
	КонецЕсли;
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастроитьСписокВыбораКодВидаДохода(ЭтотОбъект); 
	
	Если Объект.ЛицевыеСчетаСотрудников.Количество() > 0 Тогда     
		Если Объект.ВидОперацииУХ = ПредопределенноеЗначение("Справочник.ВидыОперацийУХ.ПеречислениеПодотчетномуЛицу") Тогда
			ПереключательРасшифровки = 1;	
		ИначеЕсли (УчетЗарплатыИКадровВоВнешнейПрограмме И ВедетсяУчетРасчетовПоЗарплатеСводно) Тогда
			ПереключательРасшифровки = 1;	
		Иначе
			ПереключательРасшифровки = 0;	
		КонецЕсли;
	Иначе
		ПереключательРасшифровки = 0;	
	КонецЕсли;
	
	КодыИнструкцийБанку = ПлатежноеПоручениеФормыУХКлиентСервер.НадписьКодыИнструкцийБанку(Объект);
	ОбновитьВсеПечатныеРеквизитыВал(ЭтотОбъект);
	ЕстьНеИспользуемыеФайлы = ПодтверждающиеДокументыУХ.ЕстьНеИспользуемыеФайлы(Объект);
	#Вставка
	//Требуется создать элементы до вызова управления формой
	
	//Команды формы
	КомандаФормы = Команды.Добавить("ИИТ_ИзменитьРасчетныйСчет");
	КомандаФормы.Заголовок = "Изменить расчетный счет";
	КомандаФормы.Действие  = "ИИТ_ИзменитьРасчетныйСчет";
	
	КомандаФормы = Команды.Добавить("ИИТ_ОплатилиДругуюСумму");
	КомандаФормы.Заголовок = "Оплатили другую сумму";
	КомандаФормы.Действие  = "ИИТ_ОплатилиДругуюСумму";

	КомандаФормы = Команды.Добавить("ИИТ_СогласоватьДосрочно");
	КомандаФормы.Заголовок = "Согласовать досрочно";
	КомандаФормы.Действие  = "ИИТ_СогласоватьДосрочно";  
	
	КомандаФормы = Команды.Добавить("АС_ВсеФайлы"); 
	КомандаФормы.Заголовок = "Все файлы";
	КомандаФормы.Действие  = "АС_ВсеФайлы";    
		
    //Кнопки команд  
	КнопкаФормы = Элементы.Вставить("ФормаАС_ВсеФайлы", Тип("КнопкаФормы"), Элементы.ГруппаКнопокКоманднойПанели);
	КнопкаФормы.Заголовок 	= "Все файлы";
	КнопкаФормы.ИмяКоманды 	= "АС_ВсеФайлы";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;  

	КнопкаФормы = Элементы.Добавить("ФормаИИТ_СогласоватьДосрочно", Тип("КнопкаФормы"), Элементы.ГруппаКнопокКоманднойПанели);
	КнопкаФормы.ИмяКоманды = "ИИТ_СогласоватьДосрочно";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	КнопкаФормы = Элементы.Добавить("ФормаИИТ_ИзменитьРасчетныйСчет", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "ИИТ_ИзменитьРасчетныйСчет";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	КнопкаФормы = Элементы.Добавить("ФормаИИТ_ОплатилиДругуюСумму", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "ИИТ_ОплатилиДругуюСумму";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;    
	
	//Поля основное
	ПолеВвода_АЛФ = Элементы.Добавить("СостояниеОбъекта", Тип("ПолеФормы"), Элементы.Группа_ДатаНомер);
	ПолеВвода_АЛФ.Заголовок = "Состояние объекта";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "СостояниеОбъекта";

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтразитьБДДС", Тип("ПолеФормы"), Элементы.Группа_ДатаНомер);
	ПолеВвода_АЛФ.Заголовок = "Отразить в БДДС досрочно";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОтразитьБДДС";
	ПолеВвода_АЛФ.Доступность = Ложь;     
	
	Элементы.ДокументПланирования.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ТекущийСогласующий", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая);
	ПолеВвода_АЛФ.Заголовок = "Текущий согласующий";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ТекущийСогласующий";
	ПолеВвода_АЛФ.Доступность = Ложь;     
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ДатаФактическойОплаты", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая);
	ПолеВвода_АЛФ.Заголовок = "Дата факт. оплаты";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ДатаФактическойОплаты";
	ПолеВвода_АЛФ.Доступность = Ложь;     
	
	НоваяГруппа = Элементы.Добавить("ГруппаИИТ_ВидОперацииВидМаршрута", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛевая);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;  	
	
	Элементы.Переместить(Элементы.ВидОперации, НоваяГруппа);
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ВидМаршрута", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Вид маршрута";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ВидМаршрута";
	
	Элементы.ГруппаСтороныОперацииВертикальная.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Вставить("ОбъектСтроительства", Тип("ПолеФормы"), Элементы.ЛеваяЧасть, Элементы.НадписьРеквизитыПлательщика);
	ПолеВвода_АЛФ.Заголовок = "Объект строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ОбъектСтроительства";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ОбъектСтроительстваПриИзменении");
    ПолеВвода_АЛФ.УстановитьДействие("НачалоВыбора", "ОбъектСтроительстваНачалоВыбора");
    ПолеВвода_АЛФ.УстановитьДействие("ОбработкаВыбора", "ОбъектСтроительстваОбработкаВыбора");
		
	ПолеВвода_АЛФ = Элементы.Вставить("ТаблицаДвиженийПроект1", Тип("ПолеФормы"), Элементы.ЛеваяЧасть, Элементы.НадписьРеквизитыПлательщика);
	ПолеВвода_АЛФ.Заголовок = "Этап строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Проект";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ТаблицаДвиженийПроект1ПриИзменении");
    ПолеВвода_АЛФ.УстановитьДействие("НачалоВыбора", "ТаблицаДвиженийПроект1НачалоВыбора");
    ПолеВвода_АЛФ.УстановитьДействие("АвтоПодбор", "ТаблицаДвиженийПроект1АвтоПодбор");

	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_СчетОрганизации", Тип("ПолеФормы"), Элементы.ЛеваяЧасть, Элементы.НадписьРеквизитыПлательщика);
	ПолеВвода_АЛФ.Заголовок = "Счет организации/касса";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СчетОрганизации";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_СчетОрганизацииПриИзменении");

	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_КонтрагентПередачаДругойОрганизации", Тип("ПолеФормы"), Элементы.ЛеваяЧасть, Элементы.НадписьРеквизитыПлательщика);
	ПолеВвода_АЛФ.Заголовок = "Контрагент";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_КонтрагентПередачаДругойОрганизации";
	
	Элементы.ГруппаПараметрыОперацииВертикальная.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_МОРСЗаднимЧислом", Тип("ПолеФормы"), Элементы.ГруппаДатаОперации, Элементы.ЖелательнаяДатаПлатежа);
	ПолеВвода_АЛФ.Заголовок = "МОРС задним числом";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_МОРСЗаднимЧислом";
	
	НоваяГруппа = Элементы.Добавить("ИИТ_ГруппаДанныеОднойСтрокой", Тип("ГруппаФормы"), Элементы.ГруппаДатаСуммаОперации);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;  	

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ТабельУчета", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Табель учета";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ТабельУчета";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ТабельУчетаПриИзменении");

	НоваяГруппа_1 = Элементы.Добавить("ГруппаСтатьяДДСНадписьМОРС", Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппа_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа_1.ОтображатьЗаголовок = Ложь;  	

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийСтатьяДвиженияДенежныхСредств1", Тип("ПолеФормы"), НоваяГруппа_1);
	ПолеВвода_АЛФ.Заголовок = "Статья ДДС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.СтатьяДвиженияДенежныхСредств";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ТаблицаДвиженийСтатьяДвиженияДенежныхСредств1ПриИзменении");

	Декорация_АЛФ = Элементы.Добавить("НадписьМОРС", Тип("ДекорацияФормы"), НоваяГруппа_1);
	Декорация_Алф.Вид = ВидДекорацииФормы.Надпись;
	Декорация_Алф.Шрифт = Новый Шрифт(Декорация_АЛФ.Шрифт,,,Истина);	

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ТипПлатежа1", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Тип платежа";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ТипПлатежа";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ТипПлатежа1ПриИзменении");

	НоваяГруппа_2 = Элементы.Добавить("ГруппаСуммаСтавкаНДС", Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппа_2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа_2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа_2.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа_2.ОтображатьЗаголовок = Ложь;  	

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийСтавкаНДС1", Тип("ПолеФормы"), НоваяГруппа_2);
	ПолеВвода_АЛФ.Заголовок = "Ставка НДС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.СтавкаНДС";
    ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ТаблицаДвиженийСтавкаНДСПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СуммаНДС", Тип("ПолеФормы"), НоваяГруппа_2);
	ПолеВвода_АЛФ.Заголовок = "Сумма НДС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_СуммаНДС";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийСуммаНДС1", Тип("ПолеФормы"), НоваяГруппа_2);
	ПолеВвода_АЛФ.Заголовок = "Сумма НДС";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.СуммаНДС";
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийАналитика1", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Аналитика 1";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Аналитика1";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийАналитика2", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Аналитика 2";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Аналитика2";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийАналитика3", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Аналитика 3";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Аналитика3";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийАналитика4", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Аналитика 4";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Аналитика4";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийАналитика5", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Аналитика 5";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Аналитика5";
	ПолеВвода_АЛФ.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийАналитика6", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Аналитика 6";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.Аналитика6";
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийЭлементСтруктурыЗадолженности1", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Элемент структуры задолженности";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.ЭлементСтруктурыЗадолженности";
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийОбъектРасчетов1", Тип("ПолеФормы"), НоваяГруппа);
	ПолеВвода_АЛФ.Заголовок = "Объект расчетов";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.ОбъектРасчетов";
	ПолеВвода_АЛФ.Видимость = Ложь;
	
	//ПолеВвода_АЛФ = Элементы.Добавить("ТаблицаДвиженийЦФО1", Тип("ПолеФормы"), НоваяГруппа);
	//ПолеВвода_АЛФ.Заголовок = "ЦФО";
	//ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	//ПолеВвода_АЛФ.ПутьКДанным = "Элементы.ТаблицаДвижений.ТекущиеДанные.ЦФО";

	НоваяГруппа_3 = Элементы.Добавить("ИИТ_ВалютнаяСуммаВалюта", Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппа_3.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа_3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа_3.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа_3.ОтображатьЗаголовок = Ложь;  	

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ВалютнаяСумма", Тип("ПолеФормы"), НоваяГруппа_3);
	ПолеВвода_АЛФ.Заголовок = "Валютный эквивалент";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ВалютнаяСумма";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_Валюта", Тип("ПолеФормы"), НоваяГруппа_3);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_Валюта"; 
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	Элементы.СчетКассаОрганизации.Видимость = Ложь;

	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_КодСметыБанка", Тип("ПолеФормы"), Элементы.ОплатаКонтрагенту, Элементы.ГруппаНеРезидент);
	ПолеВвода_АЛФ.Заголовок = "Код сметы банка";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_КодСметыБанка"; 

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОбъектСписания", Тип("ПолеФормы"), Элементы.ГруппаПереводСписание);
	ПолеВвода_АЛФ.Заголовок = "Объект списания";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектСписания";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОбъектСписанияПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЭтапСписания", Тип("ПолеФормы"), Элементы.ГруппаПереводСписание);
	ПолеВвода_АЛФ.Заголовок = "Этап списания";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ЭтапСписания";
	ПолеВвода_АЛФ.УстановитьДействие("НачалоВыбора", "ИИТ_ЭтапСписанияНачалоВыбора");

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_СчетПередачаДругойОрганизации", Тип("ПолеФормы"), Элементы.ГруппаПереводЗачисление);
	ПолеВвода_АЛФ.Заголовок = "Счет передачи другой организации";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_СчетПередачаДругойОрганизации";
    ПолеВвода_АЛФ.Видимость = Ложь;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОбъектЗачисления", Тип("ПолеФормы"), Элементы.ГруппаПереводЗачисление);
	ПолеВвода_АЛФ.Заголовок = "Объект зачисления";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектЗачисления";
	
	//Движения
	//Элементы.Проект.Видимость = Ложь;
	Элементы.ТаблицаДвиженийПроект.Заголовок =  "Этап строительства";

	//Таблица движений -2 колнки НДС, так как добавляются одноименные
	//Удалить программно можно только программно добавленные
	Элементы.ТаблицаДвиженийСтавкаНДС.Видимость = Ложь;
	Элементы.ТаблицаДвиженийСуммаНДС.Видимость = Ложь;
	
	//Подвал
	НоваяГруппа = Элементы.Вставить("ГруппаКомментарийОтветственныйЗаказы", Тип("ГруппаФормы"), , Элементы.РеестрДокументов);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;  	
	
	Элементы.Переместить(Элементы.ГруппаКомментарийОтветственный, НоваяГруппа);
	Элементы.ГруппаКомментарийОтветственный.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НоваяГруппа_1 = Элементы.Добавить("ГруппаКомментарийОтветственныйГор", Тип("ГруппаФормы"), Элементы.ГруппаКомментарийОтветственный);
	НоваяГруппа_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа_1.ОтображатьЗаголовок = Ложь;  	
	
	Элементы.Переместить(Элементы.Комментарий, НоваяГруппа_1);
	Элементы.Переместить(Элементы.Инициатор, НоваяГруппа_1);    
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОписаниеЗаявки", Тип("ПолеФормы"), Элементы.ГруппаКомментарийОтветственный);
	ПолеВвода_АЛФ.Заголовок = "Описание заказа";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОписаниеЗаявки";
	ПолеВвода_АЛФ.АвтоМаксимальнаяШирина 	= Ложь;   
	ПолеВвода_АЛФ.МногострочныйРежим 		= Истина;
	
	//ТЧ Заказы
	ТаблицаЗ = Элементы.Добавить("ЗаказыПоставщику", Тип("ТаблицаФормы"), Элементы.ГруппаКомментарийОтветственныйЗаказы);
	ТаблицаЗ.ПутьКДанным = "Объект.ЗаказыПоставщику";
	ТаблицаЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ТаблицаЗ.АвтоМаксимальнаяШирина = Ложь; 
	ТаблицаЗ.КоманднаяПанель.Видимость = Ложь;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ЗаказыПоставщикуНомерСтроки", Тип("ПолеФормы"), ТаблицаЗ);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ЗаказыПоставщику.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ЗаказыПоставщикуЗаказПоставщику", Тип("ПолеФормы"), ТаблицаЗ);
	ЭлементТаблицыФормы.Заголовок = "Заказ поставщику";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ЗаказыПоставщику.ЗаказПоставщику";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЗаказПоставщику", Тип("ПолеФормы"), Элементы.ГруппаКомментарийОтветственныйЗаказы);
	ПолеВвода_АЛФ.Заголовок = "Заказ поставщику";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ЗаказПоставщику"; 
	ПолеВвода_АЛФ.Видимость = Ложь;
	
#КонецВставки	
	УправлениеФормой(ЭтотОбъект);
	
	МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодтверждающиеДокументыУХ.ЗаполнитьПризнакиФайловОбъектов(Объект);
	КонецЕсли;
    
	ПодтверждающиеДокументыУХ.УстановитьОсновноеОформлениеЗаявки(ЭтотОбъект); 
	ИспользоватьПодтверждающиеДокументы		= ПодтверждающиеДокументыУХВызовСервера.ИспользоватьПодтверждающиеДокументы();

	Если НЕ Объект.Проведен Тогда
		ПроверитьЛимитыНаСервере();
	КонецЕсли;    
	 #Вставка     
	//Перенос доработок
	ВывестиМОРСПроекта();
	
	Элементы.ИИТ_МОРСЗаднимЧислом.Видимость = РольДоступна("ИИТ_Финслужба") ИЛИ РольДоступна("ПолныеПрава");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
	|ИЗ
	|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект = &Заявка) КАК РегистрСостоянийОбъектовСрезПоследних";
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СостояниеОбъекта = Выборка.СостояниеОбъекта;
	КонецЕсли;

	Если Объект.ДвиженияОперации.Количество() > 0 И Не ЗначениеЗаполнено(Объект.ДвиженияОперации[0].ЭлементСтруктурыЗадолженности) Тогда
		Объект.ДвиженияОперации[0].ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;
	КонецЕсли;
	
    Элементы.ФормаИИТ_СогласоватьДосрочно.Видимость = РольДоступна("АС_СогласоватьДосрочно"); 
	Элементы.ИИТ_ВидМаршрута.Видимость 				= РольДоступна("ИИТ_Финслужба") ИЛИ РольДоступна("ПолныеПрава");
	
	//Заполняем поле "Текущий согласующий"
	ЗаполнитьТекущегоСогласующего();

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		//Заполняем дату фактиеской оплаты
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|ГДЕ
		|	СписаниеСРасчетногоСчета.ДокументПланирования = &Заявка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.Дата
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа
		|ГДЕ
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ДокументПланирования = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.Дата) КАК Дата
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИИТ_ДатаФактическойОплаты = Выборка.Дата;
		КонецЕсли;		

	КонецЕсли;
	
	Если РольДоступна("ИИТ_ЗапретВозвратаЗаявки") Тогда
		Попытка
			Элементы.ОтменитьСогласование.Доступность = Ложь;
			Элементы.ОтменитьСогласование1.Доступность = Ложь;
		Исключение
		КонецПопытки;
	КонецЕсли;
		
	ОтобразитьТипПлатежа();
	
	Если ЗначениеЗаполнено(Объект.ИИТ_СчетОрганизации) Тогда
		Элементы.ФормаИИТ_ИзменитьРасчетныйСчет.Видимость = (Объект.ИИТ_СчетОрганизации.Ответственный = ПараметрыСеанса.ТекущийПользователь) ИЛИ ТекПользовательЗамещает(Объект.ИИТ_СчетОрганизации.Ответственный);
		Элементы.ФормаИИТ_ОплатилиДругуюСумму.Видимость = (Объект.ИИТ_СчетОрганизации.Ответственный = ПараметрыСеанса.ТекущийПользователь) ИЛИ ТекПользовательЗамещает(Объект.ИИТ_СчетОрганизации.Ответственный);
	КонецЕсли;

	ОбновитьСуммуНДС();
	
	Если ЗначениеЗаполнено(Объект.СчетКассаОрганизации) И ТипЗнч(Объект.СчетКассаОрганизации) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		Если Объект.СчетКассаОрганизации.Ответственный = ТекущийСогласующий Тогда
			Элементы.ФормаИИТ_СогласоватьДосрочно.Доступность = Ложь;	
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.ИИТ_СчетОрганизации) И ТипЗнч(Объект.ИИТ_СчетОрганизации) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		Если Объект.ИИТ_СчетОрганизации.Ответственный = ТекущийСогласующий Тогда
			Элементы.ФормаИИТ_СогласоватьДосрочно.Доступность = Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.ИИТ_ВидМаршрута) Тогда
		Объект.ИИТ_ВидМаршрута = Справочники.ИИТ_ВидыМаршрутов.НайтиПоНаименованию("По списку согласующих казначейство", Истина);	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.ИИТ_КодСметыБанка) Тогда
		ЗаполнитьКодСметы();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьВидМаршрута();
	КонецЕсли;
	
	Элементы.РеестрВыплатСамозанятым.Видимость = Ложь;  
	
	//СмирновРВ 	
	Элементы.ГруппаВалютаОплаты.Видимость 	= Ложь;
	Элементы.ГруппаРучногоКурса.Видимость 	= Ложь;
	Элементы.ГруппаИтогоКОплате.Видимость 	= Ложь;
	//СмирновРВ

#КонецВставки
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ВывестиКурсыПоИсточникуКурса();    
	#Удаление
	СоздатьНадписьФактическаяОплата(); 
	#КонецУдаления     
	#Вставка
	Элементы.ГруппаСпособыОплаты.Видимость = Ложь;
	#КонецВставки
	ЗаполнитьДанныеОбОплатеЗаявки();
		
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПринятьКСогласованию_Подключаемый")
Процедура АЛФ_ПринятьКСогласованию_Подключаемый()  
	#Вставка
		//+ИИТ_Аксеньюшкин
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Не Объект.Проведен ИЛИ Модифицированность Тогда
		Попытка
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИИТ_ВидМаршрута) Тогда
		Сообщить("Для отправки на согласование необходимо указать вид машрута!");
		Возврат;
	КонецЕсли;
	
	Если Строка(Объект.ВидОперацииУХ) = "Перевод на счет другой организации" И Не ЗначениеЗаполнено(Объект.СчетКассаОрганизации) Тогда
		Сообщить("Для отправки на согласование необходимо указать банковский счет!");
		Возврат;
	ИначеЕсли Строка(Объект.ВидОперацииУХ) <> "Перевод на счет другой организации" И Не ЗначениеЗаполнено(Объект.ИИТ_СчетОрганизации) Тогда
		Сообщить("Для отправки на согласование необходимо указать банковский счет!");
		Возврат;		
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	 
	Если АС_ДоговорУчета(Объект.ДоговорКонтрагента) Тогда 
		Структура = КонтрольБР(Объект.ДоговорКонтрагента);
		Если Структура.ЛимитПревышен Тогда  
			ПоказатьОповещениеПользователя(,,"Сумма заявки больше чем остаток к оплате по договору",БиблиотекаКартинок.ДиалогВосклицание);
			ЕстьПредупреждения = Истина;
			Возврат;
		КонецЕсли; 
		
		Если Не Структура.Ошибка = "" Тогда
			ПоказатьОповещениеПользователя(,,Структура.Ошибка,БиблиотекаКартинок.ДиалогВосклицание);
			ЕстьПредупреждения = Истина;
			Возврат;	
		КонецЕсли;	
	КонецЕсли;

	Если ЕстьПредупреждения = Ложь Тогда 
	#КонецВставки 
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтотОбъект, Объект.Ссылка); 
	#Вставка
	КонецЕсли; 
	#КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СогласоватьДокумент_Подключаемый")
Процедура АЛФ_СогласоватьДокумент_Подключаемый() 
	#Вставка
		//+ИИТ_Аксеньюшкин
	Если Модифицированность Тогда
		Сообщить("В заявку внесены изменения. Перед согласованием необходимо записать документ.");
		Возврат;
	КонецЕсли;
	
	ЭтоСогласующийМОД = ТекущийСогласующийМОРС(ТекущийСогласующий);
	Если ЭтоСогласующийМОД И АС_ДоговорУчета(Объект.ДоговорКонтрагента) Тогда 		
		Структура = КонтрольБР(Объект.ДоговорКонтрагента);
		Если Структура.ЛимитПревышен Тогда 
			ПоказатьОповещениеПользователя(,,"Сумма заявки больше чем остаток к оплате по договору",БиблиотекаКартинок.ДиалогВосклицание);  
			ЕстьПредупреждения = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	ЗаполнитьТекущегоСогласующего(); 
	Если ЗаявкаДосрочноСогласована() И ТекущийСогласующий <> ТекПользователь() И Не ПользователиЗаменяютДругДруга(ТекущийСогласующий, ТекПользователь()) Тогда
		Сообщить("Заявка была согласована досрочно, согласование не требуется!");
		Возврат;
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	Если ЕстьПредупреждения = Ложь Тогда  
	#КонецВставки
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтотОбъект);
	#Вставка
	КонецЕсли;
    #КонецВставки
КонецПроцедуры

