
&После("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения)   
	
	//+ИИТ_Аксеньюшкин
	Движение = Движения.ИИТ_ПринадлежностьСотрудниковКОбъектам.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектСтроительства = ИИТ_ОбъектСтроительства;
	Движение.Сотрудник = Сотрудник;
	Движения.ИИТ_ПринадлежностьСотрудниковКОбъектам.Записать(Истина);
	
	Движение = Движения.ИИТ_БригадыФизическихЛиц.Добавить();
	Движение.Период = Дата;
	Движение.Физлицо = Сотрудник.ФизическоеЛицо;
	Движение.Бригада = ИИТ_Бригада;
	Движения.ИИТ_БригадыФизическихЛиц.Записать();
	
	Движение = Движения.ИИТ_ОбъектыСтроительстваСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.ОбъектСтроительства = ИИТ_ОбъектСтроительства;
	Движения.ИИТ_ОбъектыСтроительстваСотрудников.Записать();
	
	ИИТ_ВспомогательныеФункцииСервер.УстановитьСтатусФЛ(Сотрудник.ФизическоеЛицо, Дата);
	//-ИИТ_Аксеньюшкин   
	
КонецПроцедуры
