
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Команды
	КомандаФормы = Команды.Добавить("ИИТ_ВыборкаПериода");
	КомандаФормы.Заголовок = "...";
	КомандаФормы.Действие  = "ИИТ_ВыборкаПериода";

	КомандаФормы = Команды.Добавить("ИИТ_КомандаОтбораПоВсемЗаказам");
	КомандаФормы.Заголовок = "Все заказы";
	КомандаФормы.Действие  = "ИИТ_КомандаОтбораПоВсемЗаказам";

	КомандаФормы = Команды.Добавить("ИИТ_КомандаОтбораПоНезакрытымЗаказам");
	КомандаФормы.Заголовок = "Свои заказы";
	КомандаФормы.Действие  = "ИИТ_КомандаОтбораПоНезакрытымЗаказам";
	
	КомандаФормы = Команды.Добавить("ИИТ_КомандаОтбораПоТекущемуПользователю");
	КомандаФормы.Заголовок = "Незакрытые заказы";
	КомандаФормы.Действие  = "ИИТ_КомандаОтбораПоТекущемуПользователю";

	КомандаФормы = Команды.Добавить("СброситьФильтры");
	КомандаФормы.Заголовок = "Сбросить фильтры";
	КомандаФормы.Действие  = "СброситьФильтры";

	//Поля
	ГруппаОтбор = Элементы.Вставить("ИИТ_ГруппаОтбораСписка", Тип("ГруппаФормы"), , Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	ГруппаОтбор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаОтбор.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор.ОтображатьЗаголовок = Ложь;  
	
	ГруппаОтбор_1 = Элементы.Добавить("ИИТ_ГруппаПолей", Тип("ГруппаФормы"), ГруппаОтбор);
	ГруппаОтбор_1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор_1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОтбор_1.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор_1.ОтображатьЗаголовок = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьОтборЗакрыт", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Заголовок = "Закрыт";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ИспользоватьОтборЗакрыт";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИспользоватьОтборЗакрытПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтборПоЗакрыт", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ОтборПоЗакрыт";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтборПоЗакрытПриИзменении");

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьОтборПоОтветственным", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Заголовок = "Ответственный";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ИспользоватьОтборПоОтветственным";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИспользоватьОтборПоОтветственнымПриИзменении");

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтборПоОтветственным", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ОтборПоОтветственным";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтборПоОтветственнымПриИзменении");

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьОтборПоПоставщикам", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Заголовок = "Поставщик";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ИспользоватьОтборПоПоставщикам";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИспользоватьОтборПоПоставщикамПриИзменении");

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтборПоПоставщикам", Тип("ПолеФормы"), ГруппаОтбор_1);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ОтборПоПоставщикам";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтборПоПоставщикамПриИзменении");

	ГруппаОтбор_2 = Элементы.Добавить("ИИТ_ГруппаОтборов", Тип("ГруппаФормы"), ГруппаОтбор);
	ГруппаОтбор_2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор_2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОтбор_2.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор_2.ОтображатьЗаголовок = Ложь;  

	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ИспользоватьОтборОписаниеЗаказа", Тип("ПолеФормы"), ГруппаОтбор_2);
	ПолеВвода_АЛФ.Заголовок = "Описание заказа";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ИспользоватьОтборОписаниеЗаказа";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ИспользоватьОтборОписаниеЗаказаПриИзменении");
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОтборПоОписание", Тип("ПолеФормы"), ГруппаОтбор_2);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_ОтборПоОписание";
	ПолеВвода_АЛФ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ИИТ_ОтборПоОписаниеПриИзменении");
	
	КнопкаФормы= Элементы.Добавить("СброситьФильтры", Тип("КнопкаФормы"), ГруппаОтбор_2);
	КнопкаФормы.ИмяКоманды = "СброситьФильтры";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	ПолеВвода_АЛФ = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ГруппаОтбор_2);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.Заголовок = "С";
	ПолеВвода_АЛФ.ПутьКДанным = "ДатаНачала";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ДатаНачалаПриИзменении");

	ПолеВвода_АЛФ = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ГруппаОтбор_2);
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.Заголовок = "по";
	ПолеВвода_АЛФ.ПутьКДанным = "ДатаОкончания";
	ПолеВвода_АЛФ.УстановитьДействие("ПриИзменении", "ДатаОкончанияПриИзменении");

	КнопкаФормы= Элементы.Добавить("ИИТ_ВыборкаПериода", Тип("КнопкаФормы"), ГруппаОтбор_2);
	КнопкаФормы.ИмяКоманды = "ИИТ_ВыборкаПериода";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
    КнопкаФормы.Ширина = 4;
	
	ГруппаОтбор_3 = Элементы.Добавить("ИИТ_ГруппаКнопок", Тип("ГруппаФормы"), ГруппаОтбор);
	ГруппаОтбор_3.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор_3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОтбор_3.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОтбор_3.ОтображатьЗаголовок = Ложь;  

	КнопкаФормы= Элементы.Добавить("ИИТ_КомандаОтбораПоТекущемуПользователю", Тип("КнопкаФормы"), ГруппаОтбор_3);
	КнопкаФормы.ИмяКоманды = "ИИТ_КомандаОтбораПоТекущемуПользователю";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Видимость = Ложь;

	КнопкаФормы= Элементы.Добавить("ИИТ_КомандаОтбораПоНезакрытымЗаказам", Тип("КнопкаФормы"), ГруппаОтбор_3);
	КнопкаФормы.ИмяКоманды = "ИИТ_КомандаОтбораПоНезакрытымЗаказам";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Видимость = Ложь;

	КнопкаФормы= Элементы.Добавить("ИИТ_КомандаОтбораПоВсемЗаказам", Тип("КнопкаФормы"), ГруппаОтбор_3);
	КнопкаФормы.ИмяКоманды = "ИИТ_КомандаОтбораПоВсемЗаказам";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Видимость = Ложь;
	
	//Источник для Дополнения невозможно установить, поэтому - на форме
	Элементы.Переместить(Элементы.ПоискОбщий, ГруппаОтбор_3);
	
	//+ИИТ_Аксеньюшкин
	ВыполнитьОтборПоПериоду();
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ВыполнитьОтборПоПериоду(Обновлять = Ложь)

	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончания);
	Если Обновлять Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ВыполнитьОтборПоПериоду(Истина);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ВыполнитьОтборПоПериоду(Истина);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ВыборкаПериода(Команда)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	СтандартныйПериод = Новый СтандартныйПериод;
	СтандартныйПериод.ДатаНачала = ДатаНачала;
	СтандартныйПериод.ДатаОкончания = ДатаОкончания;
	
	Диалог.Период = СтандартныйПериод;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериода", ЭтаФорма);	
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоОтветственным) И ИИТ_ИспользоватьОтборПоОтветственным = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоОтветственным;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоПоставщикам) И ИИТ_ИспользоватьОтборПоПоставщикам = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоПоставщикам;
	КонецЕсли; 

	Если ЗначениеЗаполнено(ИИТ_ОтборПоЗакрыт) И ИИТ_ИспользоватьОтборЗакрыт = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказЗакрыт");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоЗакрыт;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоОписание) И ИИТ_ИспользоватьОтборОписаниеЗаказа = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОписаниеЗаказа");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоОписание;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборЗакрытПриИзменении(Элемент)
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборОписаниеЗаказаПриИзменении(Элемент)
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборПоОтветственнымПриИзменении(Элемент)
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ИспользоватьОтборПоПоставщикамПриИзменении(Элемент)
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_КомандаОтбораПоВсемЗаказам(Команда)
	ИИТ_КомандаОтбораПоВсемЗаказамНаСервере();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_КомандаОтбораПоВсемЗаказамНаСервере()
	
	ИИТ_ИспользоватьОтборПоОтветственным = Ложь;
	ИИТ_ИспользоватьОтборПоПоставщикам = Ложь;
	Список.Отбор.Элементы.Очистить();
		
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_КомандаОтбораПоНезакрытымЗаказам(Команда)
	ИИТ_КомандаОтбораПоНезакрытымЗаказамНаСервере();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_КомандаОтбораПоНезакрытымЗаказамНаСервере()

	Список.Отбор.Элементы.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИИТ_ЗаказыПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику
	                      |ИЗ
	                      |	РегистрНакопления.ИИТ_ЗаказыПоставщику.Остатки КАК ИИТ_ЗаказыПоставщикуОстатки");  
	МассивЗаказовПоставщику = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПоставщику");
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(МассивЗаказовПоставщику);

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокЗначений;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_КомандаОтбораПоТекущемуПользователю(Команда)
	ИИТ_КомандаОтбораПоТекущемуПользователюНаСервере();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ИИТ_КомандаОтбораПоТекущемуПользователюНаСервере()
	
	ИИТ_ИспользоватьОтборПоОтветственным = Ложь;
	
	Список.Отбор.Элементы.Очистить();

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗначениеЗаполнено(ИИТ_ОтборПоПоставщикам) И ИИТ_ИспользоватьОтборПоПоставщикам = Истина Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИИТ_ОтборПоПоставщикам.Ссылка;
	КонецЕсли; 
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоЗакрытПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ИИТ_ОтборПоЗакрыт) Тогда
		ИИТ_ИспользоватьОтборЗакрыт = Истина;
	КонецЕсли;
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоОписаниеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ИИТ_ОтборПоОписание) Тогда
		ИИТ_ИспользоватьОтборОписаниеЗаказа = Истина;
	КонецЕсли;
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоОтветственнымПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ИИТ_ОтборПоОтветственным) Тогда
		ИИТ_ИспользоватьОтборПоОтветственным = Истина;
	КонецЕсли;
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ИИТ_ОтборПоПоставщикамПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ИИТ_ОтборПоПоставщикам) Тогда
		ИИТ_ИспользоватьОтборПоПоставщикам = Истина;
	КонецЕсли;
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ОбработкаВыбораПериода(Период, Параметры) Экспорт
	
	Если Период <> Неопределено Тогда
		ДатаНачала = Период.ДатаНачала;
		ДатаОкончания = Период.ДатаОкончания;
	КонецЕсли;
	
	ВыполнитьОтборПоПериоду(Истина);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура СброситьФильтры(Команда)

	ИИТ_ИспользоватьОтборОписаниеЗаказа = "";
	ИИТ_ИспользоватьОтборПоОтветственным = "";
	ИИТ_ИспользоватьОтборПоПоставщикам = "";
	ИИТ_ОтборПоЗакрыт = "";
	ИИТ_ОтборПоОписание = "";
	ИИТ_ОтборПоОтветственным = "";
	ИИТ_ОтборПоПоставщикам = "";
	ИИТ_ИспользоватьОтборЗакрыт = "";
	ИИТ_ЗагрузкаНастроекОтбораВДинамическийСписок();

КонецПроцедуры

#КонецОбласти