

&НаКлиенте
Процедура АЛФ_ПриОткрытииПеред(Отказ)

	//Перенос доработок содержимое процедуры целиком
	Если СпособОтображения <> "" Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы[СтрЗаменить(Строка(СпособОтображения), " ", "")];
	КонецЕсли;	
	
	Попытка
		Если ЭтаФорма.ВладелецФормы.Родитель.ИмяФормы = "Документ.ИИТ_ЕжедневныйТабельУчета.Форма.ФормаДокумента" И ЭтаФорма.ВладелецФормы.Имя = "ТабДокумент" Тогда

			ОбъектРодитель = ЭтаФорма.ВладелецФормы.Родитель.Объект.ОбъектСтроительства;
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			
			ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			ЭлементОтбора.ПравоеЗначение = ОбъектРодитель;

			ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Ложь;
	
		КонецЕсли;
	Исключение
	КонецПопытки;        
	//Конец переноса

КонецПроцедуры

&НаСервере 
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АЛФ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
#Вставка
	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ
			|	СправочникПроекты.Ссылка КАК Ссылка,
			|	СправочникПроекты.ПометкаУдаления КАК ПометкаУдаления,
			|	СправочникПроекты.Родитель КАК Родитель,
			|	СправочникПроекты.Код КАК Код,
			|	СправочникПроекты.Наименование КАК Наименование,
			|	ЕСТЬNULL(АтрибутыПроектов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК Поле1,
			|	ЕСТЬNULL(АтрибутыПроектов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК Поле2,
			|	ЕСТЬNULL(АтрибутыПроектов.ДлительностьДней, 0) КАК Поле3,
			|	СправочникПроекты.Ответственный КАК Ответственный,
			|	СправочникПроекты.Комментарий КАК Комментарий,
			|	СправочникПроекты.ОсновнаяСтатьяДвиженияДенежныхСредств КАК ОсновнаяСтатьяДвиженияДенежныхСредств,
			|	СправочникПроекты.ОсновнаяСтатьяДоходовИРасходов КАК ОсновнаяСтатьяДоходовИРасходов,
			|	СправочникПроекты.Организация КАК Организация,
			|	СправочникПроекты.ОсновнойКонтрагент КАК ОсновнойКонтрагент,
			|	СправочникПроекты.ОсновнойДоговорКонтрагента КАК ОсновнойДоговорКонтрагента,
			|	СправочникПроекты.ОсновнаяВалютаПлатежей КАК ОсновнаяВалютаПлатежей,
			|	СправочникПроекты.Состояние КАК Состояние,
			|	СправочникПроекты.Предопределенный КАК Предопределенный,
			|	СправочникПроекты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	СправочникПроекты.ФункциональноеНаправление КАК ФункциональноеНаправление,
			|	СправочникПроекты.Проект КАК Проект,
			|	СправочникПроекты.РазделИнвестиционнойПрограммы КАК РазделИнвестиционнойПрограммы,
			|	СправочникПроекты.ПроектЭтапа КАК ПроектЭтапа
			|ИЗ
			|	Справочник.Проекты КАК СправочникПроекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыПроектов КАК АтрибутыПроектов
			|		ПО (АтрибутыПроектов.Проект = СправочникПроекты.Ссылка)
			|			И (АтрибутыПроектов.Сценарий = ЗНАЧЕНИЕ(Справочник.Сценарии.План))
			|ГДЕ
			|	(СправочникПроекты.Ссылка В ИЕРАРХИИ (&МассивОС)
			|			ИЛИ &ДоступныВсеОС)";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Справочник.Проекты";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);  	 
		
	МассивОС = ИИТ_ВспомогательныеФункцииСервер.ПолучитьМассивДоступныхПроектов();
	Список.Параметры.УстановитьЗначениеПараметра("МассивОС", МассивОС);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеОС", РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_ПолноеЧтение")
												ИЛИ РольДоступна("ИИТ_ФинСлужба") ИЛИ РольДоступна("ИИТ_РуководительСнабжения") ИЛИ РольДоступна("ИИТ_Снабжение"));
#КонецВставки	
	Если Параметры.Отбор.Свойство("Родитель") И ЗначениеЗаполнено(Параметры.Отбор.Родитель)
		ИЛИ (Параметры.Отбор.Свойство("Проект") И НЕ Параметры.Отбор.Проект) Тогда
		Элементы.Список.Отображение=ОтображениеТаблицы.Список;
	Иначе
		Элементы.Список.Отображение=ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
	
	ТолькоПроекты = Параметры.ВыборТолькоПроектов;
	ТолькоЭтапы   = Параметры.ВыборТолькоЭтапов;
    #Вставка
	Если Параметры.Свойство("ОтображениеСписка") Тогда											
		СпособОтображения = Строка(Параметры.ОтображениеСписка);
	КонецЕсли;
#КонецВставки
КонецПроцедуры

