
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Группа соответствие
	ГруппаСоответствие = Элементы.Добавить("ИИТ_ГруппаИДВнешнихСкладов", Тип("ГруппаФормы"));
	ГруппаСоответствие.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаСоответствие.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаСоответствие.Заголовок = "ИД внешних складов";
	
	ТаблицаОбъекты = Элементы.Добавить("ИИТ_СоответствующиеИДВнешнихБаз", Тип("ТаблицаФормы"), ГруппаСоответствие);
	ТаблицаОбъекты.ПутьКДанным = "Объект.ИИТ_СоответствующиеИДВнешнихБаз";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_СоответствующиеИДВнешнихБазНомерСтроки", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_СоответствующиеИДВнешнихБаз.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_СоответствующиеИДВнешнихБазИДСклада", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок = "ИД внешнего склада";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_СоответствующиеИДВнешнихБаз.ИДСклада";

	ЭлементТаблицыФормы = Элементы.Добавить("ИИТ_СоответствующиеИДВнешнихБазВнешняяБаза", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок = "Внешняя база";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.ИИТ_СоответствующиеИДВнешнихБаз.ВнешняяБаза";

КонецПроцедуры
