
&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("УправлениеФормой")
Процедура АЛФ_УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	УчетЗарплатыИКадровСредствамиБухгалтерии    = Форма.УчетЗарплатыИКадровСредствамиБухгалтерии;
	РассчитыватьЗарплатуНебольшихОрганизаций    = Форма.РасчетЗарплатыДляНебольшихОрганизаций;
	ИспользоватьКадровыйУчет                    = Форма.ИспользоватьКадровыйУчет;
	ИспользоватьНачисленияПоДоговорам           = Форма.ИспользоватьНачисленияПоДоговорам;
	МожноРедактировать                          = Форма.МожноРедактировать;
	ИспользуетсяСервисЭлектронныхТрудовыхКнижек = Форма.ИспользуетсяСервисЭлектронныхТрудовыхКнижек;
	ИспользоватьКадровыйУчетПриВнешнейЗарплате  = Форма.ИспользоватьКадровыйУчетПриВнешнейЗарплате;

	Принят     = ЗначениеЗаполнено(Форма.ДатаПриема);
	Уволен     = ЗначениеЗаполнено(Форма.ДатаУвольнения);
	Договорник = ЗначениеЗаполнено(Форма.ДоговорРаботыУслуги.Ссылка);

	Если УчетЗарплатыИКадровСредствамиБухгалтерии Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОформлениеСотрудника",
		"Видимость",
		(НЕ Договорник ИЛИ Не Принят) И Форма.РежимВыбора = Ложь);

		// Кадровые данные видны только в том случае, когда сотрудник оформлен 
		// по трудовому или гражданско-правовому договору.

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаРабота",
		"Заголовок",
		?(ИспользоватьНачисленияПоДоговорам,
		НСтр("ru = 'Договоры'"),
		НСтр("ru = 'Договор'")));


		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОформитьДокумент",
		"Видимость",
		Форма.РежимВыбора = Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СведенияОДоговорахПодряда",
		"Видимость",
		Договорник);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СведенияОРабочихМестах",
		"Видимость",
		Принят
		ИЛИ (НЕ ИспользоватьКадровыйУчет 
		И НЕ ИспользоватьНачисленияПоДоговорам));

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОформитьДоговорРаботыУслуги",
		"Видимость",
		НЕ Договорник
		И РассчитыватьЗарплатуНебольшихОрганизаций
		И ИспользоватьНачисленияПоДоговорам
		И МожноРедактировать);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаВыплатаЗарплаты",
		"Видимость",
		(Принят
		ИЛИ (НЕ Форма.ИспользоватьКадровыйУчет
		И НЕ (РассчитыватьЗарплатуНебольшихОрганизаций И ИспользоватьНачисленияПоДоговорам)))
		ИЛИ Договорник);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаНалогиИВзносы",
		"Видимость",
		(Принят
		ИЛИ (НЕ Форма.ИспользоватьКадровыйУчет
		И НЕ (РассчитыватьЗарплатуНебольшихОрганизаций И ИспользоватьНачисленияПоДоговорам)))
		ИЛИ Договорник);

		// Подробности кадрового учета
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОформитьПриемНаРаботуУпрощенный",
		"Видимость",
		НЕ Принят
		И РассчитыватьЗарплатуНебольшихОрганизаций
		И ИспользоватьНачисленияПоДоговорам
		И НЕ ИспользоватьКадровыйУчет);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаУвольнение",
		"Доступность",
		Принят И НЕ Форма.Параметры.Ключ.Пустая());

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КнопкаНовогоОформитьПриемНаРаботу",
		"Видимость",
		НЕ Принят
		И МожноРедактировать);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатаПриема",
		"Видимость",
		Принят ИЛИ НЕ ИспользоватьКадровыйУчет);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаУвольнение",
		"Видимость",
		Принят ИЛИ НЕ ИспользоватьКадровыйУчет);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Уволить",
		"Видимость",
		НЕ ИспользоватьКадровыйУчет);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Уволить",
		"Доступность",
		Принят И НЕ Уволен И НЕ Форма.Параметры.Ключ.Пустая());

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИзменитьОклад",
		"Доступность",
		Принят И НЕ Уволен);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИзменитьОклад",
		"Видимость",
		НЕ Уволен
		И МожноРедактировать);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИзменитьДоговор",
		"Видимость",
		МожноРедактировать);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатаУвольнения",
		"Видимость",
		Уволен);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВАрхиве",
		"Видимость",
		Уволен);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаБухгалтерскийУчетЗарплаты",
		"Видимость",
		Форма.ПользовательУправляетСчетамиУчета
		И (Принят ИЛИ Договорник));

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаАвансСотрудника",
		"Видимость",
		Форма.АвансРедактируется);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПроцентСевернойНадбавки",
		"Видимость",
		Форма.ПрименятьСевернуюНадбавку);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЛичныеДанные",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаВыплатаЗарплаты",
		"ТолькоПросмотр",
		((НЕ Принят ИЛИ Уволен) И ИспользоватьКадровыйУчет)
		И НЕ Договорник);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОсновнойБанковскийСчетПредставление",
		"Доступность",
		Форма.МожноРедактироватьБанковскийСчет
		Или Не ПустаяСтрока(Форма.ОсновнойБанковскийСчетНаименование));

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПрямыеВыплатыФССПредставление",
		"Видимость",
		Принят ИЛИ Договорник);

		ОтобразитьМестоВыплаты(Форма);
		ОтобразитьПаспортныеДанные(Форма);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗаписьЭлектроннойТрудовойКнижкиПросмотр",
		"Видимость",
		НЕ ИспользоватьКадровыйУчет
		И (НЕ Уволен ИЛИ Форма.ДатаУвольнения >= Форма.ДатаНачалаУчетаЭТК));

		УправлениеФормойКадровогоМероприятия(Форма);

	Иначе

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОформлениеСотрудника",
		"Видимость",
		ИспользуетсяСервисЭлектронныхТрудовыхКнижек);

		Элементы.ГруппаРабота.Заголовок = НСтр("ru = 'Кадровые данные'");

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФизлицоДатаРождения",
		"АвтоОтметкаНезаполненного",
		ИспользуетсяСервисЭлектронныхТрудовыхКнижек);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатыПриемаУвольнения",
		"Видимость",
		ИспользуетсяСервисЭлектронныхТрудовыхКнижек
		Или ИспользоватьКадровыйУчетПриВнешнейЗарплате);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаВыплатаЗарплаты",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаНалогиИВзносы",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаБухгалтерскийУчетЗарплаты",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОформитьДокумент",
		"Видимость",
		ИспользуетсяСервисЭлектронныхТрудовыхКнижек);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПаспортныеДанные",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПроцентСевернойНадбавки",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЛичныеДанные",
		"Видимость",
		Не ИспользуетсяСервисЭлектронныхТрудовыхКнижек);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПрямыеВыплатыФССПредставление",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СведенияОДоговорахПодряда",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗаписьЭлектроннойТрудовойКнижкиПросмотр",
		"Видимость",
		Ложь);

	КонецЕсли;

	Если ИспользоватьКадровыйУчетПриВнешнейЗарплате Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СведенияОРабочихМестах",
		"Видимость",
		Принят);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатыПриемаУвольнения",
		"ТолькоПросмотр",
		Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатаУвольнения",
		"Видимость",
		Уволен);

	КонецЕсли;

	Если ИспользуетсяСервисЭлектронныхТрудовыхКнижек Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФизлицоДатаРождения",
		"ОтображениеПодсказки",
		ОтображениеПодсказки.Нет);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатыПриемаУвольнения",
		"ТолькоПросмотр",
		Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатаПриема",
		"ПропускатьПриВводе",
		Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ТекущееПодразделение",
		"ПропускатьПриВводе",
		Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ТекущаяДолжность",
		"ПропускатьПриВводе",
		Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ТекущийВидЗанятости",
		"ПропускатьПриВводе",
		Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КнопкаНовогоОформитьПриемНаРаботу",
		"Видимость",
		НЕ Принят
		И МожноРедактировать);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИзменитьОклад",
		"Видимость",
		Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатаУвольнения",
		"Видимость",
		Уволен);

	КонецЕсли;
    #Удаление
	Элементы.ГруппаПредупреждениеНерезидентАУСН.Видимость =
	Форма.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Статус = Форма.Нерезидент;
    #КонецУдаления
КонецПроцедуры
