
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Элементы
	Элементы.Оклад.Заголовок = "Ставка в час"; 
	
 	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.ПозицияГруппа);
	ПолеВвода_АЛФ.Заголовок = "Объект строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеФлажка;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектСтроительства";

КонецПроцедуры

&НаСервере
Процедура АЛФ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры
