#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Перенос_Доработок


//ИИТ_Аксеньюшкин
Процедура ИИТ_СправкаОПриемеУведомления(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт
	
	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_СправкаОПриемеУведомления");
	
	ОбластьВерхнийКолонтитул = Макет.ПолучитьОбласть("ВерхнийКолонтитул");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ТабличныйДокумент.Вывести(ОбластьВерхнийКолонтитул);	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.СтранаВыдачи КАК СтранаВыдачи
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, Физлицо = &ФизЛицо) КАК ДокументыФизическихЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтранаРегистрации = Строка(Выборка.СтранаВыдачи);
	Иначе
		СтранаРегистрации = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//ОрганизацияСтр = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Организация.НаименованиеПолное, 3);
		ОрганизацияСтр = Выборка.Организация.НаименованиеПолное;
	Иначе
		ОрганизацияСтр = "";
	КонецЕсли;
	
	ОбластьТело.Параметры.Организация = ОрганизацияСтр;
	ОбластьТело.Параметры.Сотрудник = ТРег(СсылкаНаСотрудника.Наименование) + ", " + ТРег(СтранаРегистрации);
	
	ТабличныйДокумент.Вывести(ОбластьТело);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	РегистрСведений.ИИТ_ПринадлежностьСотрудниковКОбъектам.СрезПоследних(, Сотрудник = &Сотрудник) КАК ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьПодвал.Параметры.Инспектор = Выборка.ОбъектСтроительства.ИИТ_ДолжностноеЛицоМВД;
	Иначе
		ОбластьПодвал.Параметры.Инспектор = "";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_УведомлениеОЗаключенииТрудовогоДоговора(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	РегистрСведений.ИИТ_ПринадлежностьСотрудниковКОбъектам.СрезПоследних(, Сотрудник = &Сотрудник) КАК ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбъектСтроительства = Выборка.ОбъектСтроительства;
	Иначе
		ОбъектСтроительства = Неопределено;
	КонецЕсли;

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_УведомлениеОЗаключенииТрудовогоДоговора");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		Должность = Выборка.Должность;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
		Должность = Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
	ОбластьТелоЧастьОдин = Макет.ПолучитьОбласть("ОбластьТелоЧастьОдин");
	Если СтрДлина(Организация.ИНН) = 12 Тогда
		ОбластьТелоЧастьОдин.Параметры.ИП = "X";
	Иначе
		ОбластьТелоЧастьОдин.Параметры.ЮЛ = "X";
	КонецЕсли;	
	
	//СЛОЖНЫЙ ВЫВОД ПО СЛОВАМ ---------->
	НаименованиеПолное = ВРег(Организация.НаименованиеПолное);
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НаименованиеПолное);
	
	ПозицияСимвола = 1;
	НомерКолонкиВывода = 1;

	Для Каждого СловоПредставления Из МассивСлов Цикл
		
		Пока СтрДлина(СловоПредставления) + НомерКолонкиВывода > 34 Цикл
			ПозицияСимвола = ПозицияСимвола + 1;
			НомерСтрокиВывода = Цел((ПозицияСимвола - 1) / 34) + 1;
			НомерКолонкиВывода = ПозицияСимвола - 34 * (НомерСтрокиВывода - 1);
			Продолжить;
		КонецЦикла;
		
		Для Н = 1 По СтрДлина(СловоПредставления) Цикл			
			НомерСтрокиВывода = Цел((ПозицияСимвола - 1) / 34) + 1;
			НомерКолонкиВывода = ПозицияСимвола - 34 * (НомерСтрокиВывода - 1);
			ОбластьТелоЧастьОдин.Область("R" + Строка(29 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(СловоПредставления, Н, 1);
			ПозицияСимвола = ПозицияСимвола + 1;
		КонецЦикла;		

		ПозицияСимвола = ПозицияСимвола + 1;

	КонецЦикла;
	//<----------СЛОЖНЫЙ ВЫВОД ПО СЛОВАМ
	
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		Смещение = 0;
		НаименованиеПолное = ВРег(ОбъектСтроительства.ИИТ_МестоПредоставленияУведомления);
		Для Н = 1 По СтрДлина(НаименованиеПолное) Цикл
			НомерСтрокиВывода = Цел((Н - 1) / 34) + 1;
			НомерКолонкиВывода = Н - 34 * (НомерСтрокиВывода - 1) - Смещение;
			Если Сред(НаименованиеПолное, Н, 1) = " " И НомерКолонкиВывода = 1 Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			ОбластьТелоЧастьОдин.Область("R" + Строка(8 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(НаименованиеПолное, Н, 1);
		КонецЦикла;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьТелоЧастьОдин);

	ОбластьТелоЧастьЧетыре = Макет.ПолучитьОбласть("ОбластьТелоЧасть41");
	ОГРНВывод = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
	Для Н = 1 По СтрДлина(ОГРНВывод) Цикл
		ОбластьТелоЧастьЧетыре.Область("R6C" + Строка(Н + 1)).Текст = Сред(ОГРНВывод, Н, 1);
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьТелоЧастьЧетыре);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьТелоЧастьЧетыре = Макет.ПолучитьОбласть("ОбластьТелоЧасть42");
	СтрокаИНН = "ИНН " + Организация.ИНН;
	Для Н = 1 По СтрДлина(СтрокаИНН) Цикл
		ОбластьТелоЧастьЧетыре.Область("R6C" + Строка(Н + 1)).Текст = Сред(СтрокаИНН, Н, 1);
	КонецЦикла;
	
	//Вывод адреса организации
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Если НайденныеСтроки.Количество() > 0 Тогда

		АдресВывод = ВРег(НайденныеСтроки[0].Представление);
		МассивСтрок = Новый Массив;
		ТекНачалоСтроки = 1;
		Смещение = 0;
		Пока ТекНачалоСтроки <= СтрДлина(АдресВывод) Цикл
			Если Сред(АдресВывод, ТекНачалоСтроки + Смещение, 1) = " "  Тогда
				Смещение = Смещение + 1;
			КонецЕсли;
			МассивСтрок.Добавить(СокрЛП(Сред(АдресВывод, ТекНачалоСтроки + Смещение, 34)));
			ТекНачалоСтроки = ТекНачалоСтроки + 34;
		КонецЦикла;
		
		Для Н = 0 По МассивСтрок.Количество() - 1 Цикл
			Для К = 1 По СтрДлина(МассивСтрок[Н]) Цикл
				ОбластьТелоЧастьЧетыре.Область("R" + Строка(8 + Н * 2) + "C" + Строка(К + 1)).Текст = Сред(МассивСтрок[Н], К, 1);
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;

	//Вывод телефона организации
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТелефонВывод = СтрЗаменить(НайденныеСтроки[0].Представление, "-", "");
		Для Н = 1 По СтрДлина(ТелефонВывод) Цикл
			ОбластьТелоЧастьЧетыре.Область("R14C" + Строка(10 + Н)).Текст = Сред(ТелефонВывод, Н, 1);
		КонецЦикла;
	КонецЕсли;	
	
	ТабличныйДокумент.Вывести(ОбластьТелоЧастьЧетыре);	

	// Занесение данных по сотруднику 
	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	
	ОбластьТелоСотрудникФамилия = Макет.ПолучитьОбласть("ОбластьТелоСотрудникФамилия");
	Если МассивФИО.Количество() > 0 Тогда
		ФамилияСотрудника = Новый Массив; 
		Для НомерСимвола = 1 По СтрДлина(МассивФИО[0]) Цикл
			СтрЛев = Лев(МассивФИО[0], НомерСимвола);
			СтрПрав = Прав(СтрЛев, 1);
			ФамилияСотрудника.Добавить(СтрПрав);
		КонецЦикла;
		
		С = 7;
		Для каждого Буква Из ФамилияСотрудника Цикл		
			//Для н = с По 34 Цикл
				ОбластьТелоСотрудникФамилия.Область("R1C" + (С + 1)).Текст = ВРег(Буква);
			//КонецЦикла; 
			С = С + 1
		КонецЦикла;
		МассивФИО.Удалить(0);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникФамилия);

	ОбластьТелоЧасть5 = Макет.ПолучитьОбласть("ОбластьТелоЧасть5");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть5);

	ОбластьТелоСотрудникИмя = Макет.ПолучитьОбласть("ОбластьТелоСотрудникИмя"); 
	Если МассивФИО.Количество() > 0 Тогда 
		ИмяСотрудника = Новый Массив; 
		Для НомерСимвола = 1 По СтрДлина(МассивФИО[0]) Цикл
			СтрЛев = Лев(МассивФИО[0], НомерСимвола);
			СтрПрав = Прав(СтрЛев, 1);
			ИмяСотрудника.Добавить(СтрПрав);
		КонецЦикла;
		С = 7;
		Для каждого Буква Из ИмяСотрудника Цикл		
			//Для н = с По 34 Цикл
				ОбластьТелоСотрудникИмя.Область("R1C" + (С + 1)).Текст = ВРег(Буква);
			//КонецЦикла; 
			С = С + 1
		КонецЦикла;
		МассивФИО.Удалить(0);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникИмя);
	
	//ОбластьТелоЧасть6 = Макет.ПолучитьОбласть("ОбластьТелоЧасть6"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть6);
	
	ОбластьТелоСотрудникОтчество = Макет.ПолучитьОбласть("ОбластьТелоСотрудникОтчество"); 
	Если МассивФИО.Количество() > 0 Тогда  
		С = 7;
		Для каждого ОтчествоСотрудника Из МассивФИО Цикл 
			Отчество = Новый Массив; 
			Для НомерСимвола = 1 По СтрДлина(ОтчествоСотрудника) Цикл
				СтрЛев = Лев(ОтчествоСотрудника, НомерСимвола);
				СтрПрав = Прав(СтрЛев, 1);
				Отчество.Добавить(СтрПрав);
			КонецЦикла;
			Для каждого Буква Из Отчество Цикл		
				//Для н = с По 34 Цикл
					ОбластьТелоСотрудникОтчество.Область("R2C" + (С + 1)).Текст = ВРег(Буква);
				//КонецЦикла; 
				С = С + 1
			КонецЦикла;
			ОбластьТелоСотрудникОтчество.Область("R2C" + (С + 1)).Текст = " ";  // исправил с 1 на 2
			С = С + 1
		КонецЦикла;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникОтчество);
	
	//ОбластьТелоЧасть7 = Макет.ПолучитьОбласть("ОбластьТелоЧасть7");
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть7);
	
	ОбластьТелоСотрудникГражданство = Макет.ПолучитьОбласть("ОбластьТелоСотрудникГражданство");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ГражданствоФизическихЛиц.Страна.Наименование КАК СтранаНаименование
	                      |ИЗ
	                      |	РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизическихЛиц
	                      |ГДЕ
	                      |	ГражданствоФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо");
	Запрос.УстановитьПараметр("ФизическоеЛицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерКолонки = 8;
		Для н = 1 По СтрДлина(Выборка.СтранаНаименование) Цикл
			ЧастьСтроки = Лев(Выборка.СтранаНаименование, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникГражданство.Область("R1C" + (НомерКолонки + 1)).Текст = ПоследнийСимвол;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;			
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникГражданство);
	
	ОбластьТелоЧасть8 = Макет.ПолучитьОбласть("ОбластьТелоЧасть8");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть8);
	
	ОбластьТелоСотрудникМестоРожденияОдин = Макет.ПолучитьОбласть("ОбластьТелоСотрудникМестоРожденияОдин"); 
	СтранаВывод = Строка(СсылкаНаСотрудника.ФизическоеЛицо.СтранаРождения) + ",";
	Для Н = 1 По СтрДлина(СтранаВывод) Цикл
		ОбластьТелоСотрудникМестоРожденияОдин.Область("R1C" + Строка(Н + 11)).Текст = Сред(СтранаВывод, Н, 1);
	КонецЦикла;

	ОбластьВывод = Строка(СсылкаНаСотрудника.ФизическоеЛицо.ОбластьРождения);
	Для Н = 1 По СтрДлина(ОбластьВывод) Цикл
		ОбластьТелоСотрудникМестоРожденияОдин.Область("R3C" + Строка(Н + 1)).Текст = ВРег(Сред(ОбластьВывод, Н, 1));
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникМестоРожденияОдин);
	
	ОбластьТелоЧасть10 = Макет.ПолучитьОбласть("ОбластьТелоЧасть10");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть10);
	
	ОбластьТелоСотрудникДатаРождения = Макет.ПолучитьОбласть("ОбластьТелоСотрудникДатаРождения"); 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.ДатаРождения КАК ДатаРождения
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаРождения = Формат(Выборка.ДатаРождения, "ДЛФ=D");
		ДатаБезТочек = СтрЗаменить(ДатаРождения, ".", "");
		ДатаДень = Лев(ДатаБезТочек, 2);
		ДатаМесяц = Сред(ДатаБезТочек, 3, 2);
		ДатаГод = Прав(ДатаБезТочек, 4); 
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 11).Текст = Лев(ДатаДень,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 12).Текст = Прав(ДатаДень,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 14).Текст = Лев(ДатаМесяц,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 15).Текст = Прав(ДатаМесяц,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 17).Текст = Лев(ДатаГод,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 18).Текст = Сред(ДатаГод,2,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 19).Текст = Сред(ДатаГод,3,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 20).Текст = Прав(ДатаГод,1);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникДатаРождения);
	
	ОбластьТелоЧасть11 = Макет.ПолучитьОбласть("ОбластьТелоЧасть11");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть11);
	
	//ОбластьТелоЧасть12 = Макет.ПолучитьОбласть("ОбластьТелоЧасть12");
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть12);
	
	ОбластьТелоСотрудникПаспорт = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспорт");
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспорт);          
	
	//ОбластьТелоЧасть13 = Макет.ПолучитьОбласть("ОбластьТелоЧасть13"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть13);
	
	ОбластьТелоЧасть14 = Макет.ПолучитьОбласть("ОбластьТелоЧасть14");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть14);
	
	ОбластьТелоСотрудникПаспортСерияНомерДата = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортСерияНомерДата");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	Запрос.УстановитьПараметр("Физлицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Серия
		НомерКолонки = 4;
		Для н = 1 По СтрДлина(Выборка.Серия) Цикл
			ЧастьСтроки = Лев(Выборка.Серия, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + (НомерКолонки + 1)).Текст = ПоследнийСимвол;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;	
		
		// Номер
		НомерКолонки = 12;
		Для н = 1 По СтрДлина(Выборка.Номер) Цикл
			ЧастьСтроки = Лев(Выборка.Номер, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + (НомерКолонки + 1)).Текст = ПоследнийСимвол;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;	
		
		// Дата выдачи
		ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДЛФ=D");
		ДатаБезТочек = СтрЗаменить(ДатаВыдачи, ".", "");
		ДатаДень = Лев(ДатаБезТочек, 2);
		ДатаМесяц = Сред(ДатаБезТочек, 3, 2);
		ДатаГод = Прав(ДатаБезТочек, 4); 
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 26).Текст = Лев(ДатаДень,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 27).Текст = Прав(ДатаДень,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 29).Текст = Лев(ДатаМесяц,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 30).Текст = Прав(ДатаМесяц,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 32).Текст = Лев(ДатаГод,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 33).Текст = Сред(ДатаГод,2,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 34).Текст = Сред(ДатаГод,3,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 35).Текст = Прав(ДатаГод,1);
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортСерияНомерДата);
	
	//ОбластьТелоЧасть15 = Макет.ПолучитьОбласть("ОбластьТелоЧасть15"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть15);
	
	ОбластьТелоЧасть16 = Макет.ПолучитьОбласть("ОбластьТелоЧасть16");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть16);
	
	ОбластьТелоСотрудникПаспортКемВыданОдин = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортКемВыданОдин");
    ПереходНаСледСтроку = Ложь;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	Запрос.УстановитьПараметр("Физлицо", СсылкаНаСотрудника.ФизическоеЛицо);
	ВыборкаКемВыдан = Запрос.Выполнить().Выбрать();
	Если ВыборкаКемВыдан.Следующий() Тогда
		НомерКолонки = 7;
		ДлинаСтроки = 34;
		Для Н = 1 По СтрДлина(ВыборкаКемВыдан.КемВыдан) Цикл
			ЧастьСтроки = Лев(ВыборкаКемВыдан.КемВыдан, Н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортКемВыданОдин.Область("R1C" + (НомерКолонки + 1)).Текст = ВРег(ПоследнийСимвол);
			НомерКолонки = НомерКолонки + 1;
			Если НомерКолонки > ДлинаСтроки Тогда
				НовыйНомерСтроки = Н + 1;
				ПереходНаСледСтроку = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;		
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортКемВыданОдин);
	
	ОбластьТелоЧасть17 = Макет.ПолучитьОбласть("ОбластьТелоЧасть17");   
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть17);
	
	ОбластьТелоСотрудникПаспортКемВыданДва = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортКемВыданДва");
	Если ПереходНаСледСтроку = Истина Тогда
	 	ПереходНаСледСтроку = Ложь;	
		НомерКолонки = 7;
		ДлинаСтроки = 34;
		Для н = НовыйНомерСтроки По СтрДлина(ВыборкаКемВыдан.КемВыдан) Цикл
			ЧастьСтроки = Лев(ВыборкаКемВыдан.КемВыдан, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортКемВыданДва.Область("R1C" + (НомерКолонки + 1)).Текст = ВРег(ПоследнийСимвол);
			НомерКолонки = НомерКолонки + 1;
			Если НомерКолонки > ДлинаСтроки Тогда
				НовыйНомерСтроки = н + 1;
				ПереходНаСледСтроку = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортКемВыданДва);
	
	ОбластьТелоЧасть18 = Макет.ПолучитьОбласть("ОбластьТелоЧасть18");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть18);
	
	ОбластьТелоСотрудникПаспортКемВыданТри = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортКемВыданТри");
	Если ПереходНаСледСтроку = Истина Тогда
	 	ПереходНаСледСтроку = Ложь;	
		НомерКолонки = 14;
		ДлинаСтроки = 26;
		Для н = НовыйНомерСтроки По СтрДлина(ВыборкаКемВыдан.КемВыдан) Цикл
			ЧастьСтроки = Лев(ВыборкаКемВыдан.КемВыдан, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортКемВыданДва.Область("R1C" + (НомерКолонки + 1)).Текст = ВРег(ПоследнийСимвол);
			НомерКолонки = НомерКолонки + 1;
			Если НомерКолонки > ДлинаСтроки Тогда
				//НовыйНомерСтроки = н;
				//ПереходНаСледСтроку = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортКемВыданТри);
	
	ОбластьТелоЧасть19 = Макет.ПолучитьОбласть("ОбластьТелоЧасть19_1"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть19);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьТелоЧасть19 = Макет.ПолучитьОбласть("ОбластьТелоЧасть19_2"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть19);
	
	//ОбластьТелоЧасть20 = Макет.ПолучитьОбласть("ОбластьТелоЧасть20");
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть20);
	
	ОбластьТелоДокументНаименование = Макет.ПолучитьОбласть("ОбластьТелоДокументНаименование");  
	ТабличныйДокумент.Вывести(ОбластьТелоДокументНаименование);
	
	//ОбластьТелоЧасть21 = Макет.ПолучитьОбласть("ОбластьТелоЧасть21"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть21);
	
	ОбластьТелоПатент = Макет.ПолучитьОбласть("ОбластьТелоПатент"); 	
	Для Н = 1 По СтрДлина(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСерия) Цикл
		ОбластьТелоПатент.Область("R1C" + Строка(Н + 4)).Текст = Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСерия, Н, 1);
	КонецЦикла;
	Для Н = 1 По СтрДлина(СсылкаНаСотрудника.ФизическоеЛицо.ПатентНомер) Цикл
		ОбластьТелоПатент.Область("R1C" + Строка(Н + 12)).Текст = Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентНомер, Н, 1);
	КонецЦикла;
	ОбластьТелоПатент.Область("R1C26").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R1C27").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R1C29").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R1C30").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R1C32").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 1, 1);
	ОбластьТелоПатент.Область("R1C33").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 2, 1);
	ОбластьТелоПатент.Область("R1C34").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 3, 1);
	ОбластьТелоПатент.Область("R1C35").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 4, 1);
	
	ОбластьТелоПатент.Область("R8C9").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C10").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C12").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C13").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C15").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 1, 1);
	ОбластьТелоПатент.Область("R8C16").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 2, 1);
	ОбластьТелоПатент.Область("R8C17").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 3, 1);
	ОбластьТелоПатент.Область("R8C18").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 4, 1);
	
	ОбластьТелоПатент.Область("R8C21").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C22").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C24").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C25").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C27").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 1, 1);
	ОбластьТелоПатент.Область("R8C28").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 2, 1);
	ОбластьТелоПатент.Область("R8C29").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 3, 1);
	ОбластьТелоПатент.Область("R8C30").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 4, 1);
	
	Для Н = 1 По СтрДлина(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачиСокращенно) Цикл
		Если Н <= 27 Тогда 
			ОбластьТелоПатент.Область("R4C" + Строка(Н + 8)).Текст = ВРег(Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачиСокращенно, Н, 1));
		Иначе
			ОбластьТелоПатент.Область("R6C" + Строка(Н - 26)).Текст = ВРег(Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачиСокращенно, Н, 1));
		КонецЕсли;
	КонецЦикла;

	ТабличныйДокумент.Вывести(ОбластьТелоПатент);
	
	ОбластьТелоЧасть25 = Макет.ПолучитьОбласть("ОбластьТелоЧасть25");   
	Для Н = 1 По СтрДлина(Строка(Должность)) Цикл
		ОбластьТелоЧасть25.Область("R12C" + Строка(Н + 1)).Текст = ВРег(Сред(Строка(Должность), Н, 1));
	КонецЦикла;

	//ВЫВОДИМ ПО ТИПАМ РЕЗИДЕНТСВА
	Если СсылкаНаСотрудника.ФизическоеЛицо.ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.ВНЖ Тогда
		
		СтрокаВывода = "ВИД НА ЖИТЕЛЬСТВО СЕРИЯ " + СсылкаНаСотрудника.ФизическоеЛицо.ВНЖСерия + "№" + СсылкаНаСотрудника.ФизическоеЛицо.ВНЖНомер
		+ "ВЫДАНО " + ВРег(СсылкаНаСотрудника.ФизическоеЛицо.ВНЖКемВыдан) + ", " + Формат(СсылкаНаСотрудника.ФизическоеЛицо.ВНЖДата, "ДФ=dd.MM.yyyy");

		Для Н = 1 По СтрДлина(СтрокаВывода) Цикл
			НомерСтрокиВывода = Цел((Н - 1) / 34) + 1;
			НомерКолонкиВывода = Н - 34 * (НомерСтрокиВывода - 1) - Смещение;
			Если Сред(НаименованиеПолное, Н, 1) = " " И НомерКолонкиВывода = 1 Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			ОбластьТелоЧастьОдин.Область("R" + Строка(5 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(СтрокаВывода, Н, 1);
		КонецЦикла;
		
	ИначеЕсли СсылкаНаСотрудника.ФизическоеЛицо.ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.РВП Тогда

		СтрокаВывода = "РАЗРЕШЕНИЕ НА ВРЕМЕННОЕ ПРОЖИВАНИЕ №" + СсылкаНаСотрудника.ФизическоеЛицо.РВПНомер
		+ ",ВЫДАНО " + ВРег(СсылкаНаСотрудника.ФизическоеЛицо.РВПКемВыдан) + "," + Формат(СсылкаНаСотрудника.ФизическоеЛицо.РВПДата, "ДФ=dd.MM.yyyy");

		Для Н = 1 По СтрДлина(СтрокаВывода) Цикл
			НомерСтрокиВывода = Цел((Н - 1) / 34) + 1;
			НомерКолонкиВывода = Н - 34 * (НомерСтрокиВывода - 1) - Смещение;
			Если Сред(НаименованиеПолное, Н, 1) = " " И НомерКолонкиВывода = 1 Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			ОбластьТелоЧастьОдин.Область("R" + Строка(5 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(СтрокаВывода, Н, 1);
		КонецЦикла;
		
	ИначеЕсли СсылкаНаСотрудника.ФизическоеЛицо.ИИТ_ТипРезиденства = Перечисления.ИИТ_ТипыРезиденства.ЕАЭС Тогда 
		
		СтрокаВывода = "ДОГОВОР О ПРИСОЕДИНЕНИИ КЫРГЫЗСКОЙРЕСПУБЛИКИ ОТ 23.12.2014 К ДОГОВО-РУ ЕАЭС ОТ 29.05.2014 СТ.97 П.1";

		Для Н = 1 По СтрДлина(СтрокаВывода) Цикл
			НомерСтрокиВывода = Цел((Н - 1) / 34) + 1;
			НомерКолонкиВывода = Н - 34 * (НомерСтрокиВывода - 1) - Смещение;
			Если Сред(НаименованиеПолное, Н, 1) = " " И НомерКолонкиВывода = 1 Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			ОбластьТелоЧастьОдин.Область("R" + Строка(5 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(СтрокаВывода, Н, 1);
		КонецЦикла;		
		
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьТелоЧасть25);
	
	ОбластьТелоЧасть28 = Макет.ПолучитьОбласть("ОбластьТелоЧасть28");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемНаРаботу.ДатаПриема КАК ДатаПриема
	                      |ИЗ
	                      |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	                      |ГДЕ
	                      |	ПриемНаРаботу.Сотрудник.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаПриема_ = Выборка.ДатаПриема;
		ДатаПриема = Формат(Выборка.ДатаПриема, "ДЛФ=D");
		ДатаБезТочек = СтрЗаменить(ДатаПриема, ".", "");
		ДатаДень = Лев(ДатаБезТочек, 2);
		ДатаМесяц = Сред(ДатаБезТочек, 3, 2);
		ДатаГод = Прав(ДатаБезТочек, 4); 
		ОбластьТелоЧасть28.Область("R7C" + 22).Текст = Лев(ДатаДень,1);
		ОбластьТелоЧасть28.Область("R7C" + 23).Текст = Прав(ДатаДень,1);
		ОбластьТелоЧасть28.Область("R7C" + 25).Текст = Лев(ДатаМесяц,1);
		ОбластьТелоЧасть28.Область("R7C" + 26).Текст = Прав(ДатаМесяц,1);
		ОбластьТелоЧасть28.Область("R7C" + 28).Текст = Лев(ДатаГод,1);
		ОбластьТелоЧасть28.Область("R7C" + 29).Текст = Сред(ДатаГод,2,1);
		ОбластьТелоЧасть28.Область("R7C" + 30).Текст = Сред(ДатаГод,3,1);
		ОбластьТелоЧасть28.Область("R7C" + 31).Текст = Прав(ДатаГод,1);
	Иначе
		ДатаПриема_ = Дата(1,1,1);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		НаименованиеПолное = ВРег(ОбъектСтроительства.ИИТ_АдресОсуществленияТрудовойДеятельности);
		Для Н = 1 По СтрДлина(НаименованиеПолное) Цикл
			НомерСтрокиВывода = Цел((Н - 1) / 34) + 1;
			НомерКолонкиВывода = Н - 34 * (НомерСтрокиВывода - 1);
			ОбластьТелоЧасть28.Область("R" + Строка(11 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(НаименованиеПолное, Н, 1);
		КонецЦикла;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть28);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьТелоЧасть30 = Макет.ПолучитьОбласть("ОбластьТелоЧасть30"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть30);
	
	ОбластьТелоИПВнизу = Макет.ПолучитьОбласть("ОбластьТелоИПВнизу");  
	ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег(ИИТ_ВспомогательныеФункцииСервер.ДолжностьРуководителя(СсылкаНаСотрудника) + " " + 
											ИИТ_ВспомогательныеФункцииСервер.ФИОРуководителя(СсылкаНаСотрудника));

	Если СтрДлина(Организация.ИНН) = 12 Тогда
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег("Индивидуальный предприниматель");
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизуФИО = ВРег(Организация.ИндивидуальныйПредприниматель);
	Иначе
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег("Общество с ограниченной ответственностью");
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизуФИО = ВРег(СокрЛП(СтрЗаменить(Строка(Организация), "ООО", "")));		
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьТелоИПВнизу);
	
	ОбластьТелоЧасть31 = Макет.ПолучитьОбласть("ОбластьТелоЧасть31"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть31);
	
	ОбластьТелоДатаПодвал = Макет.ПолучитьОбласть("ОбластьТелоДатаПодвал");
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда

		ДатаВыдачи = Формат(ДатаПриема_, "ДЛФ=ДД");
		ДатаБезТочек = СтрРазделить(ДатаВыдачи, " ");
		ДатаДень = ДатаБезТочек[0];
		ДатаМесяц = ДатаБезТочек[1];
		ДатаГод = ДатаБезТочек[2];
		ОбластьТелоДатаПодвал.Область("R1C" + 3).Текст = ДатаДень;
		ОбластьТелоДатаПодвал.Область("R1C" + 6).Текст = ВРег(ДатаМесяц);
		ОбластьТелоДатаПодвал.Область("R1C" + 14).Текст = Прав(СокрЛП(СтрЗаменить(ДатаГод, "г.", "")), 2);
		ОбластьТелоДатаПодвал.Параметры.НомерДоверенности = ОбъектСтроительства.ИИТ_НомерДоверенности;
		
		ДатаВыдачи = Формат(ОбъектСтроительства.ИИТ_ДатаДоверенности, "ДЛФ=ДД");
		ДатаБезТочек = СтрРазделить(ДатаВыдачи, " ");
		ДатаДень = ДатаБезТочек[0];
		ДатаМесяц = ДатаБезТочек[1];
		ДатаГод = ДатаБезТочек[2];
		ОбластьТелоДатаПодвал.Область("R3C" + 21).Текст = ДатаДень;
		ОбластьТелоДатаПодвал.Область("R3C" + 24).Текст = ВРег(ДатаМесяц);
		ОбластьТелоДатаПодвал.Область("R3C" + 29).Текст = Прав(СокрЛП(СтрЗаменить(ДатаГод, "г.", "")), 2);
		ОбластьТелоДатаПодвал.Параметры.НомерДоверенности = ОбъектСтроительства.ИИТ_НомерДоверенности;

	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоДатаПодвал);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ДокументыФизическихЛиц.Физлицо.ФИО КАК ФизлицоФИО
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	ТекущийСотрудникПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос.УстановитьПараметр("Физлицо", ?(ЗначениеЗаполнено(ОбъектСтроительства) И ЗначениеЗаполнено(ОбъектСтроительства.ИИТ_ПредоставляющийУведомление), 
										ОбъектСтроительства.ИИТ_ПредоставляющийУведомление.ФизическоеЛицо, ТекущийСотрудникПользователь.ФизическоеЛицо));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(ОбъектСтроительства) И ЗначениеЗаполнено(ОбъектСтроительства.ИИТ_ПредоставляющийУведомление) Тогда
		
		ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДФ='dd MMMM yyyy ''г.'''");
		ДатаБезТочек = СтрРазделить(ДатаВыдачи, " ");
		ДатаДень = ДатаБезТочек[0];
		ДатаМесяц = ДатаБезТочек[1];
		ДатаГод = ДатаБезТочек[2]; 
		
		ОбластьТелоПользовательФИО = Макет.ПолучитьОбласть("ОбластьТелоПользовательФИО");  
			ОбластьТелоПользовательФИО.Область("R1C17").Текст = ВРег(Выборка.ФизлицоФИО);
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательФИО);

		ОбластьТелоПользовательСерияНомерДата = Макет.ПолучитьОбласть("ОбластьТелоПользовательСерияНомерДата"); 
			ОбластьТелоПользовательСерияНомерДата.Область("R1C5").Текст = Выборка.Серия;
			ОбластьТелоПользовательСерияНомерДата.Область("R1C12").Текст = Выборка.Номер;
			ОбластьТелоПользовательСерияНомерДата.Область("R1C" + 22).Текст = ДатаДень;
			ОбластьТелоПользовательСерияНомерДата.Область("R1C" + 25).Текст = ВРег(ДатаМесяц);
			ОбластьТелоПользовательСерияНомерДата.Область("R1C" + 33).Текст = СокрЛП(СтрЗаменить(ДатаГод, "г.", ""));
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательСерияНомерДата);

		ОбластьТелоПользовательКемВыдан = Макет.ПолучитьОбласть("ОбластьТелоПользовательКемВыдан"); 
		ОбластьТелоПользовательКемВыдан.Область("R1C" + 7).Текст = ВРег(Выборка.КемВыдан);
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательКемВыдан);
			
	Иначе  
		
		ОбластьТелоПользовательФИО = Макет.ПолучитьОбласть("ОбластьТелоПользовательФИО");  
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательФИО);
		
		ОбластьТелоПользовательСерияНомерДата = Макет.ПолучитьОбласть("ОбластьТелоПользовательСерияНомерДата"); 
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательСерияНомерДата);
		
		ОбластьТелоПользовательКемВыдан = Макет.ПолучитьОбласть("ОбластьТелоПользовательКемВыдан"); 
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательКемВыдан);
		
	КонецЕсли;
	
	ОбластьТелоЧасть34 = Макет.ПолучитьОбласть("ОбластьТелоЧасть34");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть34);
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ТрудовойДоговор(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт
	
	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ТрудовойДоговор");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СсылкаНаСотрудника.Наименование);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьТело.Параметры.ТипПаспорта = Выборка.ВидДокумента;
		ОбластьТело.Параметры.СерияНомер = "" + Выборка.Серия + Выборка.Номер;
	    ОбластьТело.Параметры.ВыданДата = Формат(Выборка.ДатаВыдачи, "ДЛФ=D");
		ОбластьТело.Параметры.ВыданКем = Выборка.КемВыдан;
        ОбластьТело.Параметры.АдресРегистрации = Выборка.Представление;
	КонецЕсли;
	
	ОбластьТело.Параметры.АдресРегистрации = СсылкаНаСотрудника.ФизическоеЛицо.РегистрацияМесто;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
	Иначе
		Организация = "";
	КонецЕсли;
	ОбластьТело.Параметры.Организация = Организация.НаименованиеПолное;
	ОбластьТело.Параметры.ОГРН = Организация.ОГРН;
	ОбластьТело.Параметры.ДатаРегистрации = Формат(Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	ОбластьТело.Параметры.ФИОСотрудника2 = ТРег(СсылкаНаСотрудника.Наименование);
	ОбластьТело.Параметры.ыйая = ?(СтрДлина(Организация.ИНН) = 12, "ый", "ая");
	
	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	Если МассивФИО.Количество() >= 2 Тогда
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
	Иначе
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
	КонецЕсли;

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемНаРаботу.Ссылка КАК Ссылка,
	                      |	ТабНачисление.Размер КАК Размер,
	                      |	ПриемНаРаботу.НомерПриказа КАК Номер,
	                      |	ПриемНаРаботу.Должность.Наименование КАК ДолжностьНаименование,
	                      |	ПриемНаРаботу.Подразделение.Наименование КАК ПодразделениеНаименование,
	                      |	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
	                      |	ПриемНаРаботу.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Начисления КАК ТабНачисление
	                      |		ПО (ТабНачисление.Ссылка = ПриемНаРаботу.Ссылка)
	                      |ГДЕ
	                      |	ПриемНаРаботу.Сотрудник = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Оклад = Выборка.Ссылка.ИИТ_ОфициальныйОклад;
		ОбластьТело.Параметры.Оклад = "" + Оклад + " (" + ЧислоПрописью(Оклад) + "копеек)";
		ОбластьТело.Параметры.НомерТД = Выборка.Номер;
		ОбластьТело.Параметры.Должность = Выборка.ДолжностьНаименование;
		ОбластьТело.Параметры.УсловиеПриема = "Основное место работы, полная занятость, " + Выборка.Ссылка.УсловияПриема;
		//ОбластьТело.Параметры.Подразделение = Выборка.ПодразделениеНаименование;
		//ОбластьТело.Параметры.Срок = ?(ЗначениеЗаполнено(Выборка.ДлительностьИспытательногоСрока), Выборка.ДлительностьИспытательногоСрока, "________");
		ДатаДокумента = Выборка.Дата;	
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	ОбластьТело.Параметры.ДатаДень = ДатаБезВремени[0];
	ОбластьТело.Параметры.ДатаМесяц = ДатаБезВремени[1];
	ОбластьТело.Параметры.ДатаГод = ДатаБезВремени[2];
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	
	//Данные по ДМС
	ЗаполнитьЗначенияСвойств(ОбластьТело.Параметры, СсылкаНаСотрудника.ФизическоеЛицо, , "ДатаРегистрации");
	ОбластьТело.Параметры.ДатаНачалаДМС = Формат(СсылкаНаСотрудника.ФизическоеЛицо.ДатаНачалаДМС, "ДФ=dd.MM.yyyy");
	ОбластьТело.Параметры.ДатаОкончанияДМС = Формат(СсылкаНаСотрудника.ФизическоеЛицо.ДатаОкончанияДМС, "ДФ=dd.MM.yyyy");
	КонтрагентДСМ = СсылкаНаСотрудника.ФизическоеЛицо.ОрганизацияДМС;
	Если ЗначениеЗаполнено(КонтрагентДСМ) Тогда 
		ОбластьТело.Параметры.ИННОрганизацииДСМ = КонтрагентДСМ.ИНН;
		НайденныеСтроки = КонтрагентДСМ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьТело.Параметры.АдресДМС = НайденныеСтроки[0].Представление;
		КонецЕсли;
	КонецЕсли;
	
	//Данные по патенту
	ОбластьТело.Параметры.ПатентДатаВыдачи = Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd.MM.yyyy");
	
	//Заполняем нижнюю часть по организации	
	ОбластьТело.Параметры.Организация2 = Организация.НаименованиеПолное;
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ОбластьТело.Параметры.ОрганизацияАдрес = "Адрес " + НайденныеСтроки[0].Представление;
	Иначе
		ОбластьТело.Параметры.ОрганизацияАдрес = "Адрес ";
	КонецЕсли;	 
	ОбластьТело.Параметры.ОрганизацияОГРН = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
	ОбластьТело.Параметры.ОрганизацияИНН = Организация.ИНН;
	ОбластьТело.Параметры.ОрганизацияРСч = Организация.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьТело.Параметры.ОрганизацияКоррРСч = Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьТело.Параметры.ОрганизацияБИК = Организация.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьТело.Параметры.ОрганизацияБанк = Организация.ОсновнойБанковскийСчет.Банк.Наименование;
	
	ОбластьТело.Параметры.Город = "Москва";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	РегистрСведений.ИИТ_ПринадлежностьСотрудниковКОбъектам.СрезПоследних(, Сотрудник = &Сотрудник) КАК ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбъектСтроительства = Выборка.ОбъектСтроительства;
	Иначе
		ОбъектСтроительства = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		ОбластьТело.Параметры.АдресРабочегоМеста = ОбъектСтроительства.ИИТ_АдресОсуществленияТрудовойДеятельности;
		ОбластьТело.Параметры.ОрганПредоставленияКопииДокумента = ОбъектСтроительства.ИИТ_ОрганПредоставленияКопииДокумента;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ЗаявлениеПринятияНаРаботу(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ЗаявлениеПринятияНаРаботу");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	ОбластьТело.Параметры.ДатаДень = ДатаБезВремени[0];
	ОбластьТело.Параметры.ДатаМесяц = ДатаБезВремени[1];
	ОбластьТело.Параметры.ДатаГод = ДатаБезВремени[2];
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_Отпуск(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_Отпуск");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		//ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ОтпускОчередной(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ОтпускОчередной");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		//ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_Перевод(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_Перевод");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		//ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ЗаявлениеНаУвольнение(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ЗаявлениеНаУвольнение");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		//ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ЗаявлениеНаУдержание(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ЗаявлениеНаУдержание");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		//ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ЗаявлениеНДФЛ(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ЗаявлениеНДФЛ");
	
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");	

	ДатаДокумента = ТекущаяДата();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Дата,
	                      |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьНаименование
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних");
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		//ОбластьТело.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьНаименование, 2)); 
		ДатаДокумента = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	
	ОбластьТело.Параметры.ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_СправкаУвольнение(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_СправкаУвольнение");
	
	ОбластьВерхнийКолонтитул = Макет.ПолучитьОбласть("ВерхнийКолонтитул");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьТело = Макет.ПолучитьОбласть("ОбластьТело");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ТабличныйДокумент.Вывести(ОбластьВерхнийКолонтитул);	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.СтранаВыдачи КАК СтранаВыдачи
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, Физлицо = &ФизЛицо) КАК ДокументыФизическихЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтранаРегистрации = Строка(Выборка.СтранаВыдачи);
	Иначе
		СтранаРегистрации = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//ОрганизацияСтр = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Организация.НаименованиеПолное, 3);
		ОрганизацияСтр = Выборка.Организация.НаименованиеПолное;
	Иначе
		ОрганизацияСтр = "";
	КонецЕсли;
	
	ОбластьТело.Параметры.Организация = ОрганизацияСтр;
	ОбластьТело.Параметры.Сотрудник = ТРег(СсылкаНаСотрудника.Наименование) + ", " + ТРег(СтранаРегистрации);
	
	ТабличныйДокумент.Вывести(ОбластьТело);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	РегистрСведений.ИИТ_ПринадлежностьСотрудниковКОбъектам.СрезПоследних(, Сотрудник = &Сотрудник) КАК ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьПодвал.Параметры.Инспектор = Выборка.ОбъектСтроительства.ИИТ_ДолжностноеЛицоМВД;
	Иначе
		ОбластьПодвал.Параметры.Инспектор = "";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_Согласие(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_Согласие");
	
	Область = Макет.ПолучитьОбласть("Область");
	ФИОПолучателя = ИИТ_ВспомогательныеФункцииСервер.ФИОПолучателяДляПечатныхФорм(СсылкаНаСотрудника);
	ФИОПолучателя = СтрЗаменить(ФИОПолучателя, "Ооо", "ООО");
	Область.Параметры.ФИОПолучателя = ФИОПолучателя;
	Область.Параметры.СотрудникРП = ТРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.Наименование, 2));
	Область.Параметры.АдресРегистрации = СсылкаНаСотрудника.ФизическоеЛицо.РегистрацияМесто;
	Область.Параметры.Сотрудник = ТРег(СсылкаНаСотрудника.Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область.Параметры.Дата = Формат(Выборка.Ссылка.Дата, "ДФ='dd MMMM yyyy ''г.'''");
	КонецЕсли;

	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	Если МассивФИО.Количество() Тогда
		ФамилияСотрудника = МассивФИО[0];
		МассивФИО.Удалить(0); 
		Инициалы = "";
		Пока МассивФИО.Количество() Цикл 
			Инициалы = Инициалы + "" + Лев(МассивФИО[0],1) + ".";
			МассивФИО.Удалить(0);
		КонецЦикла;
		Область.Параметры.ФИОСотрудникаСокр = ТРег(ФамилияСотрудника) + " " + Инициалы;
	Иначе
		Область.Параметры.ФИОСотрудникаСокр = ТРег(СсылкаНаСотрудника.Наименование);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.СтранаВыдачи КАК СтранаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, Физлицо = &ФизЛицо) КАК ДокументыФизическихЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область.Параметры.Паспорт = Выборка.Серия + " " + Выборка.Номер;
		Область.Параметры.КемВыдан = Выборка.КемВыдан;
		Область.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДФ='dd MMMM yyyy'");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Организация = Выборка.Организация;
		ОрганизацияСтр = СтрЗаменить(СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Организация.НаименованиеПолное, 3), "епес", "епесу");

		Область.Параметры.Организация = ОрганизацияСтр;
		НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Область.Параметры.ОрганизацияАдрес = НайденныеСтроки[0].Представление;
		КонецЕсли;	 
		Область.Параметры.ОГРН = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
		Область.Параметры.ИНН = Организация.ИНН;

	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Область);
	//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//ТабличныйДокумент.Вывести(Область1);
	//ТабличныйДокумент.Область("R16").ВысотаСтроки = ТабличныйДокумент.Область("R16").ВысотаСтроки + 30;
	//ТабличныйДокумент.Область("R17").ВысотаСтроки = ТабличныйДокумент.Область("R16").ВысотаСтроки + 30;
	//ТабличныйДокумент.Область("R18").ВысотаСтроки = ТабличныйДокумент.Область("R16").ВысотаСтроки + 30;
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.ПолеСлева = 10;
	ТабличныйДокумент.ПолеСправа = 10;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ДСДМС(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ДСДМС");
	
	ОбластьТело = Макет.ПолучитьОбласть("Область");	
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СсылкаНаСотрудника.Наименование);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьТело.Параметры.ТипПаспорта = Выборка.ВидДокумента;
		ОбластьТело.Параметры.СерияНомер = "" + Выборка.Серия + Выборка.Номер;
	    ОбластьТело.Параметры.ВыданДата = Формат(Выборка.ДатаВыдачи, "ДЛФ=D");
		ОбластьТело.Параметры.ВыданКем = Выборка.КемВыдан;
        ОбластьТело.Параметры.АдресРегистрации = Выборка.Представление;
	КонецЕсли;
	
	ОбластьТело.Параметры.АдресРегистрации = СсылкаНаСотрудника.ФизическоеЛицо.РегистрацияМесто;
	
	ОбластьТело.Параметры.Город = "Москва";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		ОбластьТело.Параметры.Организация = Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ОГРН = Организация.ОГРН;
		ОбластьТело.Параметры.ДатаРегистрации = Формат(Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		ОбластьТело.Параметры.ыйая = ?(СтрДлина(Организация.ИНН) = 12, "ый", "ая");
	Иначе
		Организация = "";
	КонецЕсли;
	ОбластьТело.Параметры.ФИОСотрудника2 = ТРег(СсылкаНаСотрудника.Наименование);
	
	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	Если МассивФИО.Количество() >= 2 Тогда
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
		ОбластьТело.Параметры.ФИОСотрудникаСокр2 = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
	Иначе
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
		ОбластьТело.Параметры.ФИОСотрудникаСокр2 = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
	КонецЕсли;

	ДатаДокумента = ТекущаяДата();
	//ОбластьТело.Параметры.ТекДата = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	ДатаТрудовогоДоговора = Дата(1,1,1);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемНаРаботу.Ссылка КАК Ссылка,
	                      |	ТабНачисление.Размер КАК Размер,
	                      |	ПриемНаРаботу.НомерПриказа КАК Номер,
	                      |	ПриемНаРаботу.Должность.Наименование КАК ДолжностьНаименование,
	                      |	ПриемНаРаботу.Подразделение.Наименование КАК ПодразделениеНаименование,
	                      |	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
	                      |	ПриемНаРаботу.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Начисления КАК ТабНачисление
	                      |		ПО (ТабНачисление.Ссылка = ПриемНаРаботу.Ссылка)
	                      |ГДЕ
	                      |	ПриемНаРаботу.Сотрудник = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ОбластьТело.Параметры.НомерТрудовогоДоговора2 = Выборка.Номер;
		ОбластьТело.Параметры.ДатаТрудовогоДогвоора2 = Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьТело.Параметры.НомерТрудовогоДоговора = Выборка.Номер;
		ОбластьТело.Параметры.ДатаТрудовогоДоговора = Формат(Выборка.Дата, "ДЛФ=D");
		ОбластьТело.Параметры.ДатаТрудовогоДоговора3 = Формат(Выборка.Дата, "ДЛФ=ДД");
		ДатаТрудовогоДоговора = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаТрудовогоДоговора, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	ОбластьТело.Параметры.ДатаДень = ДатаБезВремени[0];
	ОбластьТело.Параметры.ДатаМесяц = ДатаБезВремени[1];
	ОбластьТело.Параметры.ДатаГод = ДатаБезВремени[2];
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	
	//Данные по ДМС
	ЗаполнитьЗначенияСвойств(ОбластьТело.Параметры, СсылкаНаСотрудника.ФизическоеЛицо, , "ДатаРегистрации");
	ОбластьТело.Параметры.ДатаНачалаДМС = Формат(СсылкаНаСотрудника.ФизическоеЛицо.ДатаНачалаДМС, "ДФ=dd.MM.yyyy");
	ОбластьТело.Параметры.ДатаОкончанияДМС = Формат(СсылкаНаСотрудника.ФизическоеЛицо.ДатаОкончанияДМС, "ДФ=dd.MM.yyyy");
	КонтрагентДСМ = СсылкаНаСотрудника.ФизическоеЛицо.ОрганизацияДМС;
	Если ЗначениеЗаполнено(КонтрагентДСМ) Тогда 
		ОбластьТело.Параметры.ОрганизацияДМС = ВРег(Строка(КонтрагентДСМ));
		ОбластьТело.Параметры.ИННОрганизацияДМС = КонтрагентДСМ.ИНН;
		НайденныеСтроки = КонтрагентДСМ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьТело.Параметры.АдресДМС = НайденныеСтроки[0].Представление;
		КонецЕсли;
	КонецЕсли;
	
	//Заполняем нижнюю часть по организации	
	ОбластьТело.Параметры.Организация2 = Организация.НаименованиеПолное;
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ОбластьТело.Параметры.ОрганизацияАдрес = НайденныеСтроки[0].Представление;
	КонецЕсли;	 
	ОбластьТело.Параметры.ОрганизацияОГРН = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
	ОбластьТело.Параметры.ОрганизацияИНН = Организация.ИНН;
	ОбластьТело.Параметры.ОрганизацияРСч = Организация.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьТело.Параметры.ОрганизацияКоррРСч = Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьТело.Параметры.ОрганизацияБИК = Организация.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьТело.Параметры.ОрганизацияБанк = Организация.ОсновнойБанковскийСчет.Банк.Наименование; 	
	
	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ДСПатент(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ДСПатент");
	
	ОбластьТело = Макет.ПолучитьОбласть("Область");	
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СсылкаНаСотрудника.Наименование);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьТело.Параметры.ТипПаспорта = Выборка.ВидДокумента;
		ОбластьТело.Параметры.СерияНомер = "" + Выборка.Серия + Выборка.Номер;
	    ОбластьТело.Параметры.ВыданДата = Формат(Выборка.ДатаВыдачи, "ДЛФ=D");
		ОбластьТело.Параметры.ВыданКем = Выборка.КемВыдан;
        ОбластьТело.Параметры.АдресРегистрации = Выборка.Представление;
	КонецЕсли;
	
	ОбластьТело.Параметры.АдресРегистрации = СсылкаНаСотрудника.ФизическоеЛицо.РегистрацияМесто;
	
	ОбластьТело.Параметры.Город = "Москва";
	
	ДатаТрудовогоДоговора = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		ОбластьТело.Параметры.Организация = Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ОГРН = Организация.ОГРН;
		ОбластьТело.Параметры.ДатаРегистрации = Формат(Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		ОбластьТело.Параметры.ыйая = ?(СтрДлина(Организация.ИНН) = 12, "ый", "ая");
	Иначе
		Организация = "";
	КонецЕсли;
	ОбластьТело.Параметры.ФИОСотрудника2 = ТРег(СсылкаНаСотрудника.Наименование);
	
	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	Если МассивФИО.Количество() >= 2 Тогда
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
		ОбластьТело.Параметры.ФИОСотрудникаСокр2 = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
	Иначе
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
		ОбластьТело.Параметры.ФИОСотрудникаСокр2 = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
	КонецЕсли;

	ДатаДокумента = ТекущаяДата();
	//ОбластьТело.Параметры.ТекДата = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемНаРаботу.Ссылка КАК Ссылка,
	                      |	ТабНачисление.Размер КАК Размер,
	                      |	ПриемНаРаботу.НомерПриказа КАК Номер,
	                      |	ПриемНаРаботу.Должность.Наименование КАК ДолжностьНаименование,
	                      |	ПриемНаРаботу.Подразделение.Наименование КАК ПодразделениеНаименование,
	                      |	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
	                      |	ПриемНаРаботу.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Начисления КАК ТабНачисление
	                      |		ПО (ТабНачисление.Ссылка = ПриемНаРаботу.Ссылка)
	                      |ГДЕ
	                      |	ПриемНаРаботу.Сотрудник = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ОбластьТело.Параметры.НомерТрудовогоДоговора2 = Выборка.Номер;
		ОбластьТело.Параметры.ДатаТрудовогоДогвоора2 = Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьТело.Параметры.НомерТрудовогоДоговора = Выборка.Номер;
		ОбластьТело.Параметры.ДатаТрудовогоДоговора = Формат(Выборка.Дата, "ДЛФ=D");
		ОбластьТело.Параметры.ДатаТрудовогоДоговора3 = Формат(Выборка.Дата, "ДЛФ=ДД");
		ДатаТрудовогоДоговора = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаТрудовогоДоговора, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	ОбластьТело.Параметры.ДатаДень = ДатаБезВремени[0];
	ОбластьТело.Параметры.ДатаМесяц = ДатаБезВремени[1];
	ОбластьТело.Параметры.ДатаГод = ДатаБезВремени[2];
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	
	//Данные по патенту
	ОбластьТело.Параметры.ПатентДатаВыдачи = Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd.MM.yyyy");
	ОбластьТело.Параметры.ПатентОрганВыдачи = СклонениеПредставленийОбъектов.ПросклонятьПредставление(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачи, 5);
	ОбластьТело.Параметры.ПатентСерия = СсылкаНаСотрудника.ФизическоеЛицо.ПатентСерия;
	ОбластьТело.Параметры.ПатентНомер = СсылкаНаСотрудника.ФизическоеЛицо.ПатентНомер;
	
	//Заполняем нижнюю часть по организации	
	ОбластьТело.Параметры.Организация2 = Организация.НаименованиеПолное;
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ОбластьТело.Параметры.ОрганизацияАдрес = НайденныеСтроки[0].Представление;
	КонецЕсли;	 
	ОбластьТело.Параметры.ОрганизацияОГРН = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
	ОбластьТело.Параметры.ОрганизацияИНН = Организация.ИНН;
	ОбластьТело.Параметры.ОрганизацияРСч = Организация.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьТело.Параметры.ОрганизацияКоррРСч = Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьТело.Параметры.ОрганизацияБИК = Организация.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьТело.Параметры.ОрганизацияБанк = Организация.ОсновнойБанковскийСчет.Банк.Наименование; 	
	
	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ДСМРОТ(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_ДСМРОТ");
	
	ОбластьТело = Макет.ПолучитьОбласть("Область");	
	ОбластьТело.Параметры.ФИОСотрудника = ТРег(СсылкаНаСотрудника.Наименование);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьТело.Параметры.ТипПаспорта = Выборка.ВидДокумента;
		ОбластьТело.Параметры.СерияНомер = "" + Выборка.Серия + Выборка.Номер;
	    ОбластьТело.Параметры.ВыданДата = Формат(Выборка.ДатаВыдачи, "ДЛФ=D");
		ОбластьТело.Параметры.ВыданКем = Выборка.КемВыдан;
        ОбластьТело.Параметры.АдресРегистрации = Выборка.Представление;
	КонецЕсли;
	
	ОбластьТело.Параметры.АдресРегистрации = СсылкаНаСотрудника.ФизическоеЛицо.РегистрацияМесто;
	
	ОбластьТело.Параметры.Город = "Москва";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		ОбластьТело.Параметры.Организация = Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ОГРН = Организация.ОГРН;
		ОбластьТело.Параметры.ДатаРегистрации = Формат(Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		ОбластьТело.Параметры.ыйая = ?(СтрДлина(Организация.ИНН) = 12, "ый", "ая");
	Иначе
		Организация = "";
	КонецЕсли;
	ОбластьТело.Параметры.ФИОСотрудника2 = ТРег(СсылкаНаСотрудника.Наименование);
	
	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	Если МассивФИО.Количество() >= 2 Тогда
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
		ОбластьТело.Параметры.ФИОСотрудникаСокр2 = ТРег(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
	Иначе
		ОбластьТело.Параметры.ФИОСотрудникаСокр = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
		ОбластьТело.Параметры.ФИОСотрудникаСокр2 = ТРег(ОбластьТело.Параметры.ФИОСотрудника);
	КонецЕсли;

	ДатаДокумента = ТекущаяДата();
	//ОбластьТело.Параметры.ТекДата = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		
	ДатаТрудовогоДоговора = Дата(1,1,1);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемНаРаботу.Ссылка КАК Ссылка,
	                      |	ТабНачисление.Размер КАК Размер,
	                      |	ПриемНаРаботу.НомерПриказа КАК Номер,
	                      |	ПриемНаРаботу.Должность.Наименование КАК ДолжностьНаименование,
	                      |	ПриемНаРаботу.Подразделение.Наименование КАК ПодразделениеНаименование,
	                      |	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
	                      |	ПриемНаРаботу.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Начисления КАК ТабНачисление
	                      |		ПО (ТабНачисление.Ссылка = ПриемНаРаботу.Ссылка)
	                      |ГДЕ
	                      |	ПриемНаРаботу.Сотрудник = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ОбластьТело.Параметры.НомерТрудовогоДоговора2 = Выборка.Номер;
		ОбластьТело.Параметры.ДатаТрудовогоДогвоора2 = Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьТело.Параметры.НомерТрудовогоДоговора = Выборка.Номер;
		ОбластьТело.Параметры.ДатаТрудовогоДоговора = Формат(Выборка.Дата, "ДЛФ=D");
		ОбластьТело.Параметры.ДатаТрудовогоДоговора3 = Формат(Выборка.Дата, "ДЛФ=ДД");
		ДатаТрудовогоДоговора = Выборка.Дата;
	КонецЕсли;
	
	ДатаБезВремени = СтрРазделить(СтрЗаменить(Формат(ДатаТрудовогоДоговора, "ДЛФ=ДД"), "г.", ""), " ");
	//ОбластьТело.Параметры.ДатаПолная = СтрЗаменить(Формат(ДатаДокумента, "ДЛФ=ДД"), "г.", "");
	ОбластьТело.Параметры.ДатаДень = ДатаБезВремени[0];
	ОбластьТело.Параметры.ДатаМесяц = ДатаБезВремени[1];
	ОбластьТело.Параметры.ДатаГод = ДатаБезВремени[2];
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка,
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ВидДокумента,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	 Справочник.ФизическиеЛица КАК ФизическиеЛица					 
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация	
						  |		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |		ПО (ДокументыФизическихЛиц.Физлицо = ФизическиеЛица.Ссылка)					  						  					  
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка
	                      |	И НЕ ФизическиеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	
	//Заполняем нижнюю часть по организации	
	ОбластьТело.Параметры.Организация2 = Организация.НаименованиеПолное;
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ОбластьТело.Параметры.ОрганизацияАдрес = НайденныеСтроки[0].Представление;
	КонецЕсли;	 
	ОбластьТело.Параметры.ОрганизацияОГРН = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
	ОбластьТело.Параметры.ОрганизацияИНН = Организация.ИНН;
	ОбластьТело.Параметры.ОрганизацияРСч = Организация.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьТело.Параметры.ОрганизацияКоррРСч = Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьТело.Параметры.ОрганизацияБИК = Организация.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьТело.Параметры.ОрганизацияБанк = Организация.ОсновнойБанковскийСчет.Банк.Наименование; 	
	
	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_ПриемНаРаботу(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Сотрудник = &Сотрудник
	|	И ПриемНаРаботу.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриемНаРаботу.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДокПриемСсылка = Выборка.Ссылка;
		
		ПараметрыПечати	= Новый Структура;
		ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);

		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ДокПриемСсылка);
		ОбъектыПечати = Новый СписокЗначений();
		ОбъектыПечати.ЗагрузитьЗначения(МассивОбъектов);
		
		//Формируем дерево значений для данных ссылок
		ДанныеСсылок = Новый ДеревоЗначений;
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъект");
		ДанныеСсылок.Колонки.Добавить("РаботаОрганизацияНаименованиеСокращенное");
		ДанныеСсылок.Колонки.Добавить("РаботаОрганизацияКодПоОКПО");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектДата");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектНомерНаПечать");
		ДанныеСсылок.Колонки.Добавить("ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже");
		ДанныеСсылок.Колонки.Добавить("РаботаСотрудникТабельныйНомерНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаПодразделениеНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаДатаПриема");
		ДанныеСсылок.Колонки.Добавить("РаботаДолжность");
		ДанныеСсылок.Колонки.Добавить("РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаУсловияПриема");
		ДанныеСсылок.Колонки.Добавить("РаботаСотрудник");
		ДанныеСсылок.Колонки.Добавить("РаботаТрудовойДоговорДатаОформленияНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаТрудовойДоговорНомер");
		ДанныеСсылок.Колонки.Добавить("РаботаДлительностьИспытательногоСрока");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектДолжностьРуководителя");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектРуководительРасшифровкаПодписи");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектДатаОзнакомленияРаботника");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриемНаРаботу.Ссылка КАК СсылкаНаОбъект,
			|	ПриемНаРаботу.Организация.НаименованиеСокращенное КАК РаботаОрганизацияНаименованиеСокращенное,
			|	ПриемНаРаботу.Организация.КодПоОКПО КАК РаботаОрганизацияКодПоОКПО,
			|	ПриемНаРаботу.Дата КАК СсылкаНаОбъектДата,
			|	ПриемНаРаботу.Номер КАК СсылкаНаОбъектНомер,
			|	ПриемНаРаботу.НомерПриказа КАК СсылкаНаОбъектНомерПриказа,
			|	ПриемНаРаботу.Сотрудник.Код КАК РаботаСотрудникКод,
			|	ПриемНаРаботу.ДатаПриема КАК РаботаДатаПриема,
			|	ПриемНаРаботу.УсловияПриема КАК РаботаУсловияПриема,
			|	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК РаботаДлительностьИспытательногоСрока,
			|	ПриемНаРаботу.Сотрудник КАК РаботаСотрудник,
			|	ПриемНаРаботу.ДолжностьРуководителя КАК СсылкаНаОбъектДолжностьРуководителя,
			|	ПриемНаРаботу.Руководитель КАК СсылкаНаОбъектРуководитель,
			|	ПриемНаРаботу.Дата КАК Дата,
			|	ПриемНаРаботу.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТДанныеДокументов
			|ИЗ
			|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
			|ГДЕ
			|	ПриемНаРаботу.Проведен
			|	И ПриемНаРаботу.Ссылка В(&МассивОбъектов)";
		
		Запрос.Выполнить();
		
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц,
			"ВТДанныеДокументов", "РаботаСотрудник,РаботаДатаПриема");
		
		ОписательВременныхТаблиц.ИмяВТКадровыеДанныеСотрудников = "ВТКадровыеДанныеСотрудниковДляТ1Т8";
		
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
			ОписательВременныхТаблиц,
			Истина,
			"ФИОПолные,Пол,Подразделение,Должность");
		
		ИменаПолейОтветственныхЛиц = Новый Массив;
		ИменаПолейОтветственныхЛиц.Добавить("СсылкаНаОбъектРуководитель");
		
		ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Ложь, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДанныеДокументов.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	ДанныеДокументов.РаботаОрганизацияНаименованиеСокращенное КАК РаботаОрганизацияНаименованиеСокращенное,
			|	ДанныеДокументов.РаботаОрганизацияКодПоОКПО КАК РаботаОрганизацияКодПоОКПО,
			|	ДанныеДокументов.СсылкаНаОбъектДата КАК СсылкаНаОбъектДата,
			|	ДанныеДокументов.СсылкаНаОбъектНомер КАК СсылкаНаОбъектНомер,
			|	ДанныеДокументов.СсылкаНаОбъектНомерПриказа КАК СсылкаНаОбъектНомерПриказа,
			|	КадровыеДанныеСотрудников.ФИОПолные КАК ЛичныеДанныеФИОПолные,
			|	КадровыеДанныеСотрудников.Пол КАК ЛичныеДанныеПол,
			|	ДанныеДокументов.РаботаСотрудникКод КАК РаботаСотрудникКод,
			|	КадровыеДанныеСотрудников.Подразделение КАК РаботаПодразделение,
			|	ДанныеДокументов.РаботаДатаПриема КАК РаботаДатаПриема,
			|	КадровыеДанныеСотрудников.Должность КАК РаботаДолжность,
			|	ДанныеДокументов.РаботаУсловияПриема КАК РаботаУсловияПриема,
			|	ДанныеДокументов.РаботаСотрудник КАК РаботаСотрудник,
			|	ДанныеДокументов.РаботаДлительностьИспытательногоСрока КАК РаботаДлительностьИспытательногоСрока,
			|	ДанныеДокументов.СсылкаНаОбъектДолжностьРуководителя КАК СсылкаНаОбъектДолжностьРуководителя,
			|	ФИООтветственныхЛиц.РасшифровкаПодписи КАК СсылкаНаОбъектРуководительРасшифровкаПодписи
			|ИЗ
			|	ВТДанныеДокументов КАК ДанныеДокументов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудниковДляТ1Т8 КАК КадровыеДанныеСотрудников
			|		ПО ДанныеДокументов.РаботаСотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И ДанныеДокументов.РаботаДатаПриема = КадровыеДанныеСотрудников.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственныхЛиц
			|		ПО ДанныеДокументов.СсылкаНаОбъектРуководитель = ФИООтветственныхЛиц.ФизическоеЛицо
			|			И ДанныеДокументов.Ссылка = ФИООтветственныхЛиц.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	СсылкаНаОбъект";		
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.СледующийПоЗначениюПоля("СсылкаНаОбъект") Цикл
				
				СтрокаСсылки = ДанныеСсылок.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСсылки, Выборка);
				
				СтрокаСсылки.СсылкаНаОбъектНомерНаПечать = ЗарплатаКадрыОтчеты.НомерНаПечать(Выборка.СсылкаНаОбъектНомер, Выборка.СсылкаНаОбъектНомерПриказа);
				
				СтрокаСсылки.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже =
					ТРег(ЗарплатаКадрыОтчеты.ПросклоненныеФИО(Выборка.ЛичныеДанныеФИОПолные, 1, Выборка.ЛичныеДанныеПол));
				
				//СтрокаСсылки.РаботаСотрудникТабельныйНомерНаПечать = ЗарплатаКадрыОтчеты.ТабельныйНомерНаПечать(Выборка.РаботаСотрудникКод);
				СтрокаСсылки.РаботаПодразделениеНаПечать = "Основное подразделение";
				
				СтрокаСсылки.РаботаТрудовойДоговорДатаОформленияНаПечать = Формат(ДокПриемСсылка.Дата, "ДФ='dd MMMM yyyy'");
				СтрокаСсылки.РаботаТрудовойДоговорНомер = ДокПриемСсылка.НомерПриказа;
				
				СтрокаСсылки.СсылкаНаОбъектДолжностьРуководителя = ИИТ_ВспомогательныеФункцииСервер.ДолжностьРуководителя(СсылкаНаСотрудника);
				СтрокаСсылки.СсылкаНаОбъектРуководительРасшифровкаПодписи = ИИТ_ВспомогательныеФункцииСервер.ФИОРуководителя(СсылкаНаСотрудника);
				Если СтрДлина(Выборка.СсылкаНаОбъект.Организация.ИНН) = 12 Тогда
					СтрокаСсылки.СсылкаНаОбъектДолжностьРуководителя = "Индивидуальный предприниматель";
					СтрокаСсылки.СсылкаНаОбъектРуководительРасшифровкаПодписи = Выборка.СсылкаНаОбъект.Организация.ФамилияИП + " " + Выборка.СсылкаНаОбъект.Организация.ИмяИП;
				КонецЕсли;
				
				СтрокаСсылки.СсылкаНаОбъектДатаОзнакомленияРаботника = ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью(СтрокаСсылки.СсылкаНаОбъектДата); 
				
				СтрокаСсылки.РаботаОрганизацияКодПоОКПО = Выборка.СсылкаНаОбъект.Организация.КодПоОКПО;
				//СтрокаСсылки.РаботаДолжность = Строка(ДокПриемСсылка.Должность) + ", " + Строка(ДокПриемСсылка.ВидЗанятости);
				СтрокаСсылки.РаботаДолжность = Строка(ДокПриемСсылка.Должность);
				СтрокаСсылки.РаботаУсловияПриема = Строка(ДокПриемСсылка.ВидЗанятости) + ", " + Строка(ДокПриемСсылка.УсловияПриема);
				СтрокаСсылки.РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать = Строка(ДокПриемСсылка.ИИТ_ОфициальныйОклад) + " руб. 00 коп.";
				СтрокаСсылки.РаботаДатаПриема = Выборка.СсылкаНаОбъектДата;
				
				Пока Выборка.Следующий() Цикл
					
					СтрокаСотрудника = СтрокаСсылки.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСотрудника, СтрокаСсылки);
					
				КонецЦикла;
				
			КонецЦикла;
	
			КадровыйУчет.ВывестиНаПечатьТ1(ПараметрыПечати, ТабличныйДокумент, ДанныеСсылок.Строки,
				УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Т1"), , ОбъектыПечати);

	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_Увольнение(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_Увольнение");	
	ОбластьТело = Макет.ПолучитьОбласть("Область");	

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	КадроваяИсторияСотрудниковСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьТело.Параметры.РаботаОрганизацияНаименованиеСокращенное = Выборка.Организация.НаименованиеСокращенное;
		ОбластьТело.Параметры.РаботаОрганизацияКодПоОКПО = Выборка.Организация.КодПоОКПО;
		ОбластьТело.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = ТРег(Строка(СсылкаНаСотрудника));
		ОбластьТело.Параметры.РаботаПодразделениеНаПечать = "Основное подразделение";
		ОбластьТело.Параметры.РаботаДолжность = Строка(Выборка.Должность);
		ОбластьТело.Параметры.РаботаСтатьяТКРФНаПечать = "Расторжение трудового договора по инициативе работника, п. 3 ч. 1 ст. 77 Трудового кодекса Российской Федерации";
		ОбластьТело.Параметры.РаботаОснованиеУвольнения = "Заявление работника";
		
		ОбластьТело.Параметры.СсылкаНаОбъектДолжностьРуководителя = ИИТ_ВспомогательныеФункцииСервер.ДолжностьРуководителя(СсылкаНаСотрудника);
		ОбластьТело.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи = ИИТ_ВспомогательныеФункцииСервер.ФИОРуководителя(СсылкаНаСотрудника);
		Если СтрДлина(Выборка.Организация.ИНН) = 12 Тогда
			ОбластьТело.Параметры.СсылкаНаОбъектДолжностьРуководителя = "Индивидуальный предприниматель";
			ОбластьТело.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи = Выборка.Организация.ФамилияИП + " " + Выборка.Организация.ИмяИП;
		КонецЕсли;

		ОбластьТело.Параметры.РаботаТрудовойДоговорДатаОформленияНаПечать = Формат(Выборка.Регистратор.Дата, "ДФ='dd MMMM yyyy'");
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПриемНаРаботу") ИЛИ
		ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.КадровыйПеревод") ИЛИ
		ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.Увольнение") Тогда
			ОбластьТело.Параметры.РаботаТрудовойДоговорНомер = Выборка.Регистратор.НомерПриказа;
			ОбластьТело.Параметры.РаботаДатаУвольненияНаПечать = """____"" __________ 20___ г.";
			ОбластьТело.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника = """____"" __________ 20___ г.";
		КонецЕсли;
	Иначе
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьТело);
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.АвтоМасштаб = Истина;	

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ИИТ_УведомлениеОПрекращенииТрудовогоДоговора(ТабличныйДокумент, СсылкаНаСотрудника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	РегистрСведений.ИИТ_ПринадлежностьСотрудниковКОбъектам.СрезПоследних(, Сотрудник = &Сотрудник) КАК ИИТ_ПринадлежностьСотрудниковКОбъектамСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбъектСтроительства = Выборка.ОбъектСтроительства;
	Иначе
		ОбъектСтроительства = Неопределено;
	КонецЕсли;

	Макет = Справочники.Сотрудники.ПолучитьМакет("ИИТ_УведомлениеОПрекращенииТрудовогоДоговора");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		Должность = Выборка.Должность;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
		Должность = Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
	ОбластьТелоЧастьОдин = Макет.ПолучитьОбласть("ОбластьТелоЧастьОдин");
	Если СтрДлина(Организация.ИНН) = 12 Тогда
		ОбластьТелоЧастьОдин.Параметры.ИП = "X";
	Иначе
		ОбластьТелоЧастьОдин.Параметры.ЮЛ = "X";
	КонецЕсли;	

	//СЛОЖНЫЙ ВЫВОД ПО СЛОВАМ ---------->
	НаименованиеПолное = ВРег(Организация.НаименованиеПолное);
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НаименованиеПолное);
	
	ПозицияСимвола = 1;
	НомерКолонкиВывода = 1;

	Для Каждого СловоПредставления Из МассивСлов Цикл
		
		Пока СтрДлина(СловоПредставления) + НомерКолонкиВывода > 34 Цикл
			ПозицияСимвола = ПозицияСимвола + 1;
			НомерСтрокиВывода = Цел((ПозицияСимвола - 1) / 34) + 1;
			НомерКолонкиВывода = ПозицияСимвола - 34 * (НомерСтрокиВывода - 1);
			Продолжить;
		КонецЦикла;
		
		Для Н = 1 По СтрДлина(СловоПредставления) Цикл			
			НомерСтрокиВывода = Цел((ПозицияСимвола - 1) / 34) + 1;
			НомерКолонкиВывода = ПозицияСимвола - 34 * (НомерСтрокиВывода - 1);
			ОбластьТелоЧастьОдин.Область("R" + Строка(29 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(СловоПредставления, Н, 1);
			ПозицияСимвола = ПозицияСимвола + 1;
		КонецЦикла;		

		ПозицияСимвола = ПозицияСимвола + 1;

	КонецЦикла;
	//<----------СЛОЖНЫЙ ВЫВОД ПО СЛОВАМ
	
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		Смещение = 0;
		НаименованиеПолное = ВРег(ОбъектСтроительства.ИИТ_МестоПредоставленияУведомления);
		Для Н = 1 По СтрДлина(НаименованиеПолное) Цикл
			НомерСтрокиВывода = Цел((Н - 1) / 34) + 1;
			НомерКолонкиВывода = Н - 34 * (НомерСтрокиВывода - 1) - Смещение;
			Если Сред(НаименованиеПолное, Н, 1) = " " И НомерКолонкиВывода = 1 Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			ОбластьТелоЧастьОдин.Область("R" + Строка(8 + (НомерСтрокиВывода - 1) * 2) + "C" + Строка(НомерКолонкиВывода + 1)).Текст = Сред(НаименованиеПолное, Н, 1);
		КонецЦикла;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьТелоЧастьОдин);

	ОбластьТелоЧастьЧетыре = Макет.ПолучитьОбласть("ОбластьТело41");
	ОГРНВывод = ?(СтрДлина(Организация.ИНН) = 12, "ОГРНИП " + Организация.ОГРН, "ОГРН " + Организация.ОГРН);
	Для Н = 1 По СтрДлина(ОГРНВывод) Цикл
		ОбластьТелоЧастьЧетыре.Область("R6C" + Строка(Н + 1)).Текст = Сред(ОГРНВывод, Н, 1);
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьТелоЧастьЧетыре);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьТелоЧастьЧетыре = Макет.ПолучитьОбласть("ОбластьТело42");
	СтрокаИНН = "ИНН " + Организация.ИНН;
	Для Н = 1 По СтрДлина(СтрокаИНН) Цикл
		ОбластьТелоЧастьЧетыре.Область("R6C" + Строка(Н + 1)).Текст = Сред(СтрокаИНН, Н, 1);
	КонецЦикла;

	//Вывод адреса организации
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Если НайденныеСтроки.Количество() > 0 Тогда

		АдресВывод = ВРег(НайденныеСтроки[0].Представление);
		МассивСтрок = Новый Массив;
		ТекНачалоСтроки = 1;
		Смещение = 0;
		Пока ТекНачалоСтроки <= СтрДлина(АдресВывод) Цикл
			Если Сред(АдресВывод, ТекНачалоСтроки + Смещение, 1) = " "  Тогда
				Смещение = Смещение + 1;
			КонецЕсли;
			МассивСтрок.Добавить(СокрЛП(Сред(АдресВывод, ТекНачалоСтроки + Смещение, 34)));
			ТекНачалоСтроки = ТекНачалоСтроки + 34;
		КонецЦикла;
		
		Для Н = 0 По МассивСтрок.Количество() - 1 Цикл
			Для К = 1 По СтрДлина(МассивСтрок[Н]) Цикл
				ОбластьТелоЧастьЧетыре.Область("R" + Строка(8 + Н * 2) + "C" + Строка(К + 1)).Текст = Сред(МассивСтрок[Н], К, 1);
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
	//Вывод телефона организации
	НайденныеСтроки = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТелефонВывод = СтрЗаменить(НайденныеСтроки[0].Представление, "-", "");
		Для Н = 1 По СтрДлина(ТелефонВывод) Цикл
			ОбластьТелоЧастьЧетыре.Область("R14C" + Строка(10 + Н)).Текст = Сред(ТелефонВывод, Н, 1);
		КонецЦикла;
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьТелоЧастьЧетыре);	

	// Занесение данных по сотруднику 
	МассивФИО = СтрРазделить(СсылкаНаСотрудника.Наименование, " ");
	
	ОбластьТелоСотрудникФамилия = Макет.ПолучитьОбласть("ОбластьТелоСотрудникФамилия");
	Если МассивФИО.Количество() > 0 Тогда
		ФамилияСотрудника = Новый Массив; 
		Для НомерСимвола = 1 По СтрДлина(МассивФИО[0]) Цикл
			СтрЛев = Лев(МассивФИО[0], НомерСимвола);
			СтрПрав = Прав(СтрЛев, 1);
			ФамилияСотрудника.Добавить(СтрПрав);
		КонецЦикла;
		
		С = 7;
		Для каждого Буква Из ФамилияСотрудника Цикл		
			//Для н = с По 34 Цикл
				ОбластьТелоСотрудникФамилия.Область("R2C" + (С + 1)).Текст = ВРег(Буква);
			//КонецЦикла; 
			С = С + 1
		КонецЦикла;
		МассивФИО.Удалить(0);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникФамилия);

	ОбластьТелоЧасть5 = Макет.ПолучитьОбласть("ОбластьТелоЧасть5");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть5);

	ОбластьТелоСотрудникИмя = Макет.ПолучитьОбласть("ОбластьТелоСотрудникИмя"); 
	Если МассивФИО.Количество() > 0 Тогда 
		ИмяСотрудника = Новый Массив; 
		Для НомерСимвола = 1 По СтрДлина(МассивФИО[0]) Цикл
			СтрЛев = Лев(МассивФИО[0], НомерСимвола);
			СтрПрав = Прав(СтрЛев, 1);
			ИмяСотрудника.Добавить(СтрПрав);
		КонецЦикла;
		С = 7;
		Для каждого Буква Из ИмяСотрудника Цикл		
			//Для н = с По 34 Цикл
				ОбластьТелоСотрудникИмя.Область("R1C" + (С + 1)).Текст = ВРег(Буква);
			//КонецЦикла; 
			С = С + 1
		КонецЦикла;
		МассивФИО.Удалить(0);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникИмя);
	
	//ОбластьТелоЧасть6 = Макет.ПолучитьОбласть("ОбластьТелоЧасть6"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть6);
	
	ОбластьТелоСотрудникОтчество = Макет.ПолучитьОбласть("ОбластьТелоСотрудникОтчество"); 
	Если МассивФИО.Количество() > 0 Тогда  
		С = 7;
		Для каждого ОтчествоСотрудника Из МассивФИО Цикл 
			Отчество = Новый Массив; 
			Для НомерСимвола = 1 По СтрДлина(ОтчествоСотрудника) Цикл
				СтрЛев = Лев(ОтчествоСотрудника, НомерСимвола);
				СтрПрав = Прав(СтрЛев, 1);
				Отчество.Добавить(СтрПрав);
			КонецЦикла;
			Для каждого Буква Из Отчество Цикл		
				//Для н = с По 34 Цикл
					ОбластьТелоСотрудникОтчество.Область("R2C" + (С + 1)).Текст = ВРег(Буква);
				//КонецЦикла; 
				С = С + 1
			КонецЦикла;
			ОбластьТелоСотрудникОтчество.Область("R2C" + (С + 1)).Текст = " ";  // исправил с 1 на 2
			С = С + 1
		КонецЦикла;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникОтчество);
	
	//ОбластьТелоЧасть7 = Макет.ПолучитьОбласть("ОбластьТелоЧасть7");
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть7);
	
	ОбластьТелоСотрудникГражданство = Макет.ПолучитьОбласть("ОбластьТелоСотрудникГражданство");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ГражданствоФизическихЛиц.Страна.Наименование КАК СтранаНаименование
	                      |ИЗ
	                      |	РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизическихЛиц
	                      |ГДЕ
	                      |	ГражданствоФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо");
	Запрос.УстановитьПараметр("ФизическоеЛицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерКолонки = 8;
		Для н = 1 По СтрДлина(Выборка.СтранаНаименование) Цикл
			ЧастьСтроки = Лев(Выборка.СтранаНаименование, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникГражданство.Область("R1C" + (НомерКолонки + 1)).Текст = ПоследнийСимвол;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;			
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникГражданство);
	
	ОбластьТелоЧасть8 = Макет.ПолучитьОбласть("ОбластьТелоЧасть8");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть8);
	
	ОбластьТелоСотрудникМестоРожденияОдин = Макет.ПолучитьОбласть("ОбластьТелоСотрудникМестоРожденияОдин"); 
	СтранаВывод = Строка(СсылкаНаСотрудника.ФизическоеЛицо.СтранаРождения) + ",";
	Для Н = 1 По СтрДлина(СтранаВывод) Цикл
		ОбластьТелоСотрудникМестоРожденияОдин.Область("R1C" + Строка(Н + 11)).Текст = Сред(СтранаВывод, Н, 1);
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникМестоРожденияОдин);
	
	ОбластьТелоСотрудникМестоРожденияДва = Макет.ПолучитьОбласть("ОбластьТелоСотрудникМестоРожденияДва");
	ОбластьВывод = Строка(СсылкаНаСотрудника.ФизическоеЛицо.ОбластьРождения);
	Для Н = 1 По СтрДлина(ОбластьВывод) Цикл
		ОбластьТелоСотрудникМестоРожденияДва.Область("R1C" + Строка(Н + 1)).Текст = ВРег(Сред(ОбластьВывод, Н, 1));
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникМестоРожденияДва);
	
	ОбластьТелоЧасть10 = Макет.ПолучитьОбласть("ОбластьТелоЧасть10");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть10);
	
	ОбластьТелоСотрудникДатаРождения = Макет.ПолучитьОбласть("ОбластьТелоСотрудникДатаРождения"); 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.ДатаРождения КАК ДатаРождения
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаРождения = Формат(Выборка.ДатаРождения, "ДЛФ=D");
		ДатаБезТочек = СтрЗаменить(ДатаРождения, ".", "");
		ДатаДень = Лев(ДатаБезТочек, 2);
		ДатаМесяц = Сред(ДатаБезТочек, 3, 2);
		ДатаГод = Прав(ДатаБезТочек, 4); 
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 11).Текст = Лев(ДатаДень,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 12).Текст = Прав(ДатаДень,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 14).Текст = Лев(ДатаМесяц,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 15).Текст = Прав(ДатаМесяц,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 17).Текст = Лев(ДатаГод,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 18).Текст = Сред(ДатаГод,2,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 19).Текст = Сред(ДатаГод,3,1);
		ОбластьТелоСотрудникДатаРождения.Область("R1C" + 20).Текст = Прав(ДатаГод,1);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникДатаРождения);
	
	ОбластьТелоЧасть11 = Макет.ПолучитьОбласть("ОбластьТелоЧасть11");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть11);
	
	//ОбластьТелоЧасть12 = Макет.ПолучитьОбласть("ОбластьТелоЧасть12");
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть12);
	
	ОбластьТелоСотрудникПаспорт = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспорт");
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспорт);          
	
	//ОбластьТелоЧасть13 = Макет.ПолучитьОбласть("ОбластьТелоЧасть13"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть13);
	
	ОбластьТелоЧасть14 = Макет.ПолучитьОбласть("ОбластьТелоЧасть14");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть14);
	
	ОбластьТелоСотрудникПаспортСерияНомерДата = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортСерияНомерДата");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	Запрос.УстановитьПараметр("Физлицо", СсылкаНаСотрудника.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Серия
		НомерКолонки = 4;
		Для н = 1 По СтрДлина(Выборка.Серия) Цикл
			ЧастьСтроки = Лев(Выборка.Серия, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + (НомерКолонки + 1)).Текст = ПоследнийСимвол;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;	
		
		// Номер
		НомерКолонки = 12;
		Для н = 1 По СтрДлина(Выборка.Номер) Цикл
			ЧастьСтроки = Лев(Выборка.Номер, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + (НомерКолонки + 1)).Текст = ПоследнийСимвол;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;	
		
		// Дата выдачи
		ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДЛФ=D");
		ДатаБезТочек = СтрЗаменить(ДатаВыдачи, ".", "");
		ДатаДень = Лев(ДатаБезТочек, 2);
		ДатаМесяц = Сред(ДатаБезТочек, 3, 2);
		ДатаГод = Прав(ДатаБезТочек, 4); 
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 26).Текст = Лев(ДатаДень,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 27).Текст = Прав(ДатаДень,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 29).Текст = Лев(ДатаМесяц,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 30).Текст = Прав(ДатаМесяц,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 32).Текст = Лев(ДатаГод,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 33).Текст = Сред(ДатаГод,2,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 34).Текст = Сред(ДатаГод,3,1);
		ОбластьТелоСотрудникПаспортСерияНомерДата.Область("R1C" + 35).Текст = Прав(ДатаГод,1);
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортСерияНомерДата);
	
	//ОбластьТелоЧасть15 = Макет.ПолучитьОбласть("ОбластьТелоЧасть15"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть15);
	
	ОбластьТелоЧасть16 = Макет.ПолучитьОбласть("ОбластьТелоЧасть16");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть16);
	
	ОбластьТелоСотрудникПаспортКемВыданОдин = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортКемВыданОдин");
    ПереходНаСледСтроку = Ложь;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	Запрос.УстановитьПараметр("Физлицо", СсылкаНаСотрудника.ФизическоеЛицо);
	ВыборкаКемВыдан = Запрос.Выполнить().Выбрать();
	Если ВыборкаКемВыдан.Следующий() Тогда
		НомерКолонки = 7;
		ДлинаСтроки = 34;
		Для н = 1 По СтрДлина(ВыборкаКемВыдан.КемВыдан) Цикл
			ЧастьСтроки = Лев(ВыборкаКемВыдан.КемВыдан, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортКемВыданОдин.Область("R1C" + (НомерКолонки + 1)).Текст = ВРег(ПоследнийСимвол);
			НомерКолонки = НомерКолонки + 1;
			Если НомерКолонки > ДлинаСтроки Тогда
				НовыйНомерСтроки = н + 1;
				ПереходНаСледСтроку = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;		
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортКемВыданОдин);
	
	ОбластьТелоЧасть17 = Макет.ПолучитьОбласть("ОбластьТелоЧасть17");   
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть17);
	
	ОбластьТелоСотрудникПаспортКемВыданДва = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортКемВыданДва");
	Если ПереходНаСледСтроку = Истина Тогда
	 	ПереходНаСледСтроку = Ложь;	
		НомерКолонки = 7;
		ДлинаСтроки = 34;
		Для н = НовыйНомерСтроки По СтрДлина(ВыборкаКемВыдан.КемВыдан) Цикл
			ЧастьСтроки = Лев(ВыборкаКемВыдан.КемВыдан, н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортКемВыданДва.Область("R1C" + (НомерКолонки + 1)).Текст = ВРег(ПоследнийСимвол);
			НомерКолонки = НомерКолонки + 1;
			Если НомерКолонки > ДлинаСтроки Тогда
				НовыйНомерСтроки = Н + 1;
				ПереходНаСледСтроку = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортКемВыданДва);
	
	ОбластьТелоЧасть18 = Макет.ПолучитьОбласть("ОбластьТелоЧасть18");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть18);
	
	ОбластьТелоСотрудникПаспортКемВыданТри = Макет.ПолучитьОбласть("ОбластьТелоСотрудникПаспортКемВыданТри");
	Если ПереходНаСледСтроку = Истина Тогда
	 	ПереходНаСледСтроку = Ложь;	
		НомерКолонки = 14;
		ДлинаСтроки = 26;
		Для Н = НовыйНомерСтроки По СтрДлина(ВыборкаКемВыдан.КемВыдан) Цикл
			ЧастьСтроки = Лев(ВыборкаКемВыдан.КемВыдан, Н);
			ПоследнийСимвол = Прав(ЧастьСтроки, 1);		
			ОбластьТелоСотрудникПаспортКемВыданДва.Область("R1C" + (НомерКолонки + 1)).Текст = ВРег(ПоследнийСимвол);
			НомерКолонки = НомерКолонки + 1;
			Если НомерКолонки > ДлинаСтроки Тогда
				//НовыйНомерСтроки = н;
				//ПереходНаСледСтроку = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоСотрудникПаспортКемВыданТри);
	
	ОбластьТелоЧасть19 = Макет.ПолучитьОбласть("ОбластьТелоЧасть19"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть19);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	//ОбластьТелоЧасть20 = Макет.ПолучитьОбласть("ОбластьТелоЧасть20");
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть20);
	
	ОбластьТелоДокументНаименование = Макет.ПолучитьОбласть("ОбластьТелоДокументНаименование");  
	ТабличныйДокумент.Вывести(ОбластьТелоДокументНаименование);
	
	//ОбластьТелоЧасть21 = Макет.ПолучитьОбласть("ОбластьТелоЧасть21"); 
	//ТабличныйДокумент.Вывести(ОбластьТелоЧасть21);
	
	ОбластьТелоПатент = Макет.ПолучитьОбласть("ОбластьТелоПатент"); 	
	Для Н = 1 По СтрДлина(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСерия) Цикл
		ОбластьТелоПатент.Область("R1C" + Строка(Н + 4)).Текст = Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСерия, Н, 1);
	КонецЦикла;
	Для Н = 1 По СтрДлина(СсылкаНаСотрудника.ФизическоеЛицо.ПатентНомер) Цикл
		ОбластьТелоПатент.Область("R1C" + Строка(Н + 12)).Текст = Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентНомер, Н, 1);
	КонецЦикла;
	ОбластьТелоПатент.Область("R1C26").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R1C27").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R1C29").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R1C30").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R1C32").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 1, 1);
	ОбластьТелоПатент.Область("R1C33").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 2, 1);
	ОбластьТелоПатент.Область("R1C34").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 3, 1);
	ОбластьТелоПатент.Область("R1C35").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 4, 1);
	
	ОбластьТелоПатент.Область("R8C9").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C10").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C12").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C13").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C15").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 1, 1);
	ОбластьТелоПатент.Область("R8C16").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 2, 1);
	ОбластьТелоПатент.Область("R8C17").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 3, 1);
	ОбластьТелоПатент.Область("R8C18").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентДатаВыдачи, "ДФ=yyyy"), 4, 1);
	
	ОбластьТелоПатент.Область("R8C21").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C22").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=dd"), 1);
	ОбластьТелоПатент.Область("R8C24").Текст = Лев(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C25").Текст = Прав(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=MM"), 1);
	ОбластьТелоПатент.Область("R8C27").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 1, 1);
	ОбластьТелоПатент.Область("R8C28").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 2, 1);
	ОбластьТелоПатент.Область("R8C29").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 3, 1);
	ОбластьТелоПатент.Область("R8C30").Текст = Сред(Формат(СсылкаНаСотрудника.ФизическоеЛицо.ПатентСрокДействия, "ДФ=yyyy"), 4, 1);
	
	Для Н = 1 По СтрДлина(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачиСокращенно) Цикл
		Если Н <= 27 Тогда 
			ОбластьТелоПатент.Область("R4C" + Строка(Н + 8)).Текст = ВРег(Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачиСокращенно, Н, 1));
		Иначе
			ОбластьТелоПатент.Область("R6C" + Строка(Н - 26)).Текст = ВРег(Сред(СсылкаНаСотрудника.ФизическоеЛицо.ПатентОрганВыдачиСокращенно, Н, 1));
		КонецЕсли;
	КонецЦикла;

	ТабличныйДокумент.Вывести(ОбластьТелоПатент);
	
	ОбластьТелоЧасть25 = Макет.ПолучитьОбласть("ОбластьТелоЧасть25");   
	Для Н = 1 По СтрДлина(Строка(Должность)) Цикл
		ОбластьТелоЧасть25.Область("R15C" + Строка(Н + 1)).Текст = ВРег(Сред(Строка(Должность), Н, 1));
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть25);
	
	ОбластьТелоЧасть28 = Макет.ПолучитьОбласть("ОбластьТелоЧасть28");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемНаРаботу.ДатаПриема КАК ДатаПриема
	                      |ИЗ
	                      |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	                      |ГДЕ
	                      |	ПриемНаРаботу.Сотрудник.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаПриема_ = Выборка.ДатаПриема;
		ДатаПриема = Формат(Выборка.ДатаПриема, "ДЛФ=D");
		ДатаБезТочек = СтрЗаменить(ДатаПриема, ".", "");
		ДатаДень = Лев(ДатаБезТочек, 2);
		ДатаМесяц = Сред(ДатаБезТочек, 3, 2);
		ДатаГод = Прав(ДатаБезТочек, 4);
	Иначе
		ДатаПриема_ = Дата(1,1,1);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть28);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьТелоЧасть30 = Макет.ПолучитьОбласть("ОбластьТелоЧасть30"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть30);
	
	ОбластьТелоИПВнизу = Макет.ПолучитьОбласть("ОбластьТелоИПВнизу");  
	ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег(ИИТ_ВспомогательныеФункцииСервер.ДолжностьРуководителя(СсылкаНаСотрудника) + " " + 
											ИИТ_ВспомогательныеФункцииСервер.ФИОРуководителя(СсылкаНаСотрудника));

	Если СтрДлина(Организация.ИНН) = 12 Тогда
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег("Индивидуальный предприниматель");
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизуФИО = ВРег(Организация.ИндивидуальныйПредприниматель);
	Иначе
		//ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег("Общество с ограниченной ответственностью");
		//ОбластьТелоИПВнизу.Параметры.ПодписантВнизуФИО = ВРег(СокрЛП(СтрЗаменить(Строка(Организация), "ООО", "")));
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизу = ВРег("Руководитель отдела по работе с иностранными гражданами");
		ОбластьТелоИПВнизу.Параметры.ПодписантВнизуФИО = ВРег("Засядько К.И.");		
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьТелоИПВнизу);
	
	ОбластьТелоЧасть31 = Макет.ПолучитьОбласть("ОбластьТелоЧасть31"); 
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть31);
	
	ОбластьТелоДатаПодвал = Макет.ПолучитьОбласть("ОбластьТелоДатаПодвал");
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда

		ДатаВыдачи = Формат(ДатаПриема_, "ДЛФ=ДД");
		ДатаБезТочек = СтрРазделить(ДатаВыдачи, " ");
		ДатаДень = ДатаБезТочек[0];
		ДатаМесяц = ДатаБезТочек[1];
		ДатаГод = ДатаБезТочек[2];
		//ОбластьТелоДатаПодвал.Область("R1C"+2).Текст = ДатаДень;
		//ОбластьТелоДатаПодвал.Область("R1C"+5).Текст = ДатаМесяц;
		//ОбластьТелоДатаПодвал.Область("R1C"+13).Текст = Прав(СокрЛП(СтрЗаменить(ДатаГод, "г.", "")), 2);
		ОбластьТелоДатаПодвал.Параметры.НомерДоверенности = ОбъектСтроительства.ИИТ_НомерДоверенности;

		ДатаВыдачи = Формат(ОбъектСтроительства.ИИТ_ДатаДоверенности, "ДЛФ=ДД");
		ДатаБезТочек = СтрРазделить(ДатаВыдачи, " ");
		ДатаДень = ДатаБезТочек[0];
		ДатаМесяц = ДатаБезТочек[1];
		ДатаГод = ДатаБезТочек[2];
		ОбластьТелоДатаПодвал.Область("R3C" + 21).Текст = ДатаДень;
		ОбластьТелоДатаПодвал.Область("R3C" + 24).Текст = ВРег(ДатаМесяц);
		ОбластьТелоДатаПодвал.Область("R3C" + 29).Текст = Прав(СокрЛП(СтрЗаменить(ДатаГод, "г.", "")), 2);
		ОбластьТелоДатаПодвал.Параметры.НомерДоверенности = ОбъектСтроительства.ИИТ_НомерДоверенности;

	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТелоДатаПодвал);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДокументыФизическихЛиц.Серия КАК Серия,
	                      |	ДокументыФизическихЛиц.Номер КАК Номер,
	                      |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	                      |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	                      |	ДокументыФизическихЛиц.Физлицо.ФИО КАК ФизлицоФИО
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	ТекущийСотрудникПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос.УстановитьПараметр("Физлицо", ?(ЗначениеЗаполнено(ОбъектСтроительства) И ЗначениеЗаполнено(ОбъектСтроительства.ИИТ_ПредоставляющийУведомление), 
										ОбъектСтроительства.ИИТ_ПредоставляющийУведомление.ФизическоеЛицо, ТекущийСотрудникПользователь.ФизическоеЛицо));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(ОбъектСтроительства) И ЗначениеЗаполнено(ОбъектСтроительства.ИИТ_ПредоставляющийУведомление) Тогда
		
		ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДФ='dd MMMM yyyy ''г.'''");
		ДатаБезТочек = СтрРазделить(ДатаВыдачи, " ");
		ДатаДень = ДатаБезТочек[0];
		ДатаМесяц = ДатаБезТочек[1];
		ДатаГод = ДатаБезТочек[2]; 
		
		ОбластьТелоПользовательФИО = Макет.ПолучитьОбласть("ОбластьТелоПользовательФИО");  
			ОбластьТелоПользовательФИО.Область("R1C17").Текст = ВРег(Выборка.ФизлицоФИО);
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательФИО);

		ОбластьТелоПользовательСерияНомерДата = Макет.ПолучитьОбласть("ОбластьТелоПользовательСерияНомерДата"); 
			ОбластьТелоПользовательСерияНомерДата.Область("R1C5").Текст = Выборка.Серия;
			ОбластьТелоПользовательСерияНомерДата.Область("R1C12").Текст = Выборка.Номер;
			ОбластьТелоПользовательСерияНомерДата.Область("R1C" + 22).Текст = ДатаДень;
			ОбластьТелоПользовательСерияНомерДата.Область("R1C" + 25).Текст = ВРег(ДатаМесяц);
			ОбластьТелоПользовательСерияНомерДата.Область("R1C" + 33).Текст = СокрЛП(СтрЗаменить(ДатаГод, "г.", ""));
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательСерияНомерДата);

		ОбластьТелоПользовательКемВыдан = Макет.ПолучитьОбласть("ОбластьТелоПользовательКемВыдан"); 
			ОбластьТелоПользовательКемВыдан.Область("R1C" + 7).Текст = ВРег(Выборка.КемВыдан);
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательКемВыдан);
			
	Иначе  
		
		ОбластьТелоПользовательФИО = Макет.ПолучитьОбласть("ОбластьТелоПользовательФИО");  
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательФИО);
		
		ОбластьТелоПользовательСерияНомерДата = Макет.ПолучитьОбласть("ОбластьТелоПользовательСерияНомерДата"); 
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательСерияНомерДата);
		
		ОбластьТелоПользовательКемВыдан = Макет.ПолучитьОбласть("ОбластьТелоПользовательКемВыдан"); 
		ТабличныйДокумент.Вывести(ОбластьТелоПользовательКемВыдан);
		
	КонецЕсли;
	
	ОбластьТелоЧасть34 = Макет.ПолучитьОбласть("ОбластьТелоЧасть34");
	ТабличныйДокумент.Вывести(ОбластьТелоЧасть34);
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Функция ПолучитьПолныйМассивПечатныхФорм() Экспорт
	
	МассивРезультат = Новый Массив;
	МассивРезультат.Добавить("ИИТ_СправкаОПриемеУведомления");
	МассивРезультат.Добавить("ИИТ_УведомлениеОЗаключенииТрудовогоДоговора");
	МассивРезультат.Добавить("ИИТ_ТрудовойДоговор");
	МассивРезультат.Добавить("ИИТ_ЗаявлениеПринятияНаРаботу");
	МассивРезультат.Добавить("ИИТ_Отпуск");
	МассивРезультат.Добавить("ИИТ_ОтпускОчередной");
	МассивРезультат.Добавить("ИИТ_Перевод");
	МассивРезультат.Добавить("ИИТ_ЗаявлениеНаУвольнение");
	МассивРезультат.Добавить("ИИТ_ЗаявлениеНаУдержание");
	МассивРезультат.Добавить("ИИТ_ЗаявлениеНДФЛ");
	МассивРезультат.Добавить("ИИТ_СправкаУвольнение");
	МассивРезультат.Добавить("ИИТ_Согласие");
	МассивРезультат.Добавить("ИИТ_ДСДМС");
	МассивРезультат.Добавить("ИИТ_ДСПатент");
	МассивРезультат.Добавить("ИИТ_ДСМРОТ");
	МассивРезультат.Добавить("ИИТ_ПриемНаРаботу");
	МассивРезультат.Добавить("ИИТ_Увольнение");
	МассивРезультат.Добавить("ИИТ_УведомлениеОПрекращенииТрудовогоДоговора");
	Возврат МассивРезультат;

КонецФункции

#КонецОбласти    

#КонецЕсли
