
&НаСервере
Функция ПолучитьОбщийМассивПечатныхФорм()
	Возврат Справочники.Сотрудники.ПолучитьПолныйМассивПечатныхФорм();
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивПечатныхФорм = ПолучитьОбщийМассивПечатныхФорм();

	//Выводим первый документ, в котром нет узких колонок
	ТабДокОбщий = Новый ТабличныйДокумент;
	
	Для Каждого ПечатнаяФорма Из МассивПечатныхФорм Цикл
		ПечатьДокумента(ТабДокОбщий, ПараметрКоманды, ПечатнаяФорма);
		ТабДокОбщий.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;

	ТабДокОбщий.Показать();

КонецПроцедуры

&НаСервере
Процедура ПечатьДокумента(ТабДок, ПараметрКоманды, ПечатнаяФорма)
	Выполнить("Справочники.Сотрудники." + ПечатнаяФорма + "(ТабДок, ПараметрКоманды)");
КонецПроцедуры

