
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	МассивОС = ИИТ_ВспомогательныеФункцииСервер.ПолучитьМассивДоступныхПроектов();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовИИТ_АналитикаПоОбъектамСтроительства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.ИИТ_АналитикаПоОбъектамСтроительства КАК ДоговорыКонтрагентовИИТ_АналитикаПоОбъектамСтроительства
	|ГДЕ
	|	ДоговорыКонтрагентовИИТ_АналитикаПоОбъектамСтроительства.ОбъектСтроительства В ИЕРАРХИИ (&МассивОС)";
	Запрос.УстановитьПараметр("МассивОС", МассивОС);
	
	МассивДоговоров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеДоговора", МассивДоговоров);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеДоговора", РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_ПолноеЧтение") ИЛИ РольДоступна("ИИТ_ДоступныВсеДоговора"));
КонецПроцедуры
