
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)  
	
	//Команды
	КомандаФормы = Команды.Добавить("СоздатьТТН");
	КомандаФормы.Заголовок = "ТТН";
	КомандаФормы.Действие  = "СоздатьТТН"; 

	//Элементы формы   
	//Страница поступления
	ИИТ_ГрПоступления = Элементы.Добавить("ГруппаКнопкиТТН", Тип("ГруппаФормы"), Элементы.ГруппаПодменюСозданиеДокумента);
	ИИТ_ГрПоступления.Заголовок = "Сопоставление поступлений";
	ИИТ_ГрПоступления.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	КнопкаФормы = Элементы.Добавить("СоздатьТТН", Тип("КнопкаФормы"), ИИТ_ГрПоступления);
	КнопкаФормы.Заголовок = "ТТН";
	КнопкаФормы.ИмяКоманды = "СоздатьТТН";
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;  

КонецПроцедуры

&НаКлиенте
&После("ЗагрузитьСвойстваЯчеекТаблицы")
Процедура АЛФ_ЗагрузитьСвойстваЯчеекТаблицы()
	
	//+ИИТ_Аксеньюшкин
	Для Каждого СтрокаТоваров Из ТаблицаДокумента Цикл
		СтрокаТоваров.Номенклатура = СоздатьТочнуюНоменклатуру(СвойстваЯчеекТаблицы["Номенклатура_" + Строка(СтрокаТоваров.НомерСтроки)].РаспознанныйТекст);
		СтрокаТоваров.НоменклатураЭлементСоздан = Истина;
		СтрокаТоваров.Услуга = Ложь;
		СтрокаТоваров.АналитикаУчета = "41.01, 19.03";
		СтрокаТоваров.СчетЗатрат = "";
		СтрокаТоваров.СчетЗатратНУ = "";
		СтрокаТоваров.Субконто1 = "";
		СтрокаТоваров.СубконтоНУ1 = "";
	КонецЦикла;
	//-ИИТ_Аксеньюшкин
	
КонецПроцедуры

#Область Перенос_доработок

//ИИТ_Аксеньюшкин
Функция СоздатьТочнуюНоменклатуру(НаимНоменклатура)

	НомСсылка = Справочники.Номенклатура.НайтиПоНаименованию(НаимНоменклатура, Истина);

	Если Не ЗначениеЗаполнено(НомСсылка) Тогда
		НомОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		НомОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("1");
		НомОбъект.Наименование = НаимНоменклатура;
		НомОбъект.ОбменДанными.Загрузка = Истина;
		НомОбъект.Записать();
		Возврат НомОбъект.Ссылка;
	КонецЕсли;
	
	Возврат НомСсылка;

КонецФункции

//ИИТ_Аксеньюшкин
&НаСервере
Функция СоздатьТТННаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ТТН.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИИТ_ТТН КАК ИИТ_ТТН
	|ГДЕ
	|	ИИТ_ТТН.ОснованиеЗаполнения = &РаспознанныйДокумент
	|	И НЕ ИИТ_ТТН.ПометкаУдаления";
	Запрос.УстановитьПараметр("РаспознанныйДокумент", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.ИИТ_ТТН.СоздатьДокумент();
	КонецЕсли;
	
	ДокОбъект.Дата = Объект.ДатаДокумента;
	ДокОбъект.Организация = Объект.Организация;
	ДокОбъект.Контрагент = Объект.Контрагент;
	ДокОбъект.ОснованиеЗаполнения = Объект.Ссылка;
	ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокОбъект.НомерВходящегоДокумента = Объект.НомерДокумента;
	
	МассивНайденных = Объект.РеквизитыДокумента.НайтиСтроки(Новый Структура("ИмяРеквизита", "Договор"));
	Если МассивНайденных.Количество() > 0 Тогда
		ДокОбъект.ДоговорКонтрагента = МассивНайденных[0].Значение;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДокОбъект.Номер) Тогда
		ДокОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	ДокОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТоваров Из ТаблицаДокумента Цикл
		НоваяСтрока = ДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
	КонецЦикла;
	
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать();
	
	Возврат ДокОбъект.Ссылка;
	
КонецФункции

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура СоздатьТТН(Команда)
	ДокСсылка = СоздатьТТННаСервере();
	Форма = ПолучитьФорму("Документ.ИИТ_ТТН.Форма.ФормаДокумента", Новый Структура("Ключ", ДокСсылка));	
	Форма.Открыть();
КонецПроцедуры
	
#КонецОбласти