
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	//Элементы формы
	ЭлементТаблицыФормы = Элементы.Вставить("ПринятоОт", Тип("ПолеФормы"), Элементы.Список, Элементы.Ссылка);
	ЭлементТаблицыФормы.Заголовок = "МОЛ"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.ПринятоОт";

	ЭлементТаблицыФормы = Элементы.Вставить("СсылкаИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Список, Элементы.Ссылка);
	ЭлементТаблицыФормы.Заголовок = "Объект строительства"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "Список.Ссылка.ИИТ_ОбъектСтроительства";
	
КонецПроцедуры
