
&ИзменениеИКонтроль("ПриЗаписиСогласуемогоОбъекта")
Процедура АЛФ_ПриЗаписиСогласуемогоОбъекта(Источник, Отказ)
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	// Проверка полномочий для пометки на удаление согласуемого объекта.        
	Если Источник.ПометкаУдаления Тогда
		ТекСостояниеЗаявки = МодульУправленияПроцессамиУХ.ПолучитьОбщийСтатусДляСогласования(Источник.Ссылка);
		Если (ТекСостояниеЗаявки = "НаУтверждении") ИЛИ (ТекСостояниеЗаявки = "Утвержден") Тогда
			#Удаление
			ЦфоОбъекта = Источник.Ссылка;
			#КонецУдаления
			#Вставка
			ЦфоОбъекта = Источник.Организация;
			#КонецВставки
			ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ЦфоОбъекта);
			Если ЕстьСуперПользователь Тогда 
				// Снятие с согласования.
				МодульУправленияПроцессамиУХ.ОтменитьСогласование(, Источник.Ссылка);
			Иначе
				ТекстСообщения = НСтр("ru = 'У текущего пользователя недостаточно прав для отмены согласования. Отменить согласование может только пользователь с ролью Суперпользователь. Роли могут быть назначены в ""Матрице адресации"".'");
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
		Иначе
			// Нет согласования. Не требуется снимать.
		КонецЕсли;
	Иначе
		// Не изменяем данные по согласованию.
	КонецЕсли;	
КонецПроцедуры
