
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ
				|	ДокументСписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
				|	ДокументСписаниеСРасчетногоСчета.ПометкаУдаления КАК ПометкаУдаления,
				|	ДокументСписаниеСРасчетногоСчета.Номер КАК Номер,
				|	ДокументСписаниеСРасчетногоСчета.Дата КАК Дата,
				|	ДокументСписаниеСРасчетногоСчета.Проведен КАК Проведен,
				|	ДокументСписаниеСРасчетногоСчета.ВидОперации КАК ВидОперации,
				|	ДокументСписаниеСРасчетногоСчета.Организация КАК Организация,
				|	ДокументСписаниеСРасчетногоСчета.СчетОрганизации КАК СчетОрганизации,
				|	ДокументСписаниеСРасчетногоСчета.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
				|	ДокументСписаниеСРасчетногоСчета.СчетБанк КАК СчетБанк,
				|	ДокументСписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
				|	ДокументСписаниеСРасчетногоСчета.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
				|	ДокументСписаниеСРасчетногоСчета.Контрагент КАК Контрагент,
				|	ДокументСписаниеСРасчетногоСчета.СчетКонтрагента КАК СчетКонтрагента,
				|	ДокументСписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента,
				|	ДокументСписаниеСРасчетногоСчета.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
				|	ДокументСписаниеСРасчетногоСчета.СубконтоДт1 КАК СубконтоДт1,
				|	ДокументСписаниеСРасчетногоСчета.СубконтоДт2 КАК СубконтоДт2,
				|	ДокументСписаниеСРасчетногоСчета.СубконтоДт3 КАК СубконтоДт3,
				|	ДокументСписаниеСРасчетногоСчета.ПодразделениеДт КАК ПодразделениеДт,
				|	ДокументСписаниеСРасчетногоСчета.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|	ДокументСписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
				|	ДокументСписаниеСРасчетногоСчета.Ответственный КАК Ответственный,
				|	ДокументСписаниеСРасчетногоСчета.Комментарий КАК Комментарий,
				|	ДокументСписаниеСРасчетногоСчета.ДокументОснование КАК ДокументОснование,
				|	ДокументСписаниеСРасчетногоСчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
				|	ДокументСписаниеСРасчетногоСчета.ВалютаДокумента КАК ВалютаДокумента,
				|	ДокументСписаниеСРасчетногоСчета.ОтражениеВУСН КАК ОтражениеВУСН,
				|	ДокументСписаниеСРасчетногоСчета.Содержание_УСН КАК Содержание_УСН,
				|	ДокументСписаниеСРасчетногоСчета.Графа4_УСН КАК Графа4_УСН,
				|	ДокументСписаниеСРасчетногоСчета.Графа5_УСН КАК Графа5_УСН,
				|	ДокументСписаниеСРасчетногоСчета.Графа6_УСН КАК Графа6_УСН,
				|	ДокументСписаниеСРасчетногоСчета.Графа7_УСН КАК Графа7_УСН,
				|	ДокументСписаниеСРасчетногоСчета.ДоходыЕНВД_УСН КАК ДоходыЕНВД_УСН,
				|	ДокументСписаниеСРасчетногоСчета.НДС_УСН КАК НДС_УСН,
				|	ДокументСписаниеСРасчетногоСчета.РучнаяКорректировка КАК РучнаяКорректировка,
				|	ДокументСписаниеСРасчетногоСчета.НеПодтвержденоВыпискойБанка КАК НеПодтвержденоВыпискойБанка,
				|	ДокументСписаниеСРасчетногоСчета.НалоговыйПериод КАК НалоговыйПериод,
				|	ДокументСписаниеСРасчетногоСчета.ПлатежнаяВедомость КАК ПлатежнаяВедомость,
				|	ВЫБОР
				|		КОГДА ДокументСписаниеСРасчетногоСчета.РучнаяКорректировка = ИСТИНА
				|			ТОГДА ВЫБОР
				|					КОГДА ДокументСписаниеСРасчетногоСчета.ПометкаУдаления = ИСТИНА
				|						ТОГДА 10
				|					КОГДА ДокументСписаниеСРасчетногоСчета.Проведен = ЛОЖЬ
				|						ТОГДА 9
				|					ИНАЧЕ 8
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ДокументСписаниеСРасчетногоСчета.ПометкаУдаления = ИСТИНА
				|					ТОГДА 2
				|				КОГДА ДокументСписаниеСРасчетногоСчета.Проведен = ИСТИНА
				|					ТОГДА 1
				|				ИНАЧЕ 0
				|			КОНЕЦ
				|	КОНЕЦ КАК СостояниеДокумента,
				|	ВЫБОР
				|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
				|			ТОГДА 1
				|		КОГДА НаличиеФайлов.ЕстьФайлы
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК ЕстьФайлы,
				|	ДокументСписаниеСРасчетногоСчета.ИИТ_ОбъектСтроительства КАК ИИТ_ОбъектСтроительства,
				|	ДокументСписаниеСРасчетногоСчета.ИИТ_ЭтапСтроительства КАК ИИТ_ЭтапСтроительства
				|ИЗ
				|	Документ.СписаниеСРасчетногоСчета КАК ДокументСписаниеСРасчетногоСчета
				|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
				|		ПО ДокументСписаниеСРасчетногоСчета.Ссылка = НаличиеФайлов.ОбъектСФайлами}";					
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Документ.СписаниеСРасчетногоСчета";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);  
		
   //Поля ТЧ
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Объект строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ОбъектСтроительства";
	
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ЭтапСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Этап строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ЭтапСтроительства";

КонецПроцедуры
