
&Вместо("ПередЗаписью")
Процедура АЛФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ИИТ_НоменклатураСтрокой = "";
	Для Каждого СтрокаТоваров Из Товары Цикл
		ИИТ_НоменклатураСтрокой = ИИТ_НоменклатураСтрокой + ?(ЗначениеЗаполнено(ИИТ_НоменклатураСтрокой), ", ", "") + Строка(СтрокаТоваров.Номенклатура) +
		?(ЗначениеЗаполнено(СтрокаТоваров.Конфигурация), " " + Строка(СтрокаТоваров.Конфигурация), "") +
		?(ЗначениеЗаполнено(СтрокаТоваров.Цвет), " " + Строка(СтрокаТоваров.Цвет), "") +
		?(ЗначениеЗаполнено(СтрокаТоваров.Размер), " " + Строка(СтрокаТоваров.Размер), "");
	КонецЦикла;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ИИТ_ОтмененныйЗаказ = Ложь;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Ссылка) И Ссылка.Проведен И Не Проведен Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ИИТ_ЗаявкаНаЗакупТовары.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ИИТ_ЗаявкаНаЗакуп.Товары КАК ИИТ_ЗаявкаНаЗакупТовары
	//	|ГДЕ
	//	|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику1 = &ЗаказПоставщику";
	//	Запрос.УстановитьПараметр("ЗаказПоставщику", Ссылка);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОБъект();
	//		Для Каждого СтрокаТоваров Из ЗаявкаОбъект.Товары Цикл
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//КонецЕсли;
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура АЛФ_ОбработкаПроведения(Отказ, РежимПроведения) 
	 
	НаборЗаписей2 = РегистрыСведений.АС_ДвижениеМатериалов2_6.СоздатьНаборЗаписей();
	НаборЗаписей2.Отбор.ДокументРегистратор.Установить(Ссылка);
	НаборЗаписей2.Прочитать(); 
	НаборЗаписей2.Очистить();
	
	Для Каждого СтрокаТоваров Из Товары Цикл		
		
		Характеристика = ИИТ_ВспомогательныеФункцииСервер.ПолучитьХарактеристикуНоменклатуры_ПВД(СтрокаТоваров);
		
		СтрЗапись = НаборЗаписей2.Добавить();
		
		СтрЗапись.НоменклатураСнабжения		    = СтрокаТоваров.Номенклатура;
		СтрЗапись.ХарактеристикаНоменклатуры  	= Характеристика;
		СтрЗапись.НомерСтрокиТЧ 				= СтрокаТоваров.НомерСтроки;
		СтрЗапись.ДокументРегистратор 			= Ссылка;
		СтрЗапись.КоличествоЗаказПоставщику 	= СтрокаТоваров.Количество; 
		СтрЗапись.СуммаСНДСЗаказПоставщику 		= СтрокаТоваров.СуммаСНДС; 
		СтрЗапись.СуммаНДСЗаказПоставщику      	= СтрокаТоваров.СуммаНДС;
		СтрЗапись.ЕдИзмЗаказПоставщику 			= СтрокаТоваров.ЕдиницаИзмерения; 
		СтрЗапись.КоэффЗаказПоставщику 			= 1;   
		СтрЗапись.ЕдиницаИзмерения              = СтрЗапись.ЕдИзмЗаказПоставщику;
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ИИТ_ЗаявкаНаЗакуп) Тогда			
			Структура = Новый Структура;			
			Структура.Вставить("ЗаявкаНаЗакуп"	, СтрокаТоваров.ИИТ_ЗаявкаНаЗакуп);
			Структура.Вставить("Характеристика"	, Характеристика);
			Структура.Вставить("Номенклатура"	, СтрокаТоваров.Номенклатура);
			
			Структура = ПолучитьКоличествоЗаявкаНаЗакуп(Структура);
			
			Если  Структура.ЕдИзмЗаявкаНаЗакуп <> СтрЗапись.ЕдИзмЗаказПоставщику Тогда
				Если Не Структура.КоличествоЗаявкаНаЗакуп = 0 Тогда 
					СтрЗапись.КоэффЗаказПоставщику = СтрЗапись.КоличествоЗаказПоставщику/Структура.КоличествоЗаявкаНаЗакуп;
					СтрЗапись.КоличествоЗаказПоставщику 	= СтрокаТоваров.Количество/СтрЗапись.КоэффЗаказПоставщику; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		СтрЗапись.СуммаБезНДСЗаказПоставщику 	= СтрокаТоваров.Сумма;
		СтрЗапись.СтавкаНДСЗаказПоставщику		= СтрокаТоваров.СтавкаНДС;
		СтрЗапись.Комментарий 					= СтрокаТоваров.Комментарий;
		СтрЗапись.Этап 							= СтрокаТоваров.ЭтапСтроительства;
		СтрЗапись.Склад 						= Склад;
		СтрЗапись.МОЛ 							= СтрокаТоваров.ИИТ_ЗаявкаНаЗакуп.МОЛПолучателя;
	КонецЦикла;
	
	НаборЗаписей2.Записать(Истина);
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Движение = Движения.ИИТ_ЗаказыПоставщику.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.ЗаказПоставщику = Ссылка;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТоваров);
		Движение.Сумма = СтрокаТоваров.СуммаСНДС;
	КонецЦикла;
	
	Для Каждого СтрокаУслуг Из Услуги Цикл
		Движение = Движения.ИИТ_ЗаказыПоставщику.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.ЗаказПоставщику = Ссылка;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаУслуг);
		Движение.Сумма = СтрокаУслуг.СуммаСНДС;
	КонецЦикла;
	
	Движения.ИИТ_ЗаказыПоставщику.Записать();
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Движение = Движения.ИИТ_ЗаявкиНаЗакуп.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Конфигурация = СтрокаТоваров.Конфигурация;
		Движение.Размер = СтрокаТоваров.Размер;
		Движение.Цвет = СтрокаТоваров.Цвет;
		Движение.Количество = СтрокаТоваров.Количество;
		Движение.ЗаявкаНаЗакуп = СтрокаТоваров.ИИТ_ЗаявкаНаЗакуп;
	КонецЦикла;
	
	Движения.ИИТ_ЗаявкиНаЗакуп.Записать();

КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ)    
	
	ИИТ_ВспомогательныеФункцииСервер.СформироватьСтрокуСчетов(Ссылка);

	Если ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИИТ_ЗаявкаНаЗакупТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИИТ_ЗаявкаНаЗакуп.Товары КАК ИИТ_ЗаявкаНаЗакупТовары
		|ГДЕ
		|	НЕ ИИТ_ЗаявкаНаЗакупТовары.Ссылка.ПометкаУдаления
		|	И ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику1 = &ЗаказПоставщику";
		Запрос.УстановитьПараметр("ЗаказПоставщику", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаТоваров Из ЗаявкаОбъект.Товары Цикл
				Если СтрокаТоваров.ЗаказПоставщику1 = Ссылка Тогда
					СтрокаТоваров.ЗаказПоставщику1 = Документы.ЗаказПоставщику.ПустаяСсылка();
				КонецЕсли;
			КонецЦикла;
			ЗаявкаОбъект.Записать();

		КонецЦикла;

	КонецЕсли;    

КонецПроцедуры

Функция ПолучитьКоличествоЗаявкаНаЗакуп(СтруктураИсточник)
	
	Структура = Новый Структура;
	Структура.Вставить("КоличествоЗаявкаНаЗакуп", 0);
	Структура.Вставить("ЕдИзмЗаявкаНаЗакуп", Неопределено);
	
	НаборЗаписей2 = РегистрыСведений.АС_ДвижениеМатериалов2_6.СоздатьНаборЗаписей();
	НаборЗаписей2.Отбор.ДокументРегистратор.Установить(СтруктураИсточник.ЗаявкаНаЗакуп);
	НаборЗаписей2.Отбор.НоменклатураСнабжения.Установить(СтруктураИсточник.Номенклатура);
	НаборЗаписей2.Отбор.ХарактеристикаНоменклатуры.Установить(СтруктураИсточник.Характеристика);

	НаборЗаписей2.Прочитать(); 
	
	Если НаборЗаписей2.количество()>1 Тогда 	
		р=9;
	ИначеЕсли НаборЗаписей2.количество() = 1 Тогда 		
		Структура.Вставить("ЕдИзмЗаявкаНаЗакуп", НаборЗаписей2[0].ЕдИзмЗаявкаНаЗакуп);
		Структура.Вставить("КоличествоЗаявкаНаЗакуп", НаборЗаписей2[0].КоличествоЗаявкаНаЗакуп);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции