
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	//Добавленные команды  
	КомандаФормы = Команды.Добавить("СостояниеСопоставления");
	КомандаФормы.Заголовок = "Состояние сопоставления";
	КомандаФормы.Действие  = "СостояниеСопоставления";
	
	КнопкаФормы = Элементы.Добавить("ФормаСостояниеСопоставления", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "СостояниеСопоставления";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	КомандаФормы = Команды.Добавить("ВернутьЗаказ");
	КомандаФормы.Заголовок = "Вернуть заказ";
	КомандаФормы.Действие  = "ВернутьЗаказ";

	КнопкаФормы = Элементы.Добавить("ФормаВернутьЗаказ", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "ВернутьЗаказ";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
  	КомандаФормы = Команды.Добавить("ЗакрытьЗаказ");
	КомандаФормы.Заголовок = "Отменить заказ";
	КомандаФормы.Действие  = "ЗакрытьЗаказ";

	КнопкаФормы = Элементы.Добавить("ЗакрытьЗаказ", Тип("КнопкаФормы"), Элементы.ГруппаДатаНомерПоставщика);
	КнопкаФормы.ИмяКоманды = "ЗакрытьЗаказ";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  
	ШрифтПолужирный = Новый Шрифт(КнопкаФормы.Шрифт,,,Истина);
	КнопкаФормы.Шрифт = ШрифтПолужирный;
	КнопкаФормы.ЦветФона = Новый Цвет(255,204,0);
	
	//Поля 
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.ГруппаЛево);
	ПолеВвода_АЛФ.Заголовок = "Объект строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектСтроительства";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЭтапСтроительства", Тип("ПолеФормы"), Элементы.ГруппаЛево);
	ПолеВвода_АЛФ.Заголовок = "Этап строительства";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ЭтапСтроительства";
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_НоменклатураСтрокой", Тип("ПолеФормы"), Элементы.Основное, Элементы.Комментарий);
	ПолеВвода_АЛФ.Заголовок = "Описание заказа";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	     
	ПолеВвода_АЛФ.МногострочныйРежим = Истина;  
	ПолеВвода_АЛФ.АвтоМаксимальнаяШирина = Ложь;
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_НоменклатураСтрокой";
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_НомерСчетаУПД", Тип("ПолеФормы"), Элементы.Основное);
	ПолеВвода_АЛФ.Заголовок = "Номер счета";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "ИИТ_НомерСчетаУПД";
	
	Элементы.Комментарий.Высота = 1;   
	
	//ТЧ Товары, + 2 группы строк с переносом, вставить не работает
	ГруппаКолонок_НГ1 = Элементы.Вставить("НоменклатураГруппа1", Тип("ГруппаФормы"), Элементы.Номенклатура, Элементы.НоменклатураТоварнаяКатегория);
	ГруппаКолонок_НГ1.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_НГ1.ОтображатьВШапке = Ложь;
	
	Элементы.Переместить(Элементы.НоменклатураТоварнаяКатегория, ГруппаКолонок_НГ1);
	Элементы.НоменклатураТоварнаяКатегория.Видимость = Ложь;
	Элементы.Переместить(Элементы.НоменклатураНоменклатура, ГруппаКолонок_НГ1);

	ГруппаКолонок_НГ2 = Элементы.Вставить("НоменклатураГруппа2", Тип("ГруппаФормы"), Элементы.Номенклатура, Элементы.НоменклатураХарактеристика); 
	ГруппаКолонок_НГ2.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_НГ2.ОтображатьВШапке = Ложь;
	
	Элементы.Переместить(Элементы.НоменклатураЕдиницаИзмерения, ГруппаКолонок_НГ2);
	ЭлементТаблицыФормы = Элементы.Добавить("НоменклатураЕдиницаИзмеренияСнабжения", Тип("ПолеФормы"), ГруппаКолонок_НГ2);
	ЭлементТаблицыФормы.Заголовок = "Ед.изм. снабжения"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ЕдиницаИзмеренияСнабжения";
	ЭлементТаблицыФормы.Видимость = Ложь;
	
	//Добавить колонки перед характеристикой
	ЭлементТаблицыФормы = Элементы.Вставить("НоменклатураКонфигурация", Тип("ПолеФормы"), Элементы.Номенклатура, Элементы.НоменклатураХарактеристика);
	ЭлементТаблицыФормы.Заголовок = "Конфигурация"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Конфигурация";

	ЭлементТаблицыФормы = Элементы.Вставить("НоменклатураЦвет", Тип("ПолеФормы"), Элементы.Номенклатура, Элементы.НоменклатураХарактеристика);
	ЭлементТаблицыФормы.Заголовок = "Цвет"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Цвет";
	
	ЭлементТаблицыФормы = Элементы.Вставить("НоменклатураРазмер", Тип("ПолеФормы"), Элементы.Номенклатура, Элементы.НоменклатураХарактеристика);
	ЭлементТаблицыФормы.Заголовок = "Размер"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Размер";
	
	//ТЧ Товары + 1 Группа
	ГруппаКолонок_НГ3 = Элементы.Добавить("НоменклатураГруппа3", Тип("ГруппаФормы"), Элементы.Номенклатура); 
	ГруппаКолонок_НГ3.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок_НГ3.Группировка = ГруппировкаКолонок.Вертикальная;
	ГруппаКолонок_НГ3.ОтображатьВШапке = Ложь;  
	
	ЭлементТаблицыФормы = Элементы.Добавить("НоменклатураОбъект", Тип("ПолеФормы"), ГруппаКолонок_НГ3);
	ЭлементТаблицыФормы.Заголовок = "Объект"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Объект";
	
	ЭлементТаблицыФормы = Элементы.Добавить("НоменклатураЭтапСтроительства", Тип("ПолеФормы"), ГруппаКолонок_НГ3);
	ЭлементТаблицыФормы.Заголовок = "Этап строительства"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ЭтапСтроительства";
	
	//ТЧ + 3 колонки
	ЭлементТаблицыФормы = Элементы.Добавить("НоменклатураИИТ_ЗаявкаНаЗакуп", Тип("ПолеФормы"), Элементы.Номенклатура);
	ЭлементТаблицыФормы.Заголовок = "Заявка на закуп"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ИИТ_ЗаявкаНаЗакуп";
	
	ЭлементТаблицыФормы = Элементы.Добавить("НоменклатураКомментарий", Тип("ПолеФормы"), Элементы.Номенклатура);
	ЭлементТаблицыФормы.Заголовок = "Комментарий"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.Комментарий";

	ЭлементТаблицыФормы = Элементы.Добавить("НоменклатураИИТ_ЗаявкаНаЗакупМОЛПолучателя", Тип("ПолеФормы"), Элементы.Номенклатура);
	ЭлементТаблицыФормы.Заголовок = "МОЛ получателя"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Товары.ИИТ_ЗаявкаНаЗакуп.МОЛПолучателя";
	
	Элементы.НоменклатураТоварнаяКатегория.Видимость = Ложь;
	Элементы.НоменклатураХарактеристика.Видимость = Ложь;
	Элементы.НоменклатураМестоПоставки.Видимость = Ложь;
	Элементы.НоменклатураСклад.Видимость = Ложь;

	// + 2 страницы  УПД, Услуги
	Страница_СД = Элементы.Добавить("СвязанныеДокументы", Тип("ГруппаФормы"), Элементы.Страницы);
	Страница_СД.Вид = ВидГруппыФормы.Страница;
	Страница_СД.Заголовок =  "УПД";
	Страница_СД.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Страница_У = Элементы.Добавить("СтраницаУслуги", Тип("ГруппаФормы"), Элементы.Страницы);
	Страница_У.Вид = ВидГруппыФормы.Страница;
	Страница_У.Заголовок =  "Услуги";
	Страница_У.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	//Таблица УПД
	ТаблицаСД = Элементы.Добавить("ТаблицаУПД", Тип("ТаблицаФормы"), Страница_СД);
	ТаблицаСД.ПутьКДанным = "ТаблицаУПД";
    ТаблицаСД.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТаблицаУПДПоступлениеТоваровУслуг", Тип("ПолеФормы"), ТаблицаСД);
	ЭлементТаблицыФормы.Заголовок = "Поступление товаров услуг (УПД)";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ТаблицаУПД.ПоступлениеТоваровУслуг";
	ЭлементТаблицыФормы.УстановитьДействие("Открытие", "ТаблицаУПДПоступлениеТоваровУслугОткрытие");

	ЭлементТаблицыФормы = Элементы.Добавить("ТаблицаУПДКонтрагент", Тип("ПолеФормы"), ТаблицаСД);
	ЭлементТаблицыФормы.Заголовок = "Контрагент";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ТаблицаУПД.Контрагент";

	ЭлементТаблицыФормы = Элементы.Добавить("ТаблицаУПДНомерВходящегоДокумента", Тип("ПолеФормы"), ТаблицаСД);
	ЭлементТаблицыФормы.Заголовок = "Номер вх. документа";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ТаблицаУПД.НомерВходящегоДокумента";

	ЭлементТаблицыФормы = Элементы.Добавить("ТаблицаУПДСсылка", Тип("ПолеФормы"), ТаблицаСД);
	ЭлементТаблицыФормы.Заголовок = "Ссылка";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ТаблицаУПД.Ссылка";
    ЭлементТаблицыФормы.Видимость = Ложь;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТаблицаУПДСумма", Тип("ПолеФормы"), ТаблицаСД);
	ЭлементТаблицыФормы.Заголовок = "Сумма";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "ТаблицаУПД.Сумма";
	
	//Таблица услуги
	ТаблицаУ = Элементы.Добавить("Услуги", Тип("ТаблицаФормы"), Страница_У);
	ТаблицаУ.ПутьКДанным = "Объект.Услуги";
    ТаблицаУ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ЭлементТаблицыФормы = Элементы.Добавить("УслугиНомерСтроки", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "N";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("УслугиНоменклатура", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Номенклатура";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.Номенклатура";

	ЭлементТаблицыФормы = Элементы.Добавить("УслугиКоличество", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Кол-во";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.Количество";
	ЭлементТаблицыФормы.Видимость = Ложь;  
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиКоличествоПриИзменении");
	
	ЭлементТаблицыФормы = Элементы.Добавить("УслугиЦена", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Цена";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.Цена";
	ЭлементТаблицыФормы.Видимость = Ложь;  
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиЦенаПриИзменении");
	
	ЭлементТаблицыФормы = Элементы.Добавить("УслугиСумма", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Сумма";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.Сумма";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиСуммаПриИзменении");

	ЭлементТаблицыФормы = Элементы.Добавить("УслугиСпособУчетаНДС", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Способ учета ";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.СпособУчетаНДС";   
	ЭлементТаблицыФормы.РежимВыбораИзСписка = Истина;
	ЭлементТаблицыФормы.СписокВыбора.Добавить("НДС сверху 20%", "НДС сверху 20%");
	ЭлементТаблицыФормы.СписокВыбора.Добавить("НДС в сумме 20%", "НДС в сумме 20%");
	ЭлементТаблицыФормы.СписокВыбора.Добавить("Без НДС", "Без НДС");
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиСпособУчетаНДСПриИзменении");

	ЭлементТаблицыФормы = Элементы.Добавить("УслугиСтавкаНДС", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Ставка НДС";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.СтавкаНДС";
	ЭлементТаблицыФормы.Видимость = Ложь;  
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиСтавкаНДСПриИзменении");

	ЭлементТаблицыФормы = Элементы.Добавить("УслугиСуммаНДС", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Сумма НДС";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.СуммаНДС";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиСуммаНДСПриИзменении");
	
	ЭлементТаблицыФормы = Элементы.Добавить("УслугиСуммаСНДС", Тип("ПолеФормы"), ТаблицаУ);
	ЭлементТаблицыФормы.Заголовок = "Сумма с НДС";
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Услуги.СуммаСНДС";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "УслугиСуммаСНДСПриИзменении");
	
	//Подвал
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ИтогоСуммаПоУПД", Тип("ПолеФормы"), Элементы.ГруппаИтогиВсегоСФоном, Элементы.ИтогиВсего);
	ПолеВвода_АЛФ.Заголовок 					= "Сумма УПД";
	ПолеВвода_АЛФ.Вид 							= ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным 					= "ИИТ_ИтогоСуммаПоУПД"; 
	ПолеВвода_АЛФ.Шрифт 						= Новый Шрифт(ПолеВвода_АЛФ.Шрифт,,,Истина);
	ПолеВвода_АЛФ.ШрифтЗаголовка 				= Новый Шрифт(ПолеВвода_АЛФ.ШрифтЗаголовка,,,Истина);
	ПолеВвода_АЛФ.ЦветТекстаЗаголовка 			= Новый Цвет(255,0,0);
	ПолеВвода_АЛФ.ЦветТекста 					= Новый Цвет(255,0,0);
	
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ИтогоСопоставленоПоУПД", Тип("ПолеФормы"), Элементы.ГруппаИтогиВсегоСФоном, Элементы.ИтогиВсего);
	ПолеВвода_АЛФ.Заголовок 					= "Сумма сопоставлено УПД";
	ПолеВвода_АЛФ.Вид 							= ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным 					= "ИИТ_ИтогоСопоставленоПоУПД"; 
	ПолеВвода_АЛФ.Шрифт 						= Новый Шрифт(ПолеВвода_АЛФ.Шрифт,,,Истина);
	ПолеВвода_АЛФ.ШрифтЗаголовка 				= Новый Шрифт(ПолеВвода_АЛФ.ШрифтЗаголовка,,,Истина);
	ПолеВвода_АЛФ.ЦветТекстаЗаголовка 			= Новый Цвет(255,0,0);
	ПолеВвода_АЛФ.ЦветТекста 					= Новый Цвет(255,0,0); 
	 
	Элементы.ИтогиВсего.ЦветТекстаЗаголовка 	= Новый Цвет(255,0,0);
	Элементы.ИтогиВсего.ЦветТекста 				= Новый Цвет(255,0,0);
    Элементы.ИтогиВсего.Шрифт 					= Новый Шрифт(Элементы.ИтогиВсего.Шрифт,,,Истина);
    Элементы.ИтогиВсего.ШрифтЗаголовка 			= Новый Шрифт(Элементы.ИтогиВсего.ШрифтЗаголовка,,,Истина);
	
	Элементы.ИтогиВсегоНДС.ЦветТекстаЗаголовка 	= Новый Цвет(255,0,0);
	Элементы.ИтогиВсегоНДС.ЦветТекста 			= Новый Цвет(255,0,0);
    Элементы.ИтогиВсегоНДС.Шрифт 				= Новый Шрифт(Элементы.ИтогиВсегоНДС.Шрифт,,,Истина);
    Элементы.ИтогиВсегоНДС.ШрифтЗаголовка 		= Новый Шрифт(Элементы.ИтогиВсегоНДС.ШрифтЗаголовка,,,Истина);
	
	ПолеВвода_АЛФ = Элементы.Добавить("ИИТ_ЗаявкаНаЗакуп", Тип("ПолеФормы"));
	ПолеВвода_АЛФ.Заголовок = "Заявка на закуп";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ЗаявкаНаЗакуп"; 

	//+ИИТ_Аксеньюшкин
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИИТ_РуководительСнабжения")
	И Объект.Ответственный <> ПараметрыСеанса.ТекущийПользователь И Не ДокументОткрытЗаместителем() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугИИТ_РаспределениеПоЗаказам.Ссылка КАК ПоступлениеТоваровУслуг
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.ИИТ_РаспределениеПоЗаказам КАК ПоступлениеТоваровУслугИИТ_РаспределениеПоЗаказам
		|ГДЕ
		|	ПоступлениеТоваровУслугИИТ_РаспределениеПоЗаказам.ЗаказПоставщику = &Заказ";
		Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
		
		ТаблицаУПД.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИИТ_СоставДокументов.Состав КАК Состав
		|ИЗ
		|	РегистрСведений.ИИТ_СоставДокументов КАК ИИТ_СоставДокументов
		|ГДЕ
		|	ИИТ_СоставДокументов.Документ = &ДокСсылка";
		Запрос.УстановитьПараметр("ДокСсылка", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИИТ_НомерСчетаУПД = Выборка.Состав;
		Иначе
			ИИТ_НомерСчетаУПД = Объект.ИИТ_НомерСчетаУПД;
		КонецЕсли;

	ИначеЕсли ЗначениеЗаполнено(Объект.ИИТ_НомерСчетаУПД) Тогда

		ИИТ_НомерСчетаУПД = Объект.ИИТ_НомерСчетаУПД;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка.СуммаДокумента КАК Сумма,
		|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка.Контрагент КАК Контрагент,
		|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.СопоставленныеТовары КАК ПоступлениеТоваровУслугСопоставленныеТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугСопоставленныеТовары.ЗаказПоставщику = &ЗаказПоставщику";
		Запрос.УстановитьПараметр("ЗаказПоставщику", Объект.Ссылка);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		ТаблицаУПД.Загрузить(ТЗ);
		Для Каждого СтрокаТЗ ИЗ ТаблицаУПД Цикл
			СтрокаТЗ.ПоступлениеТоваровУслуг = "Поступление товаров и услуг №" + СтрокаТЗ.Ссылка.Номер + " от " + Формат(СтрокаТЗ.Ссылка.Дата);
		КонецЦикла;
		
		ИИТ_ИтогоСуммаПоУПД = ТЗ.Итог("Сумма");
		
		ИИТ_ИтогоСопоставленоПоУПД = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(ПоступлениеТоваровУслугСопоставленныеТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.СопоставленныеТовары КАК ПоступлениеТоваровУслугСопоставленныеТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугСопоставленныеТовары.ЗаказПоставщику = &ЗаказПоставщику";
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", Объект.Ссылка);
		
		ВыборкаСопоставлено = Запрос.Выполнить().Выбрать();
        ВыборкаСопоставлено.Следующий();
		ИИТ_ИтогоСопоставленоПоУПД = ВыборкаСопоставлено.Сумма;
		
	КонецЕсли;
	//-ИИТ_Аксеньюшкин

	Элементы.ТоварыПоПодбору.Видимость = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ПриОткрытииПосле(Отказ)

	//+ИИТ_Аксеньюшкин
	Элементы.ФормаЗаписать.Отображение = ОтображениеКнопки.Картинка;
	Элементы.ФормаЗаписать.Заголовок = "";
	Элементы.ФормаЗаписать.Картинка = БиблиотекаКартинок.СохранитьФайл;
	
	Если Объект.Услуги.Количество() > 0 Тогда		
		ТекДанные = Объект.Услуги[0];
		ОбновитьСуммыДокумента(Объект);
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	
	Элементы.Товары.Видимость = Истина; 
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("НоменклатураНоменклатураНачалоВыбора")
Процедура АЛФ_НоменклатураНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
#Удаление
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	ЦентрализованныеЗакупкиКлиентУХ.ОбработчикНоменклатураНачалоВыбора(
	ТекДанные, ДанныеВыбора);
#КонецУдаления	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("ОбновитьСуммыДокумента")
Процедура АЛФ_ОбновитьСуммыДокумента(Объект)    
#Удаление	
	Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС");
	Объект.СуммаНДС = Объект.Товары.Итог("СуммаНДС");  
#КонецУдаления
#Вставка     
	//+ИИТ_Аксеньюшкин
	Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС") + Объект.Услуги.Итог("СуммаСНДС");
	Объект.СуммаНДС = Объект.Товары.Итог("СуммаНДС") + Объект.Услуги.Итог("СуммаНДС");  
	//-ИИТ_Аксеньюшкин
#КонецВставки
КонецПроцедуры

#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
Функция ДокументОткрытЗаместителем()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	|	Заместители.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	Заместители.ЗамещаемыйПользователь = &ТекущийСогласующий
	|	И Заместители.Заместитель = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийСогласующий", Объект.Ответственный);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ВернутьЗаказ(Команда)
	ВернутьЗаказНаСервере();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ВернутьЗаказНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СопоставленныеТовары КАК ПоступлениеТоваровУслугСопоставленныеТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугСопоставленныеТовары.Ссылка.Проведен
	|	И ПоступлениеТоваровУслугСопоставленныеТовары.ЗаказПоставщику = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить("По данному заказу поставщика уже выполнено частичное сопоставление позиций. Действие отменено.");
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИИТ_ЗаявкаНаЗакупТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИИТ_ЗаявкаНаЗакуп.Товары КАК ИИТ_ЗаявкаНаЗакупТовары
	|ГДЕ
	|	ИИТ_ЗаявкаНаЗакупТовары.Ссылка.Проведен
	|	И ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику1 = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда

		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТЗ Из ДокОбъект.Товары Цикл
			Если СтрокаТЗ.ЗаказПоставщику1 = Объект.Ссылка Тогда
				СтрокаТЗ.Количество1 = 0;
				СтрокаТЗ.Цена1 = "";
				СтрокаТЗ.Сумма1 = "";
				СтрокаТЗ.Контрагент1 = "";
				СтрокаТЗ.ДоговорКонтрагента1 = "";
				СтрокаТЗ.ЗаказПоставщику1 = "";
				СтрокаТЗ.Ответственный = "";
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ЗакрытьЗаказ(Команда)
	ЗакрытьЗаказНаСервере();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервере
Процедура ЗакрытьЗаказНаСервере()
	
	Объект.ИИТ_ОтмененныйЗаказ = Истина;
	Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИИТ_ЗаявкаНаЗакупТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИИТ_ЗаявкаНаЗакуп.Товары КАК ИИТ_ЗаявкаНаЗакупТовары
	|ГДЕ
	|	НЕ ИИТ_ЗаявкаНаЗакупТовары.Ссылка.ПометкаУдаления
	|	И (ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику1 = &ЗаказПоставщику
	|			ИЛИ ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику2 = &ЗаказПоставщику
	|			ИЛИ ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику3 = &ЗаказПоставщику)";
	Запрос.УстановитьПараметр("ЗаказПоставщику", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();

		Для Каждого СтрокаТоваров Из ДокОбъект.Товары Цикл
			Если СтрокаТоваров.ЗаказПоставщику1 = Объект.Ссылка Тогда
				СтрокаТоваров.ЗаказПоставщику1 = "";
				СтрокаТоваров.Контрагент1 = "";
				СтрокаТоваров.ДоговорКонтрагента1 = "";
				СтрокаТоваров.Количество = СтрокаТоваров.Количество1;
				СтрокаТоваров.Количество1 = "";
				СтрокаТоваров.Цена1 = "";
				СтрокаТоваров.Сумма1 = "";
				СтрокаТоваров.Возвращена = Истина;
				СтрокаТоваров.Комментарий = "Назначение ответственного";
				СтрокаТоваров.Ответственный = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
			Если СтрокаТоваров.ЗаказПоставщику2 = Объект.Ссылка Тогда
				СтрокаТоваров.ЗаказПоставщику2 = "";
				СтрокаТоваров.Контрагент2 = "";
				СтрокаТоваров.ДоговорКонтрагента2 = "";
				СтрокаТоваров.Количество2 = "";
				СтрокаТоваров.Цена2 = "";
				СтрокаТоваров.Сумма2 = "";
				СтрокаТоваров.Возвращена = Истина;
				СтрокаТоваров.Комментарий = "Назначение ответственного";
				СтрокаТоваров.Ответственный = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
			Если СтрокаТоваров.ЗаказПоставщику3 = Объект.Ссылка Тогда
				СтрокаТоваров.ЗаказПоставщику3 = "";
				СтрокаТоваров.Контрагент3 = "";
				СтрокаТоваров.ДоговорКонтрагента3 = "";
				СтрокаТоваров.Количество3 = "";
				СтрокаТоваров.Цена3 = "";
				СтрокаТоваров.Сумма3 = "";
				СтрокаТоваров.Возвращена = Истина;
				СтрокаТоваров.Комментарий = "Назначение ответственного";
				СтрокаТоваров.Ответственный = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
		
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИИТ_ЗаявкаНаЗакупТовары.ФактическаяДата КАК ФактическаяДата,
		|	ИИТ_ЗаявкаНаЗакупТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Количество) КАК Количество,
		|	ИИТ_ЗаявкаНаЗакупТовары.Этап КАК Этап,
		|	ИИТ_ЗаявкаНаЗакупТовары.Договор КАК Договор,
		|	ИИТ_ЗаявкаНаЗакупТовары.Ответственный КАК Ответственный,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Количество1) КАК Количество1,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Количество2) КАК Количество2,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Количество3) КАК Количество3,
		|	ИИТ_ЗаявкаНаЗакупТовары.Контрагент1 КАК Контрагент1,
		|	ИИТ_ЗаявкаНаЗакупТовары.Контрагент2 КАК Контрагент2,
		|	ИИТ_ЗаявкаНаЗакупТовары.Контрагент3 КАК Контрагент3,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.КоличествоРаспределено) КАК КоличествоРаспределено,
		|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику1 КАК ЗаказПоставщику1,
		|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику2 КАК ЗаказПоставщику2,
		|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику3 КАК ЗаказПоставщику3,
		|	ИИТ_ЗаявкаНаЗакупТовары.Конфигурация КАК Конфигурация,
		|	ИИТ_ЗаявкаНаЗакупТовары.Цвет КАК Цвет,
		|	ИИТ_ЗаявкаНаЗакупТовары.Размер КАК Размер,
		|	МАКСИМУМ(ИИТ_ЗаявкаНаЗакупТовары.Комментарий) КАК Комментарий,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.КоличествоОтклонить) КАК КоличествоОтклонить,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Сумма1) КАК Сумма1,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Сумма2) КАК Сумма2,
		|	СУММА(ИИТ_ЗаявкаНаЗакупТовары.Сумма3) КАК Сумма3,
		|	ИИТ_ЗаявкаНаЗакупТовары.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	ИИТ_ЗаявкаНаЗакупТовары.ДоговорКонтрагента1 КАК ДоговорКонтрагента1,
		|	ИИТ_ЗаявкаНаЗакупТовары.ДоговорКонтрагента2 КАК ДоговорКонтрагента2,
		|	ИИТ_ЗаявкаНаЗакупТовары.ДоговорКонтрагента3 КАК ДоговорКонтрагента3,
		|	МАКСИМУМ(ИИТ_ЗаявкаНаЗакупТовары.Возвращена) КАК Возвращена
		|ИЗ
		|	Документ.ИИТ_ЗаявкаНаЗакуп.Товары КАК ИИТ_ЗаявкаНаЗакупТовары
		|ГДЕ
		|	ИИТ_ЗаявкаНаЗакупТовары.Ссылка = &СсылкаДок
		|
		|СГРУППИРОВАТЬ ПО
		|	ИИТ_ЗаявкаНаЗакупТовары.ФактическаяДата,
		|	ИИТ_ЗаявкаНаЗакупТовары.Ответственный,
		|	ИИТ_ЗаявкаНаЗакупТовары.НДСВключенВСтоимость,
		|	ИИТ_ЗаявкаНаЗакупТовары.Контрагент1,
		|	ИИТ_ЗаявкаНаЗакупТовары.Размер,
		|	ИИТ_ЗаявкаНаЗакупТовары.Конфигурация,
		|	ИИТ_ЗаявкаНаЗакупТовары.ДоговорКонтрагента3,
		|	ИИТ_ЗаявкаНаЗакупТовары.ДоговорКонтрагента1,
		|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику3,
		|	ИИТ_ЗаявкаНаЗакупТовары.ДоговорКонтрагента2,
		|	ИИТ_ЗаявкаНаЗакупТовары.Договор,
		|	ИИТ_ЗаявкаНаЗакупТовары.Цвет,
		|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику2,
		|	ИИТ_ЗаявкаНаЗакупТовары.Контрагент2,
		|	ИИТ_ЗаявкаНаЗакупТовары.Этап,
		|	ИИТ_ЗаявкаНаЗакупТовары.Номенклатура,
		|	ИИТ_ЗаявкаНаЗакупТовары.ЗаказПоставщику1,
		|	ИИТ_ЗаявкаНаЗакупТовары.Контрагент3";
		Запрос.УстановитьПараметр("СсылкаДок", Выборка.Ссылка);
		
		ДокОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		Для Каждого СтрокаТоваров Из ДокОбъект.Товары Цикл
			СтрокаТоваров.Цена1 = ?(ЗначениеЗаполнено(СтрокаТоваров.Количество1), СтрокаТоваров.Сумма1 / СтрокаТоваров.Количество1, 0);
			СтрокаТоваров.Цена2 = ?(ЗначениеЗаполнено(СтрокаТоваров.Количество2), СтрокаТоваров.Сумма2 / СтрокаТоваров.Количество2, 0);
			СтрокаТоваров.Цена3 = ?(ЗначениеЗаполнено(СтрокаТоваров.Количество3), СтрокаТоваров.Сумма3 / СтрокаТоваров.Количество3, 0);
			СтрокаТоваров.ЕдиницаИзмерения = СтрокаТоваров.Номенклатура.ЕдиницаИзмерения;
		КонецЦикла;

		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();

	КонецЦикла;
	
	НаборЗаписей = РегистрыНакопления.ИИТ_ЗаказыПоставщику.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура СостояниеСопоставления(Команда)

	Перем ФормаОтчёта, КомпоновщикНастроек, Период, ПараметрыФормы;
	
	ФормаОтчёта = ПолучитьФорму("Отчет.ИИТ_ОтчетПоСопоставлениюЗаказов.Форма");
	КомпоновщикНастроек = ФормаОтчёта.Отчет.КомпоновщикНастроек;
	
	УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, "ЗаказПоставщику", Объект.Ссылка);

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "Основной");
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	ОткрытьФорму("Отчет.ИИТ_ОтчетПоСопоставлениюЗаказов.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура ТаблицаУПДПоступлениеТоваровУслугОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаДок = Элементы.ТаблицаУПД.ТекущиеДанные.Ссылка;
	Форма = ПолучитьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары", Новый Структура("Ключ", СсылкаДок));
	Форма.Открыть();
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РасчитатьСуммыСтрокиПоЦене(ТекДанные, Объект.ЦенаВключаетНДС);
	ОбновитьСуммыДокумента(Объект);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиСпособУчетаНДСПриИзменении(Элемент)

	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.Количество = 1;
		ТекСтрока.Цена = ТекСтрока.Сумма;
		Если ТекСтрока.СпособУчетаНДС = "НДС сверху 20%" Тогда
			ТекСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");			
			ТекСтрока.СуммаНДС = ТекСтрока.Сумма * 0.2;
			ТекСтрока.СуммаСНДС = ТекСтрока.Сумма * 1.2;
		ИначеЕсли ТекСтрока.СпособУчетаНДС = "НДС в сумме 20%" Тогда
			ТекСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
			ТекСтрока.СуммаНДС = ТекСтрока.Сумма / 6;
			ТекСтрока.СуммаСНДС = ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.СпособУчетаНДС = "Без НДС" Тогда
			ТекСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
			ТекСтрока.СуммаНДС = 0;
			ТекСтрока.СуммаСНДС = ТекСтрока.Сумма;
		КонецЕсли;
	КонецЕсли;
		
	ОбновитьСуммыДокумента(Объект);

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РасчитатьСуммыСтрокиПоЦене(ТекДанные, Объект.ЦенаВключаетНДС);
	ОбновитьСуммыДокумента(Объект);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ИзменитьТекущуюСтрокуПриИзмененииСуммыБезНДС(ТекДанные, Объект.ЦенаВключаетНДС);
	ОбновитьСуммыДокумента(Объект);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиСуммаСНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ИзменитьТекущуюСтрокуПриИзмененииСуммыСНДС(ТекДанные, Объект.ЦенаВключаетНДС);
	ОбновитьСуммыДокумента(Объект);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	РасчитатьСуммыСтрокиПоЦене(ТекДанные, Объект.ЦенаВключаетНДС);
	ОбновитьСуммыДокумента(Объект);
КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаКлиенте
Процедура УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, ИмяПараметра, Значение)
	
	Перем ПараметрДанных, Настройки, ПользовательскиеНастройки, ПользовательскийПараметр;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПараметрДанных = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если ЗначениеЗаполнено(ПараметрДанных.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
		ПользовательскийПараметр = ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		ПользовательскийПараметр.Использование = Истина;
		ПользовательскийПараметр.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработатьИзменениеНоменклатурыНаСервере")
Процедура АЛФ_ОбработатьИзменениеНоменклатурыНаСервере()
	ТекСтрока = Элементы.ПотребностиПоГодам.ТекущаяСтрока;
	ТекДанные = ПотребностиПоГодам.НайтиПоИдентификатору(ТекСтрока);
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.НоменклатураИсходная = ТекДанные.Номенклатура;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		ТекДанные.ЕдиницаИзмерения =
		УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ПолучитьПустуюЕдиницуИзмерения();
		ТекДанные.Коэффициент = 0;
		ТекДанные.Количество = 0;
		ТекДанные.Цена = 0;
		ТекДанные.Сумма = 0;
		ТекДанные.СуммаСНДС = 0;
		ТекДанные.СуммаНДС = 0;
		Возврат;
	КонеЦЕсли;
	Если ЗначениеЗаполнено(ТекДанные.ЕдиницаИзмерения) Тогда
		Коэффициент = ЦентрализованныеЗакупкиУХ.ПолучитьКоэффициентЕдиницыИзмерения(
		ТекДанные.Номенклатура, ТекДанные.ЕдиницаИзмерения);
		Если Коэффициент = 0 Тогда
			ТекДанные.ЕдиницаИзмерения = ТекДанные.Номенклатура.ЕдиницаИзмерения;
			ТекДанные.Коэффициент = 1;
		КонецЕсли;
	Иначе
		ТекДанные.ЕдиницаИзмерения = ТекДанные.Номенклатура.ЕдиницаИзмерения;
		ТекДанные.Коэффициент = 1;
	КонецЕсли;
	ЗаполнитьСуммовыеПоказателиСтрокиЗаказа(Объект, ТекДанные);
КонецПроцедуры

#КонецОбласти